[
    {
        "couponCode": "1FOR10",
        "couponTitle": "Project Nursery Discount Code: 10% Off Your Order",
        "couponDescription": "Use this promotional code at checkout to get 10% off when you buy 1 set of wall decals."
    },
    {
        "couponCode": "WALLPAPERSALE10",
        "couponTitle": "Spend up to $500, get 10% off wallpaper At Project Nursery",
        "couponDescription": "Use this Project Nursery coupon code at checkout to save 10% off your orders of wallpaper collection $500 or more."
    },
    {
        "couponCode": "HEYSANTA",
        "couponTitle": "Project Nursery Promo Code: 10% Off All Toys",
        "couponDescription": "Use this Project Nursery promo code at checkout to save 10% off your orders of All Toys."
    },
    {
        "couponCode": "BF2024",
        "couponTitle": "Project Nursery Coupon: Save 20% Off Your Purchase",
        "couponDescription": "Score 20% off your eligible order using this promotional code during checkout."
    },
    {
        "couponCode": "THANKU10",
        "couponTitle": "10% Off $40+ Orders At Project Nursery",
        "couponDescription": "Enter this Project Nursery coupon code at checkout to unlock 10% off your orders of $40 or more."
    },
    {
        "couponCode": "FFSALE",
        "couponTitle": "15% Off Your Purchase At Project Nursery",
        "couponDescription": "Use this Project Nursery promo code at checkout to receive 15% off your orders."
    },
    {
        "couponCode": "SAVEMORE20",
        "couponTitle": "Project Nursery's Discount Code: Up to 20% Off Orders $5000+",
        "couponDescription": "Apply this discount code at checkout and enjoy up to a 20% off on orders over $5000."
    },
    {
        "couponCode": "BEDDING10",
        "couponTitle": "10% Off Your Order",
        "couponDescription": "Take 10% off your purchase of 2 or more items using a coupon code on your cart."
    },
    {
        "couponCode": "BOGO30",
        "couponTitle": "30% Off Your Purchase",
        "couponDescription": "Receive 30% off your purchase using a coupon code on your cart."
    },
    {
        "couponCode": "GET10",
        "couponTitle": "Take 10% Off Your Order",
        "couponDescription": "Enjoy 10% off when you buy one set at Project Nursery."
    },
    {
        "couponCode": "SB10",
        "couponTitle": "Score 10% Off Your Order",
        "couponDescription": "Spend $50 on your purchase to enjoy 10% off. To qualify, simply apply this Project Nursery code at checkout."
    },
    {
        "couponCode": "LUCKYWALLS",
        "couponTitle": "Score 15% Off Your Order",
        "couponDescription": "Enjoy 15% off your cart using the coupon code in your shopping cart at Project Nursery's checkout."
    },
    {
        "couponCode": "HOLIDAYWALLS",
        "couponTitle": "Get 10% Off Holiday Wall Decals",
        "couponDescription": "Apply this Project Nursery coupon code to save 10% off holiday wall decals purchase."
    },
    {
        "couponCode": "cm2024",
        "couponTitle": "20% Off Everything At Project Nursery",
        "couponDescription": "Enter this 20 discount code at checkout to get 20% off your total orders."
    },
    {
        "couponCode": "EARLYBIRDSALE",
        "couponTitle": "Project Nursery Coupon Code: 15% Off Wall Decals",
        "couponDescription": "Add this Project Nursery promo code at checkout to unlock 15% off your orders of wall decals."
    },
    {
        "couponCode": "FLORAL4FALL",
        "couponTitle": "Project Nursery Discount Code: 15% Off Everything Floral",
        "couponDescription": "Add this Project Nursery discount code at checkout to enjoy 15% off your orders of Everything Floral."
    },
    {
        "couponCode": "PRIMEYOURWALL",
        "couponTitle": "Project Nursery Coupon: 10% Off Your Order",
        "couponDescription": "Take 10% off your wallpaper purchase of $300 and more at Project Nursery."
    },
    {
        "couponCode": "PEPPYLU",
        "couponTitle": "Project Nursery Coupon Code: Take 15% Off Wall Decals",
        "couponDescription": "Receive a 15% discount on wall decals when you use this promo code during checkout."
    },
    {
        "couponCode": "BUNNY",
        "couponTitle": "Project Nursery Code: 25% Off Easter Basket Gift",
        "couponDescription": "Use this Project Nursery promo code at checkout to receive 25% off your orders of Easter Basket Gift."
    },
    {
        "couponCode": "LEAPYEAR",
        "couponTitle": "Project Nursery Coupon: Take 15% Off Wall Decals",
        "couponDescription": "Enter this Project Nursery coupon code at checkout to get 15% off your orders of% off all wall decals."
    }
]