[
    {
        "couponCode": "VIP15",
        "couponTitle": "Receive 15% Off Your Purchase",
        "couponDescription": "Shop and save 15% on your order at Dagne Dover today. Use this coupon code during checkout to redeem the discount. Don't miss out on this one."
    },
    {
        "couponCode": "MINAHAMIDEH20",
        "couponTitle": "Dagne Dover Discount Code: Take 20% Off Your Order",
        "couponDescription": "Save 20% on all regular-priced items at Dagne Dover with this discount code. Apply the code during checkout for your savings. Don't miss out on this limited-time offer."
    },
    {
        "couponCode": "SOULMATE15",
        "couponTitle": "Save 15% Off Sitewide",
        "couponDescription": "Enjoy Up to 15% Off on Your Entire Order"
    },
    {
        "couponCode": "DD10",
        "couponTitle": "Dagne Dover Coupon: 10% Off",
        "couponDescription": "Get 10% off orders with Dagne Dover's promo code on your cart at checkout."
    },
    {
        "couponCode": "VICTORIA20",
        "couponTitle": "Receive 20% Off Your Purchase",
        "couponDescription": "Apply this Dagne Dover promo code during checkout to get 20% off your select order."
    },
    {
        "couponCode": "ALLIEMARIE25",
        "couponTitle": "Dagne Dover Coupon Code: 25% Off Your Purchase",
        "couponDescription": "Enjoy an extra 25% off full-priced items when you use this promo code at checkout."
    },
    {
        "couponCode": "GRETCHEN25",
        "couponTitle": "25% Off Your Order",
        "couponDescription": "Shop and take 25% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "MCKENNA20",
        "couponTitle": "Up To 10% Off Your Order At Dagne Dover",
        "couponDescription": "Enter this Dagne Dover promo code at checkout to take up to 10% off your orders."
    },
    {
        "couponCode": "JADYNHICKS20",
        "couponTitle": "Up To 10% Off Your Purchase At Dagne Dover",
        "couponDescription": "Enter this Dagne Dover coupon code at checkout to receive up to 10% off your orders"
    },
    {
        "couponCode": "SMW20",
        "couponTitle": "Save 20% on Full Price Items ",
        "couponDescription": "Shop at Dagne Dover and get a 20% discount on full priced items. Apply this discount code at checkout."
    },
    {
        "couponCode": "MARISSA20",
        "couponTitle": "Dagne Dover Promo Code: 20% Off",
        "couponDescription": "Order using Dagne Dover's coupon code and receive 20% off your sitewide purchase at checkout."
    },
    {
        "couponCode": "JCATHELL20",
        "couponTitle": "Dagne Dover Promo Code: 20% Off",
        "couponDescription": "Shop using Dagne Dover's discount code and get 20% off your purchase at Dagne Dover."
    },
    {
        "couponCode": "TESSA20",
        "couponTitle": "Receive 20% Off Your Purchase",
        "couponDescription": "Simply apply this Dagne Dover promo code at checkout to enjoy 20% off your order."
    },
    {
        "couponCode": "NIKIDETRICH20",
        "couponTitle": "Dagne Dover Coupon Code: Up To 10% Off Your Purchase",
        "couponDescription": "Apply this Dagne Dover discount code at checkout to take up to 10% off your orders."
    },
    {
        "couponCode": "ASHBEGASH20",
        "couponTitle": "Dagne Dover Coupon Code: Get 20% Off Your Order",
        "couponDescription": "Save 20% on your order at Dagne Dover with this coupon code. Shop now for stylish bags, backpacks, and accessories at a great discount. Don't miss this Dagne Dover sale to update your collection."
    },
    {
        "couponCode": "FIFIMARIE20",
        "couponTitle": "Dagne Dover Promo Code: 20% Off Your Purchase",
        "couponDescription": "Use this Dagne Dover coupon to save 20% on full-size purchases."
    },
    {
        "couponCode": "DREAMYDAYS25",
        "couponTitle": "Dagne Dover Discount Code: Take 25% Off Any Purchase ",
        "couponDescription": "Shop at Dagne Dover and enjoy a 25% discount on any purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "LACEY20",
        "couponTitle": "Dagne Dover Coupon: 20% Off Your Order",
        "couponDescription": "Take 20% off work and travel bags at Dagne Dover."
    },
    {
        "couponCode": "LINDS20",
        "couponTitle": "Dagne Dover Coupon Code: Take 20% Off Any Purchase ",
        "couponDescription": "Enjoy a 20% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "SHAUNA25",
        "couponTitle": "Dagne Dover Coupon Code: Take 25% Off Any Purchase ",
        "couponDescription": "Enjoy a 25% discount on any purchase when you enter this coupon code at checkout."
    }
]