[
    {
        "couponCode": "865630Lat",
        "couponTitle": "Dell Outlet Coupon: Up to 30% Off Latitude Laptops + Extra 10% Off Your Order",
        "couponDescription": "Score up to 30% off on Latitude Laptops, plus snag an extra 10% with your coupon code. Now's the perfect time to shop these unbeatable deals at Dell Outlet."
    },
    {
        "couponCode": "865835Pre",
        "couponTitle": "Dell Outlet Coupon: Up to 35% Off Precision Laptops + Extra 10% Off Your Order",
        "couponDescription": "Score up to 35% off on Precision Laptops with an additional 10% off using this coupon code at outlet.us.dell.com."
    },
    {
        "couponCode": "814016U27",
        "couponTitle": "Get Ultra Sharp Monitor For $226",
        "couponDescription": "Enjoy 27 ultra sharp, QHD, USB-C Hub Monitor just $226 at Dell Outlet."
    },
    {
        "couponCode": "815217P24",
        "couponTitle": "Dell Outlet Discount Code: 17% Off Dell Refurbished Professional 24 inch Monitor - P2423",
        "couponDescription": "Enter this Dell Outlet discount code at checkout to take 17% off your order of Dell Refurbished Professional 24 inch Monitor - P2423."
    },
    {
        "couponCode": "817418S27",
        "couponTitle": "Save 15% Off Your Purchase",
        "couponDescription": "Enjoy an extra 15% off when you enter this Dell Outlet code at checkout."
    },
    {
        "couponCode": "819730Opt",
        "couponTitle": "Dell Outlet Discount Code: Save 15% on Any Purchase ",
        "couponDescription": "Shop at Dell Outlet and enjoy a 15% discount on any purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "864815R66",
        "couponTitle": "Dell Outlet Coupon: Up to $6,999 Off Select Dell Outlet PowerEdge 16G Rack Servers + Extra 15% Off ",
        "couponDescription": "Get up to $6,999 off on select Dell Outlet PowerEdge 16G Rack Servers (including the R660, R760, R7625, and R7615). Plus, enjoy an extra 15% off from the Outlet Discount with this coupon code."
    },
    {
        "couponCode": "865935Pre",
        "couponTitle": "Dell Outlet Coupon: Up to 35% Off on Precision Desktops + Extra 10% Off ",
        "couponDescription": "Save up to 35% on Precision Desktops at outlet.us.dell.com. Plus, stack an extra 10% off with this coupon code for even more bang for your buck."
    },
    {
        "couponCode": "865322R64",
        "couponTitle": "Dell Outlet Coupon: Up to $9,999 Off Select Dell Outlet PowerEdge Rack Servers + Extra 22% Off",
        "couponDescription": "Get ready to save a whopping $9,999 on select Dell Outlet PowerEdge Rack Servers, including the PowerEdge R640, R740, and R740xd. Plus, get an extra 22% off all other orders, only at outlet.us.dell.com."
    },
    {
        "couponCode": "865730Opt",
        "couponTitle": "Dell Outlet Coupon: Up to 30% Off on OptiPlex Desktops & All-in-Ones ",
        "couponDescription": "Score up to 30% off on OptiPlex Desktops and All-in-Ones with an extra 10% coupon plus instant Outlet Discounts."
    },
    {
        "couponCode": "865117R55",
        "couponTitle": "Dell Outlet Coupon: Up to $4,999 Off Your Order ",
        "couponDescription": "Get ready to save up to $4,999 on select Dell Outlet PowerEdge Rack Servers (PowerEdge R550/R6515). Use this coupon code at outlet.us.dell.com to unlock this deal."
    },
    {
        "couponCode": "863617R75",
        "couponTitle": "Dell Outlet Coupon: Up to $4,999 Off Your Dell PowerEdge Rack Server",
        "couponDescription": "Enjoy up to $4,999 off select Dell Outlet PowerEdge Rack Servers (R650/R750/R750XS) when you use this coupon code at outlet.us.dell.com."
    },
    {
        "couponCode": "796450Ali",
        "couponTitle": "Dell Outlet Coupon: Extra 12% Off on Alienware Desktops",
        "couponDescription": "Score big with an exciting 12% discount on Alienware desktops at outlet.us.dell.com. Don't miss out on this fantastic deal and upgrade your desktop today."
    },
    {
        "couponCode": "793250R64",
        "couponTitle": "Dell Outlet Coupon: Extra 50% Off on 14G Rack Server",
        "couponDescription": "Get ready to celebrate with Dell Outlet's spectacular holiday deals. We're offering an unbelievable 50% off on their robust 14G Rack Servers. Don't miss this fantastic opportunity to upgrade your business tech for less at Dell Outlet."
    },
    {
        "couponCode": "793420T15",
        "couponTitle": "Dell Outlet Coupon: Extra 20% Off on Tower Server",
        "couponDescription": "Experience unbeatable savings at Dell Outlet. Get an extra 20% off on their high-performance tower servers. Upgrade your tech gear while saving money at Dell Outlet."
    },
    {
        "couponCode": "796635Ins",
        "couponTitle": "Dell Outlet Coupon: Extra 10% Off on Inspiron Desktops and All-in-One Computers",
        "couponDescription": "Secure an additional 10% discount on Inspiron Desktops and all-in-one computers at Dell Outlet. Shop exclusive discounts on high-quality tech products without straining your budget."
    },
    {
        "couponCode": "796535XPS",
        "couponTitle": "Dell Outlet Coupon: 10% Off Your Order",
        "couponDescription": "Experience the joy of saving with 10% off at outlet.us.dell.com. Use this coupon code and enjoy incredible deals on top-quality computers and accessories."
    },
    {
        "couponCode": "793318R65",
        "couponTitle": "Dell Outlet Coupon: Extra 18% Off on 15G Rack Server",
        "couponDescription": "Here's an exciting holiday offer at Dell Outlet. Get an extra 18% off on the robust 15G Rack Server at outlet.us.dell.com. Make this holiday season merrier with unbeatable deals on high-quality servers."
    },
    {
        "couponCode": "796350Ali",
        "couponTitle": "Dell Outlet Coupon: Extra 12% Off on Alienware Laptops",
        "couponDescription": "Score a super deal at outlet.us.dell.com. Get an extra 12% off on Alienware laptops. Upgrade your gaming experience without breaking the bank. Shop now."
    },
    {
        "couponCode": "793515R66",
        "couponTitle": "Dell Outlet Coupon: Extra 15% Off on 16G Rack Server",
        "couponDescription": "Get ready to ramp up your storage solutions. Use the online promo code at outlet.us.dell.com and take an extra 15% off on their 16G Rack Server. Don't miss out, these holiday deals are sizzling hot and just a click away."
    }
]