[
    {
        "couponCode": "OP10",
        "couponTitle": "Save 10% Off",
        "couponDescription": "a singles'' day exclusive offer from original penguin - take an extra 10% off on already reduced styles with coupon code! valid 11/7 to 11/11"
    },
    {
        "couponCode": "OP25",
        "couponTitle": "Save 25% Off Clearance w/ Discount Code",
        "couponDescription": "Use the coupon at Original Penguin to receive an additional 25% off clearance items."
    },
    {
        "couponCode": "OP30",
        "couponTitle": "Original Penguin Promo Code: Get Up to 30% Off Your Order",
        "couponDescription": "Redeem this promo code at checkout and enjoy up t6o 30% discount on your order."
    },
    {
        "couponCode": "OP35",
        "couponTitle": "Original Penguin Promo Code: Extra 35% Off Your Order",
        "couponDescription": "Spend an additional 35% off your Clearance purchase using Original Penguin's promo code at checkout."
    },
    {
        "couponCode": "OPFINAL60",
        "couponTitle": "Save 60% Off",
        "couponDescription": "Apply this Original Penguin discount code at checkout to receive Extra 60% off your orders of Clearance styles."
    },
    {
        "couponCode": "OPFINAL40",
        "couponTitle": "Original Penguin Coupon: 40% Off Your Order",
        "couponDescription": "Get extra 40% off clearance items at Original Penguin."
    },
    {
        "couponCode": "GA15",
        "couponTitle": "Get 50% Off Your Purchase",
        "couponDescription": "Save 50% on clothing, shoes and more at Original Penguin."
    },
    {
        "couponCode": "GET30",
        "couponTitle": "Save 30% Off w/ Discount Code",
        "couponDescription": "Receive an extra 30% off Clearance using this discount code on your cart at Original Penguin."
    },
    {
        "couponCode": "OPEXTRA30",
        "couponTitle": "Extra 30% Off On All Clearance Items",
        "couponDescription": "With this offer, take an additional 30% off all clearance items."
    },
    {
        "couponCode": "OPGCART2FDB53",
        "couponTitle": "Get 10% Discount Using Promo Code",
        "couponDescription": "Take 10% off with promo code"
    },
    {
        "couponCode": "OP15",
        "couponTitle": "Save 15% Off",
        "couponDescription": "Take 15% off your orders"
    },
    {
        "couponCode": "openxtra20",
        "couponTitle": "Take 20% Off Select Orders $100 or More",
        "couponDescription": "Save 20% on orders of select items over $100 at Original Penguin. Use this promo code at checkout to claim your discount. Don't miss out on this limited-time offer."
    },
    {
        "couponCode": "EXTRA25",
        "couponTitle": "25% Savings at Original Penguin",
        "couponDescription": "Get a 25% discount on clearance items when you apply this coupon code at checkout."
    },
    {
        "couponCode": "OLPFREESHIP",
        "couponTitle": "Receive Free Shipping on Orders",
        "couponDescription": "Unleash your style with Original Penguin. Grab the exclusive promo code for free shipping on your favorite items. From classic polos, trendy shirts, comfy hoodies to stylish accessories - now is the perfect time to upgrade your wardrobe. Enjoy this amazing discount and strut in style with Original Penguin. Hurry, shop now and save more."
    },
    {
        "couponCode": "OPBT30",
        "couponTitle": "Enjoy 30% Off Your Order",
        "couponDescription": "Big Tall Orders from Original Penguin get an additional 30% off with a coupon."
    },
    {
        "couponCode": "FREESHIP",
        "couponTitle": "Free Shipping with Code",
        "couponDescription": "enjoy free shipping on your purchases using the promo code at checkout."
    },
    {
        "couponCode": "OPEXTRA25",
        "couponTitle": "Save Extra 25% Off Clearance Items with Discount Code",
        "couponDescription": "Enjoy an extra 25% savings on clearance items when you paste this code at checkout."
    },
    {
        "couponCode": "OP40",
        "couponTitle": "Get 40% Off Select Items",
        "couponDescription": "Apply this Original Penguin promo code at checkout for a 40% discount on big and tall styles."
    },
    {
        "couponCode": "OPFREESHIP",
        "couponTitle": "Get Free Shipping With This Checkout Code",
        "couponDescription": "Enjoy free shipping on your order. Apply this coupon code at checkout."
    },
    {
        "couponCode": "OPEXTRA20",
        "couponTitle": "Original Penguin's Coupon Code: Get Extra 20% Off Your Purchase ",
        "couponDescription": "Redeem this promo code at checkout and enjoy an extra 20% off on your purchase."
    }
]