[
    {
        "couponCode": "NEWYEAR2025",
        "couponTitle": "Take 50% Off Shipping",
        "couponDescription": "Save 50% on shipping by adding this Dollar Tree code."
    },
    {
        "couponCode": "EESHIP",
        "couponTitle": "Dollar Tree Discount Code: Score 25% Off Your Order",
        "couponDescription": "Apply the promo code to receive 25% off your complete next order across the board."
    },
    {
        "couponCode": "FREE",
        "couponTitle": "Dollar Tree Coupon Code: 10% Off Your Order",
        "couponDescription": "Shop and take 10% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "GIFT24",
        "couponTitle": "Take 50% Shipping",
        "couponDescription": "Enjoy 50% off shipping fees with this Dollar Tree code."
    },
    {
        "couponCode": "FESTIVE23",
        "couponTitle": "Dollar Tree Coupon: 50% Off Your Purchase",
        "couponDescription": "Score a whopping 50% off on your current purchase at dollartree.com, where everything is already a bargain. From kitchen essentials to party decorations, enjoy incredible savings on an extensive range of products with this coupon code."
    },
    {
        "couponCode": "WELCOME2024",
        "couponTitle": "Dollar Tree Coupon: 10% Off Your Order",
        "couponDescription": "Take 10% off on new customer purchase at Dollar Tree."
    },
    {
        "couponCode": "TWITTER15",
        "couponTitle": "Save 15% Off",
        "couponDescription": "hi! thanks for following! if you do shop with me, remember to use coupon code at checkout to claim your 15% discount!"
    },
    {
        "couponCode": "LARTREE10",
        "couponTitle": " Dollar Tree's Promo Code: Get Up to 60% Off Your Order",
        "couponDescription": "Redeem this promo code at checkout and enjoy up to a 60% off on your order."
    },
    {
        "couponCode": "HOLIDAY",
        "couponTitle": "Take $5 Off w/ Promo Code",
        "couponDescription": "Get $5 off with coupon code"
    },
    {
        "couponCode": "NEWYEAR24",
        "couponTitle": "Dollar Tree Coupon: 50% Off Your Shipping Costs",
        "couponDescription": "Enjoy a massive 50% off at dollartree.com with this promo code. Don't miss out on this fantastic deal as you shop for your favorite dollar-store items."
    },
    {
        "couponCode": "GATHER23",
        "couponTitle": "Dollar Tree Coupon: 50% Off on Shipping",
        "couponDescription": "Enjoy incredible discounts at dollartree.com with their special 50% off discount code. This fantastic promotion applies sitewide, allowing you to save half on everything you need, from household essentials to beauty products, party supplies, and more."
    },
    {
        "couponCode": "BULK",
        "couponTitle": "Save 25% Off",
        "couponDescription": "Get 25% off with promo code"
    },
    {
        "couponCode": "TINSEL24",
        "couponTitle": "Dollar Tree Coupon: 24% Off Your Order",
        "couponDescription": "Enjoy 24% off your qualifying purchase using this promotional code at checkout."
    },
    {
        "couponCode": "BONUS10SUNFUN40",
        "couponTitle": "Dollar Tree Coupon: 40% Off Your Order",
        "couponDescription": "Take 40% off your Dollar Tree purchase with this code."
    },
    {
        "couponCode": "BLACK55",
        "couponTitle": "Dollar Tree Discount Code: 55% Off YOur Order",
        "couponDescription": "Shop and take 55% off your purchase using a coupon code on your cart."
    },
    {
        "couponCode": "CYBER23",
        "couponTitle": "Dollar Tree Coupon: 50% Off Shipping Rates",
        "couponDescription": "Enjoy a massive 50% off your purchase at dollartree.com by using their discount code. This exciting offer applies sitewide, giving you the chance to explore amazing deals on all items. Don't miss out on this opportunity to make the most of your shopping experience with us."
    },
    {
        "couponCode": "L23",
        "couponTitle": "Dollar Tree Coupon Code: 25% Off Your Order",
        "couponDescription": "Apply this coupon code from Dollar Tree to receive a 25% discount on your order."
    },
    {
        "couponCode": "DTHOLIDAY20",
        "couponTitle": "Dollar Tree Promo Code: Get 20% Off Your Purchase",
        "couponDescription": "Use this promo code at Dollar Tree to get 20% off your entire order when you check out."
    },
    {
        "couponCode": "DOLLARTREE100",
        "couponTitle": "Dollar Tree Discount Code: Save Up to 10% on Any Purchase",
        "couponDescription": "Apply this discount code and enjoy up to 10% discount on any purchase."
    },
    {
        "couponCode": "BONUS10",
        "couponTitle": "Save 10% on Online Purchases",
        "couponDescription": "Get 10% off on most items when you use this Dolar Tree coupon code at checkout."
    }
]