[
    {
        "couponCode": "WEST20",
        "couponTitle": "Receive 20% Off Your Order",
        "couponDescription": "Enter this Petal and Pup discount code during checkout to score 20% off your purchase."
    },
    {
        "couponCode": "FIRST15",
        "couponTitle": "Enjoy Up to 15% Off w/ Promo Code",
        "couponDescription": "Buy at petalandpup.com and get an up to 15% discount on your order at checkout using promotional code. Limited time only."
    },
    {
        "couponCode": "EVERYTHING25",
        "couponTitle": "25% Off Any Order",
        "couponDescription": "Use this Petal and Pup coupon to enjoy a massive 25% off discount on your favorite clothing, accessories, and more. Don't miss out on this amazing offer to upgrade your wardrobe with fabulous styles at unbeatable prices. Shop now at petalandpup.com and make the most of this limited-time deal."
    },
    {
        "couponCode": "BUY1GET1FREE",
        "couponTitle": "Petal and Pup's Coupon: Buy 1, Get 1 Free On Your Order",
        "couponDescription": "Buy 1, get 1 free when you use this Petal and Pup code."
    },
    {
        "couponCode": "KATRINA20",
        "couponTitle": "Take 20% Off Your Purchase ",
        "couponDescription": "Enjoy shopping and get a 20% discount on your purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "CART15",
        "couponTitle": "Petal & Pup Coupon: Up to 15% Off Your Purchase",
        "couponDescription": "Get up to 15% off sitewide orders with Petal and Pup's promo code on your cart at checkout."
    },
    {
        "couponCode": "HALFOFF",
        "couponTitle": "Take 50% Off Your Purchase",
        "couponDescription": "Save 50% on summer select styles at Petal and Pup."
    },
    {
        "couponCode": "BESTDEAL25",
        "couponTitle": "Petal and Pup Coupon: 20%-50% Off Your Order",
        "couponDescription": "Spruce up your wardrobe with 20% to 50% off at Petal and Pup. Just use this coupon code and snag trendy styles for the season ahead."
    },
    {
        "couponCode": "TEXT15",
        "couponTitle": "Get 15% Off Select Items with Promo Code",
        "couponDescription": "Redeem this coupon code at checkout and take a 15% discount on select items."
    },
    {
        "couponCode": "BREE20",
        "couponTitle": "Petal & Pup Coupon: 20% Off Your Purchase",
        "couponDescription": "Receive 20% off your storewide orders with Petal & Pup's promo code. Redeem at checkout."
    },
    {
        "couponCode": "BLACKFRIDAY30",
        "couponTitle": "Black Friday Sale: Save 30% on Your Purchase",
        "couponDescription": "Enjoy shopping during the Black Friday Sale and receive a 30% discount on your order. Enter this coupon code at checkout."
    },
    {
        "couponCode": "JESSI20",
        "couponTitle": "Petal & Pup Coupon: 20% Off Your Order",
        "couponDescription": "Take 20% off sitewide by adding this Petal and Pup code."
    },
    {
        "couponCode": "NEW30",
        "couponTitle": "Petal And Pup Coupon: Take 30% Off Your Order",
        "couponDescription": "Save extra 30% on new arrivals by adding this Petal And Pup code."
    },
    {
        "couponCode": "SAVE25",
        "couponTitle": "Take 25% Off Dresses and Jumpsuits",
        "couponDescription": "Enjoy shopping and get 25% discount on dresses and jumpsuits when you enter this coupon code at checkout."
    },
    {
        "couponCode": "UP15",
        "couponTitle": "Petal and Pup Discount Code: Save Extra 15% on Your Purchase ",
        "couponDescription": "Shop at Petal and Pup and enjoy an extra 15% discount on your purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "SAVE40",
        "couponTitle": "Get 40% Off Select Styles with Promo Code",
        "couponDescription": "Get a 40% discount on select styles. Enter this coupon code at checkout."
    },
    {
        "couponCode": "GETAWAY20",
        "couponTitle": "Receive 20% Off Your Order",
        "couponDescription": "Apply this promo code to full-priced goods to receive a 20% discount."
    },
    {
        "couponCode": "SPARKLE10",
        "couponTitle": "Save 10% Off Using Code",
        "couponDescription": "Save 10% off with coupon"
    },
    {
        "couponCode": "25OFF",
        "couponTitle": "Take 25% Off Sitewide with Promo Code",
        "couponDescription": "Save 25% on your order. Apply this coupon code at checkout."
    },
    {
        "couponCode": "20JADA",
        "couponTitle": "Petal & Pup Coupon Code: Take 20% Off Sitewide",
        "couponDescription": "Use this Petal & Pup coupon code to get 20% off sitewide. Shop trendy fashion and accessories at a discounted price. Dont miss out on this limited-time deal."
    }
]