[
    {
        "couponCode": "EXTRA15",
        "couponTitle": "Get 15% Off Your Order",
        "couponDescription": "Save at COS by getting 15% on your purchase."
    },
    {
        "couponCode": "SWA9-4R8R",
        "couponTitle": "COS Promo Code: Take 10% Off Your Purchase",
        "couponDescription": "Save 10% on your next purchase with this promo code at COS. Apply the code at checkout for instant savings on stylish apparel. Shop now to refresh your wardrobe without breaking the bank."
    },
    {
        "couponCode": "LPQ4-7ST8",
        "couponTitle": "10% Off with COS Promo Code",
        "couponDescription": "Redeem this promo code at checkout to enjoy 10% off your entire purchase at COS."
    },
    {
        "couponCode": "TEXTHELLOCOS",
        "couponTitle": "COS Coupon Code: $50 Off Your Purchase",
        "couponDescription": "Apply this promotional code at checkout to get $50 off your select order."
    },
    {
        "couponCode": "COS23SOC10",
        "couponTitle": "10% Off Your Order",
        "couponDescription": "Shop and take 10% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "hellocos10",
        "couponTitle": "10% Off Your First Order with COS Promo Code",
        "couponDescription": "Sign up for a COS account and enjoy 10% off your first order when you enter this promo code at checkout."
    },
    {
        "couponCode": "WELCOME10",
        "couponTitle": "COS Coupon: 10% Off Your Order",
        "couponDescription": "Take 10% off when you add this COS code."
    },
    {
        "couponCode": "WINTER2024",
        "couponTitle": "Take Up to 10% Off Your Order w/ Promo Code",
        "couponDescription": "Save up to 10% on your eligible purchase when this COS coupon code is applied."
    },
    {
        "couponCode": "cozy20",
        "couponTitle": "Save 20% Off Your Order ",
        "couponDescription": "Hurry up! Shop now at COS and receive a 20% discount on your order. Redeem this discount code at checkout."
    },
    {
        "couponCode": "WARMUP25",
        "couponTitle": "Get Up to 10% Off Any Order ",
        "couponDescription": "Paste this promo code at checkout and save up to 10% on any order."
    },
    {
        "couponCode": "TAKE20",
        "couponTitle": "COS Promo Code: 20% Off Your Order",
        "couponDescription": "Shop and take 20% off your purchase using a promo code at checkout."
    },
    {
        "couponCode": "NEWCOS10",
        "couponTitle": "Join the COS Email List and Save 10% on Your Next Order",
        "couponDescription": "Signing up for COS email updates only takes a few seconds, why say no to a subscriber-exclusive 15% discount?"
    },
    {
        "couponCode": "20VIP",
        "couponTitle": "COS Promo Code: Get 20% Off Your Order",
        "couponDescription": "Save 20% on your order at COS with this promo code. Discover stylish, high-quality pieces at an even better price. Use the code at checkout to enjoy instant savings."
    },
    {
        "couponCode": "20OFF",
        "couponTitle": "Take 20% Off Any Purchase ",
        "couponDescription": "Enjoy shopping and get a 20% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "20FF",
        "couponTitle": "Get 20% Off Any Order with COS Coupon",
        "couponDescription": "Take up to 20% off your COS purchase with this code. Save on the best high quality fashion items on your next order."
    },
    {
        "couponCode": "25VIPFF",
        "couponTitle": "Up to 10% Off Your Order w/ Promo Code",
        "couponDescription": "Score up to 10% off your qualifying purchase when you use this COS coupon code at checkout."
    },
    {
        "couponCode": "WNQ323S",
        "couponTitle": "Grab Up to 15% Off Your Purchase",
        "couponDescription": "Shop for accessories like bags, sunglasses, purses, and more using this COS coupon code and get up to 15% off your order."
    },
    {
        "couponCode": "SHOPFALL",
        "couponTitle": "COS Promo Code: Up to 25% Off Your Order",
        "couponDescription": "Shop and get up to 25% off using this discount code on your purchase at COS."
    },
    {
        "couponCode": "COS10XMR",
        "couponTitle": "COS Coupon Code: 10% Off Next Purchase",
        "couponDescription": "Shop for dresses, tops, and more this season at COS and score an extra 10% off your next purchase with this promo code."
    },
    {
        "couponCode": "EXTRA20",
        "couponTitle": "Take an Extra 20% Off Your Order",
        "couponDescription": "Save an extra 20% off on your next purchase at COS. Get the best deals on tops, skirts, pants, and more."
    }
]