[
    {
        "couponCode": "CYBERSZN",
        "couponTitle": "Save 30% Off Sitewide w/ Discount Code",
        "couponDescription": "30% off sitewide only valid on  must enter promo code at checkout."
    },
    {
        "couponCode": "KAY15",
        "couponTitle": "Save 15% with Code",
        "couponDescription": "Apply this coupon code at Tarte Cosmetics to receive 15% off your order at checkout."
    },
    {
        "couponCode": "SHAY15",
        "couponTitle": "Tarte Cosmetics Promo Code: 15% Off",
        "couponDescription": "Shop and get 15% off using this discount code on your purchase at Tarte Cosmetics."
    },
    {
        "couponCode": "15OFF",
        "couponTitle": "Take 15% Off Your Order",
        "couponDescription": "Save at Tarte Cosmetics by getting 15% on makeup."
    },
    {
        "couponCode": "stylecusp",
        "couponTitle": "Take 15% Off at Tarte Cosmetics",
        "couponDescription": "Apply this promo code to receive a 15% discount on your purchase."
    },
    {
        "couponCode": "ALEONA15",
        "couponTitle": "Take 15% Off Your Purchase",
        "couponDescription": "Receive an extra 15% discount when you enter this promo code at checkout."
    },
    {
        "couponCode": "THEBLOOMINGNEST",
        "couponTitle": "Enjoy 15% Off Your Order",
        "couponDescription": "Tarte Cosmetics is offering 15% off on all orders when you use this coupon."
    },
    {
        "couponCode": "ALI15",
        "couponTitle": "Tarte Cosmetics Coupon: 15% Off Your Order",
        "couponDescription": "Take 15% off makeup by adding this Tarte Cosmetics code."
    },
    {
        "couponCode": "AMBER15",
        "couponTitle": "Get Up to 15% Off Sitewide with Promo Code",
        "couponDescription": "Use this coupon code at checkout and get up to a 15% discount on your order."
    },
    {
        "couponCode": "XOXOSANTANA15",
        "couponTitle": "15% Off Your Order",
        "couponDescription": "Shop and take 15% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "PERKS25",
        "couponTitle": "Only available with a coupon from Tarte Cosmetics: Makeup, Skincare & Beauty Products, free small Maneater mascara with purchase of 3+ products.",
        "couponDescription": null
    },
    {
        "couponCode": "extra20",
        "couponTitle": "Save 20% Off w/ Promo Code",
        "couponDescription": "Use this Tarte Cosmetic by getting extra 20% off your purchase."
    },
    {
        "couponCode": "TARYNNEWTON40",
        "couponTitle": "Tarte Cosmetics Discount Code: 40% Off Your Purchase",
        "couponDescription": "Get ready to save big on your favorite cosmetics with Tarte Cosmetics. Use this discount code today and receive an exclusive 40% off your purchase. Explore their wide range of high-quality makeup products and find the perfect addition to your collection. This offer won't last forever. Shop now and enjoy amazing savings on Tarte Cosmetics."
    },
    {
        "couponCode": "SAVE20",
        "couponTitle": "Save 20% Off w/ Coupon Code",
        "couponDescription": "Get 20% off orders with this promo code from Tarte Cosmetics on your cart at checkout."
    },
    {
        "couponCode": "LAURAGRAHAM15",
        "couponTitle": "Tarte Cosmetics Coupon: 15% Off Your Order",
        "couponDescription": "Take 15% off sitewide by adding this Tarte Cosmetics code."
    },
    {
        "couponCode": "SAMANTHAJO40",
        "couponTitle": "Tarte Cosmetics Coupon: 40% Off Your Order",
        "couponDescription": "Take 40% off your purchase plus free shipping at Tarte Cosmetics."
    },
    {
        "couponCode": "SARAHROSE",
        "couponTitle": "Tarte Cosmetics Coupon: Up to 10% Off Your Purchase",
        "couponDescription": "Shop and save up to 10% with this promo code for orders on your cart at Tarte Cosmetics."
    },
    {
        "couponCode": "Danielle40",
        "couponTitle": "Tarte Cosmetics Coupon: 40% Off",
        "couponDescription": "Shop and save 40% with this promo code for orders on your cart at Tarte Cosmetics."
    },
    {
        "couponCode": "OFFERS15",
        "couponTitle": "Tarte Cosmetics Promo Code: 15% Off Your Purchase",
        "couponDescription": "Get 15% off your entire order when you use this Tarte Cosmetics promo code at checkout. Stock up on your favorite makeup products and feel confident knowing you have a great deal. Don't wait, take advantage of this offer now."
    },
    {
        "couponCode": "BESTIES",
        "couponTitle": "Tarte Cosmetics Coupon: 35% Off",
        "couponDescription": "Get 35% off orders with this promo code on your cart at Tarte Cosmetics."
    }
]