[
    {
        "couponCode": "WELL20",
        "couponTitle": "Take 20% Off on Wellness Panels",
        "couponDescription": "Grab a 20% discount on wellness panels. Apply the Walk-In Lab promo code during checkout."
    },
    {
        "couponCode": "JINGLE",
        "couponTitle": "Walk-In Lab Promo Code: 20% Off Your Order",
        "couponDescription": "When this discount code is applied during checkout, you can get 20% off your select purchase."
    },
    {
        "couponCode": "2025",
        "couponTitle": "Save 15% Off w/ Promo Code",
        "couponDescription": "Take 15% off with coupon"
    },
    {
        "couponCode": "WOW20",
        "couponTitle": "Walk-In Lab Promo Code: 20% Off Entire Site",
        "couponDescription": "Apply this Walk-In Lab discount code at checkout to unlock 20% off your entire order."
    },
    {
        "couponCode": "LABORDAY",
        "couponTitle": "Take Extra 15% Off Your Purchase ",
        "couponDescription": "Enjoy shopping and get an extra 15% discount on your purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "LAUNCH24",
        "couponTitle": "Walk-In Lab Promo Code: Get 20% Off Your Order ",
        "couponDescription": "Redeem this promo code at checkout and save 20% on your order."
    },
    {
        "couponCode": "FAM",
        "couponTitle": "Take Extra 20% Off Sports and Fitness Panels ",
        "couponDescription": "Enjoy shopping and get an extra 20% discount on sports and fitness panels when you enter this coupon code at checkout."
    },
    {
        "couponCode": "DEAL16",
        "couponTitle": "Walk-In Lab Promo Code: 16% Off Your Order",
        "couponDescription": "Use this coupon code at checkout to receive an extra 16% off all lab tests."
    },
    {
        "couponCode": "text2save10",
        "couponTitle": "Save 10% at Walk-In Lab",
        "couponDescription": "Use this promo code at checkout to save 10% on your purchase."
    },
    {
        "couponCode": "OCT15",
        "couponTitle": "Walk-In Lab Discount Code: Save Up to 15% on Any Items         ",
        "couponDescription": "Shop at Walk-In Lab and enjoy up to a 15% discount on any items. Apply this discount code at checkout."
    },
    {
        "couponCode": "SEPT15",
        "couponTitle": "Walk-In Lab Coupon Code: Take 15% Off Any Purchase ",
        "couponDescription": "Enjoy a 15% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "DPF20",
        "couponTitle": "20% Off Your Order",
        "couponDescription": "Shop and get 20% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "DADS20",
        "couponTitle": "Walk-In Lab Coupon: Get 20% Off Your Purchase",
        "couponDescription": "Take a 20% discount on any order. Enter this promo code at checkout."
    },
    {
        "couponCode": "SALUTE",
        "couponTitle": "Get 15% Off All Items With Memorial Day Walk In Lab Code",
        "couponDescription": "Receive up to 15% off everything this memorial day by using this Walk In Lab code."
    },
    {
        "couponCode": "ANNIV15",
        "couponTitle": "Take Up to 15% Off Your Purchase ",
        "couponDescription": "Enjoy shopping and get up to a 15% discount on your purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "Support24",
        "couponTitle": "Walk-In Lab Coupon: 15% Off Your Purchase",
        "couponDescription": "Enjoy 15% off sitewide orders on your cart using Walk-In Lab's promo code at checkout."
    },
    {
        "couponCode": "FRIEND20",
        "couponTitle": "Receive 20% Off with Code",
        "couponDescription": "Enter this coupon code at checkout for an extra 20% discount on your purchase."
    },
    {
        "couponCode": "20OFFNOW",
        "couponTitle": "Save 20% Off",
        "couponDescription": "Save 20% off with coupon code"
    },
    {
        "couponCode": "HEALTHY10",
        "couponTitle": "Up to 10% Off at Walk-In Lab",
        "couponDescription": "Redeem this code at checkout to save up to 10% on lab tests from Walk-In Lab."
    },
    {
        "couponCode": "USA15",
        "couponTitle": "Walk-In Lab Coupon: 15% Off Your Purchase",
        "couponDescription": "Get 15% off everything with Walk-In Lab's promo code on your cart at checkout."
    }
]