[
    {
        "couponCode": "SEASON",
        "couponTitle": "Up to 30% Off Your Order Sitewide",
        "couponDescription": "With this special coupon, you can get up to 30% off your entire order at BannerBuzz UK. Shop a wide range of customizable products and save big today. Don't miss out on this limited-time offer to enhance your brand at a lower cost."
    },
    {
        "couponCode": "FG22",
        "couponTitle": "BannerBuzz UK Coupon Code: Take 22% Off Custom Flags",
        "couponDescription": "Enjoy a 22% discount on custom flags on custom flags when you enter this coupon code at checkout."
    },
    {
        "couponCode": "GA20",
        "couponTitle": "Get 20% Off Gazebo Tents",
        "couponDescription": "Paste this promo code at checkout and save $20 on gazebo tents."
    },
    {
        "couponCode": "MARK22",
        "couponTitle": "Get 22% Off Your Purchase",
        "couponDescription": "When this BannerBuzz UK voucher code is applied during checkout, you can get 22% off Marketing Materials."
    },
    {
        "couponCode": "SIGN25",
        "couponTitle": "Take 25% Off Your Ordedr",
        "couponDescription": "At checkout, use this BannerBuzz UK promo code to save 25%."
    },
    {
        "couponCode": "SHOW25",
        "couponTitle": "Up to 25% Off Your Order",
        "couponDescription": "Receive up to 25% off your purchase using a coupon code on your cart."
    },
    {
        "couponCode": "35BBUK",
        "couponTitle": "Get 35% Discount Using Promo Code",
        "couponDescription": "Take 35% off with code"
    },
    {
        "couponCode": "NEONUK",
        "couponTitle": "BannerBuzz UK Promo Code: Get 25% Off Neon Signs",
        "couponDescription": "Redeem this promo code at checkout and save 25% on neon signs."
    },
    {
        "couponCode": "NEWUSER",
        "couponTitle": "BannerBuzz UK Discount Code: Save 20% on Your First Purchase ",
        "couponDescription": "Shop at BannerBuzz UK and enjoy a 20% discount on your first purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "15CART",
        "couponTitle": "Save Up to 15% on Orders $75+ Sitewide with Discount Code",
        "couponDescription": "Take up to 15% off on your order over $75. Use this coupon code at checkout."
    },
    {
        "couponCode": "PROMO",
        "couponTitle": "BannerBuzz UK Promo Code: 25% Off Entire Site",
        "couponDescription": "Apply this BannerBuzz UK discount code at checkout to enjoy 25% off your entire order."
    },
    {
        "couponCode": "20BANNER",
        "couponTitle": "BannerBuzz UK Promo Code: Get 20% Off Your Order ",
        "couponDescription": "Redeem this promo code at checkout and save 20% on your order."
    },
    {
        "couponCode": "FIRSTORDER",
        "couponTitle": "Enjoy 20% Discount Using The Promo Code",
        "couponDescription": "Take 20% off with promo code"
    },
    {
        "couponCode": "BSOFF",
        "couponTitle": "BannerBuzz UK Promo Code: Get 22% Off Banner Stands ",
        "couponDescription": "Redeem this promo code at checkout and save 22% on banner stands."
    },
    {
        "couponCode": "PROMO25",
        "couponTitle": "Save 25% Off using Coupon Code",
        "couponDescription": "Receive 25% off on your purchase at bannerbuzz.co.uk."
    },
    {
        "couponCode": "BFCM",
        "couponTitle": "BannerBuzz UK Promo Code: Up to 30% Off Your Order",
        "couponDescription": "Shop and get up to 30% off sitewide orders using this discount code on your purchase at BannerBuzz UK."
    },
    {
        "couponCode": "OFFER",
        "couponTitle": "Up to 25% Off Your Purchase Sitewide",
        "couponDescription": "Get up to 25% off personalized displays and banners across BannerBuzz UK with this coupon code. Don't miss out on this chance to enhance your brand visibility and marketing efforts while staying within budget."
    },
    {
        "couponCode": "POWERUP",
        "couponTitle": "Save 20% Off",
        "couponDescription": "enjoy 20% off your £0-£199 purchases, 22% off your £200-£399 purchases, and 25% off your £400+ purchases using the promo code at checkout."
    },
    {
        "couponCode": "FG25",
        "couponTitle": "Enjoy 25% Off Your Order",
        "couponDescription": "Get 25% off personalized flags at BannerBuzz UK using this discount code. This is perfect for promoting your brand or event with custom designs. Don't miss out on this limited-time offer."
    },
    {
        "couponCode": "EARLY",
        "couponTitle": "BannerBuzz Coupon: 25% Off Your Order",
        "couponDescription": "This BannerBuzz promo code gets you 25% off your purchase. Enjoy savings on a wide range of customizable banners, signs, and promotional materials."
    }
]