[
    {
        "couponCode": "SHOPSLOW-15",
        "couponTitle": "The Ordinary Promo Code: Take 15% Off Your Order ",
        "couponDescription": "Enter this promo code at checkout and receive a 15% discount on your order."
    },
    {
        "couponCode": "FROMUS2U",
        "couponTitle": "10% Off Your Order at The Ordinary",
        "couponDescription": "Get 10% off your purchase of skincare, haircare, and more with this The Ordinary coupon code."
    },
    {
        "couponCode": "3RV7-OKXH-PQ5N-SPUS",
        "couponTitle": "Take 15% Off Your Purchase at The Ordinary",
        "couponDescription": "Shop for bodycare, skincare, haircare, and more and score 15% off with discount code."
    },
    {
        "couponCode": "SLOWNMF",
        "couponTitle": "Free Gift on Your Order ",
        "couponDescription": "Apply this promo code at checkout and automatically get a FREE gift on your order.  The free gift is a NMF + HA."
    },
    {
        "couponCode": "DAILYSET2",
        "couponTitle": "The Ordinary Coupon Code: 2% Off",
        "couponDescription": "Redeem this The Ordinary promo code at checkout on your next purchase and get 2% off."
    },
    {
        "couponCode": "SLOWFECC",
        "couponTitle": "Get Free 3ml FECC On Your Order",
        "couponDescription": "Enjoy free 3ml FECC on your purchase with this The Ordinary code."
    },
    {
        "couponCode": "SLOWVEMBER",
        "couponTitle": "The Ordinary Coupon Code: Take 25% Off",
        "couponDescription": "Use this The Ordinary promo code and get 25% off your purchase of skincare and more."
    },
    {
        "couponCode": "FALL25",
        "couponTitle": "The Ordinary Coupon: 25% Off Your Order",
        "couponDescription": "Save 25% on skincare by using this The Ordinary code."
    },
    {
        "couponCode": "CHOOSE40",
        "couponTitle": "Take 40% Off with The Ordinary Code",
        "couponDescription": "Shop for skincare, body and haircare, and more and score 40% off with this The Ordinary discount code."
    },
    {
        "couponCode": "CHOOSE23",
        "couponTitle": "The Ordinary Promo Code: 23% Off",
        "couponDescription": "Score 23% off your order of haircare, skincare, and more with The Ordinary discount code.  Must be signed into your The Ordinary account to apply code successfully."
    },
    {
        "couponCode": "JU6G4RF546",
        "couponTitle": "Take Up to 30% Off at The Ordinary",
        "couponDescription": "Use this promo code at The Ordinary on your next order of skincare and get up to 30% off."
    },
    {
        "couponCode": "BOGO50OFF",
        "couponTitle": "Buy 1, Get 1 50% Off Your Order",
        "couponDescription": "Buy one, get one 50% off your purchase with this The Ordinary code."
    },
    {
        "couponCode": "SLOWLIP",
        "couponTitle": "The Ordinary Coupon Code: Enjoy Free Gift with Your Order",
        "couponDescription": "Use this The Ordinary coupon code at checkout to get a free key chain attachment with your orders of Squalane + Amino Acids Lip Balm."
    },
    {
        "couponCode": "SLOWL",
        "couponTitle": "Use this offer to receive a complimentary Multi-Peptide Lash and Brow Serum with any eligible purchase.",
        "couponDescription": null
    }
]