[
    {
        "couponCode": "SAVE10",
        "couponTitle": "Get 10% Off Your Purchase",
        "couponDescription": "Save extra 10% on select monitors with this Dell code."
    },
    {
        "couponCode": "MONITOR10",
        "couponTitle": "Dell Canada Discount Code: Save 10% on Dell and Alienware Monitors",
        "couponDescription": "Shop at Dell Canada and enjoy a 10% discount on Dell and Alienware monitors. Apply this discount code at checkout."
    },
    {
        "couponCode": "BIZSAVE10",
        "couponTitle": "Take 10% Off Your Purchase",
        "couponDescription": "Apply this Dell Canada discount code during checkout to enjoy 10% off your order."
    },
    {
        "couponCode": "AW920KB25",
        "couponTitle": "Take 25% Off Alienware Tri Mode Wireless Gaming Keyboard",
        "couponDescription": "Enjoy shopping and get a 25% discount on Alienware tri mode wireless gaming keyboard when you enter this coupon code at checkout."
    },
    {
        "couponCode": "AW920KW25",
        "couponTitle": "Dell Technologies Canada Coupon: Save 25% on Your Order",
        "couponDescription": "Enjoy a 25% discount on the Alienware Tri-Mode Wireless Gaming Keyboard (AW920K) in Lunar Light at Dell Technologies Canada. Just apply this coupon during checkout. Benefit from savings on this versatile gaming accessory."
    },
    {
        "couponCode": "U2723QE25",
        "couponTitle": "Dell Technologies Canada Coupon Code: Take 25% Off Dell Ultrasharp 27 4K USB-C Hub Monitor",
        "couponDescription": "Enjoy a 25% discount on Dell ultrasharp 27 4K USB-C hub monitor when you enter this coupon code at checkout."
    },
    {
        "couponCode": "SAVE25",
        "couponTitle": "Get 25% Off Dell 27 Monitor S2721DS with Promo Code",
        "couponDescription": "Purchase Dell 27 monitor S2721DS and get a 25% discount on your order. Apply this coupon code at checkout."
    },
    {
        "couponCode": "7630GLRF",
        "couponTitle": "Dell Coupon: $350 Off Your Order",
        "couponDescription": "Take $350 off G16 gaming laptop by adding this Dell code."
    },
    {
        "couponCode": "D3100DOCK25",
        "couponTitle": "Dell Technologies' Coupon: Get 25% Off Your Order",
        "couponDescription": "Enjoy 25% off docking station USB 3.0 - D3100 with this Dell Technologies code."
    },
    {
        "couponCode": "EXTRA10",
        "couponTitle": "Take Extra 10% Off Any Monitors ",
        "couponDescription": "Enjoy shopping and get an extra 10% discount on any monitors when you enter this coupon code at checkout."
    },
    {
        "couponCode": "SAVE15",
        "couponTitle": "Dell Canada Coupon Code:Take 15% Off Any PCs ",
        "couponDescription": "Enjoy a 15% discount on any PCs when you enter this coupon code at checkout."
    },
    {
        "couponCode": "XPS10%OFF",
        "couponTitle": "Dell Coupon: 10% Off Your Order",
        "couponDescription": "Take 10% off your purchase with this Dell code."
    },
    {
        "couponCode": "GNSG$300",
        "couponTitle": "Get $300 Off Your Order",
        "couponDescription": "Take $300 off inspiron 14 plus laptop  by adding this Dell code."
    },
    {
        "couponCode": "M18R202$200",
        "couponTitle": "Get $200 Off Your Order",
        "couponDescription": "Enjoy $200 off alienware m18 R2 gaming laptop at Dell."
    },
    {
        "couponCode": "R16I19$500",
        "couponTitle": "Get $550 Off Your Order",
        "couponDescription": "Take $550 off alienware aurora R16 gaming desktop at Dell."
    },
    {
        "couponCode": "S2721QS25",
        "couponTitle": "Receive 25% Off Your Purchase",
        "couponDescription": "Enjoy a 25% discount on the Dell 27\" 4k Monitor (S2721QS) with this coupon code at Dell Technologies Canada. Benefit from this limited-time offer and upgrade your display experience."
    },
    {
        "couponCode": "G2724D25",
        "couponTitle": "Save 25% on Dell 27 Gaming Monitor G2724D, Fast IPS, QHD",
        "couponDescription": "Shop at Dell Technologies Canada and get a 25% discount on Dell 27 gaming monitor G2724D, fast IPS, QHD. Apply this discount code at checkout."
    },
    {
        "couponCode": "AW2725DF25",
        "couponTitle": "Take 25% Off Your Purchase",
        "couponDescription": "Benefit from a 25% discount on the Alienware 27 360Hz QD-OLED Gaming Monitor (AW2725DF) at Dell Technologies Canada. Simply apply this promo code during checkout. Experience immersive gaming with this high-performance monitor."
    },
    {
        "couponCode": "SE2722H25",
        "couponTitle": "Dell Technologies Canada Coupon: 25% Off Your Order",
        "couponDescription": "Enjoy a 25% discount on the Dell 27 FHD Monitor (SE2722H) with a coupon at Dell Technologies Canada. Upgrade your display experience at a fraction of the cost. Shop and save now."
    },
    {
        "couponCode": "PREC15",
        "couponTitle": "Dell Technologies Canada Coupon: 15% Off Your Order",
        "couponDescription": "Save an extra 15% on select Precision and Optiplex when you enter this promo code at checkout."
    }
]