[
    {
        "couponCode": "TF49",
        "couponTitle": "Get Free Ground Shipping on Orders $49+ ",
        "couponDescription": "Shop now at MSC Direct and get free ground shipping on all orders over $49. Enter this discount code at checkout."
    },
    {
        "couponCode": "BF49",
        "couponTitle": "Get Free Ground Shipping On Orders Of $49",
        "couponDescription": "Enjoy free ground shipping when you spend over $49 this black friday sale at MSC Direct."
    },
    {
        "couponCode": "MW50",
        "couponTitle": "Get Up to 50% Off Metalworking Exclusive Brands",
        "couponDescription": "Paste this promo code at checkout and save up to 50% on metalworking exclusive brands."
    },
    {
        "couponCode": "WYP20",
        "couponTitle": "20% Off Your Order with Discount Code",
        "couponDescription": "Save 20% on the WypAll products when this MSC Direct promotional code is applied at checkout."
    },
    {
        "couponCode": "SAVENOW",
        "couponTitle": "MSC Direct Coupon: 40% Off Your Order",
        "couponDescription": "Get 40% off when you add this MSC Direct code."
    },
    {
        "couponCode": "OCT149H",
        "couponTitle": "MSC Direct Coupon: Save on Purchases of $149+",
        "couponDescription": "Get ready to save big with MSC Direct. We're offering an unbeatable promo code that slashes up to 10% off your current purchase. Whether you're stocking up on power tools, securing safety equipment, or investing in new machinery, these quality products just got even more affordable."
    },
    {
        "couponCode": "MSC99",
        "couponTitle": "MSC Direct Promo Code: Get Free Shipping on Orders $99+",
        "couponDescription": "Redeem this promo code at checkout and get free shipping on orders over $99."
    },
    {
        "couponCode": "SHP",
        "couponTitle": "MSC Direct Coupon: Free Shipping on Your Purchase",
        "couponDescription": "Receive free ground shipping on your $99+ orders with MSC Direct's promo code. Redeem at checkout."
    },
    {
        "couponCode": "NF99",
        "couponTitle": "MSC Direct Coupon: Free Shipping on Your Order",
        "couponDescription": "Take free ground shipping on your $99+ purchase using MSC Direct's promo code at checkout."
    },
    {
        "couponCode": "BUY3M",
        "couponTitle": "MSC Direct Coupon: 30% Off Your Order",
        "couponDescription": "Get ready to enjoy fantastic savings with their 30% off promo code at MSC Direct. This is not just a bargain, it's an absolute steal. Whether you're looking to replenish your supplies or invest in new industrial equipment, this deal unlocks unbeatable value."
    },
    {
        "couponCode": "GET149H",
        "couponTitle": "Get $15 Discount On Your Purchase",
        "couponDescription": "Enjoy Up to $15 Off on Your Order"
    },
    {
        "couponCode": "T149H",
        "couponTitle": "Up To 25% Off On Orders $149 Or More",
        "couponDescription": "Grab $149 or more order Up to 25% off"
    },
    {
        "couponCode": "JUL149H",
        "couponTitle": "Save on Orders of $149+",
        "couponDescription": "Get ready to save like never before. MSC Direct is offering an exciting deal on orders of $149 or more when you apply the promo code. Gear up for some serious savings on top-quality industrial supplies and equipment. Grab this incredible deal while it lasts and experience unparalleled value from MSC Direct. Hurry, don't miss out on this spectacular offer."
    },
    {
        "couponCode": "JUL99H",
        "couponTitle": "Save on Orders of $99+",
        "couponDescription": "Get ready to revamp your shopping experience with MSC Direct. We're offering an exciting off promo code for orders over $99. From top-notch power tools to high-quality industrial supplies, everything you need is just a click away. Don't wait, seize this fantastic opportunity and enjoy the best deals on all your favorite items today."
    },
    {
        "couponCode": "DEAL",
        "couponTitle": "Take 20% Off Your Order",
        "couponDescription": "Enjoy 20% off purchase by adding this MSC Direct code."
    },
    {
        "couponCode": "MW99",
        "couponTitle": "Get Free Ground Shipping Purchase Over $99",
        "couponDescription": "Enjoy free ground shipping on purchase above $99 at MSC Direct."
    },
    {
        "couponCode": "classcff",
        "couponTitle": "Save With Free Shipping",
        "couponDescription": "Enter this MSC Direct promo code to get free shipping on any purchase."
    },
    {
        "couponCode": "FFAFF",
        "couponTitle": "MSC Direct Coupon: Get Free Ground Shipping ",
        "couponDescription": "Enjoy free shipping when your order totals $99 or more. Simply use this MSC Direct coupon code to enjoy the savings."
    },
    {
        "couponCode": "ABR99",
        "couponTitle": "MSC Direct Coupon: Up to 40% Off Your Order + Free Delivery",
        "couponDescription": "When this discount code is applied during checkout, you can get up to 40% off Abrasives plus free shipping on orders over $99."
    },
    {
        "couponCode": "WELCOME",
        "couponTitle": "Enjoy 5% Discount Using Promo Code",
        "couponDescription": "Get up to 5% off with code"
    }
]