[
    {
        "couponCode": "2DONTMISSOUT30",
        "couponTitle": "Constant Contact Coupon: 30% Off Your Order",
        "couponDescription": "Take up to 30% off your purchase by adding this Constant Contact code."
    },
    {
        "couponCode": "AVANTI",
        "couponTitle": "Constant Contact Discount Code: 10% Off Any Order Sitewide",
        "couponDescription": "Use a promo code to get 10% off your Constant Contact registration."
    },
    {
        "couponCode": "SAVE5",
        "couponTitle": "Constant Contact Coupon: 5% Off All Orders",
        "couponDescription": "Use this Constant Contact coupon to receive an additional 5% off your registration for the 2024 Manilla Madness Bike Ride."
    },
    {
        "couponCode": "NYCSPONSOR",
        "couponTitle": "Get Up to 50% Off Sitewide with Promo Code",
        "couponDescription": "Get up to a 50% discount on your order. Enter this coupon code at checkout."
    },
    {
        "couponCode": "EARLYBIRD",
        "couponTitle": "Constant Contact Discount Code: $20 Off Your Order",
        "couponDescription": "Get an extra $20 off your purchase when you use this promo code at checkout."
    },
    {
        "couponCode": "POLB2023",
        "couponTitle": "$40 Savings at Constant Contact",
        "couponDescription": "Receive a $40 discount on your purchase when you apply this Constant Contact coupon code at checkout."
    },
    {
        "couponCode": "EARLYBIRD30",
        "couponTitle": "30% Off at Constant Contact",
        "couponDescription": "Use this coupon to save 30% on your next plan at Constant Contact."
    },
    {
        "couponCode": "COMPPRESENT",
        "couponTitle": "Save 30% Off for 2 Months",
        "couponDescription": "Use this Constant Contact coupon code when you're subscribing to get 30% off your first 2 months of service."
    },
    {
        "couponCode": "SAVE2024",
        "couponTitle": "Constant Contact Promo Code: 15% Off",
        "couponDescription": "Order using Constant Contact's and receive 15% off your purchase at checkout."
    },
    {
        "couponCode": "GARDENS",
        "couponTitle": "50% Off with Coupon Code",
        "couponDescription": "Sign up for digital marketing and lead generation with Constant Contact and score 50% off with this coupon code."
    },
    {
        "couponCode": "BEATLES",
        "couponTitle": "Take 50% Off Your Order",
        "couponDescription": "Take advantage of this discount code that will save you 50% on everything at Constant Contact."
    },
    {
        "couponCode": "NEXTLEVEL",
        "couponTitle": "Get Free Gift on Registration at Next Level Leadership",
        "couponDescription": "Apply this discount code at checkout and get free gift when you register at next level leadership."
    },
    {
        "couponCode": "GETAGRIP",
        "couponTitle": "Save 15% on Your Order",
        "couponDescription": "Save 15% on your order at Constant Contact with this coupon code. Reduce your marketing costs and boost your business with email marketing solutions. Don't miss this limited-time discount on Constant Contact services."
    },
    {
        "couponCode": "RESOL2024",
        "couponTitle": "Get Extra $100 Off Your Order",
        "couponDescription": "Take an extra $100 discount on your order when you enter this promo code at checkout."
    },
    {
        "couponCode": "SMBWEEK24",
        "couponTitle": "Take 30% Off Email and Digital Marketing Plans",
        "couponDescription": "Enjoy shopping and get a 30% discount on all email and digital marketing plans when you enter this coupon code at checkout."
    },
    {
        "couponCode": "14DAYTRIAL1M100",
        "couponTitle": "Constant Contact Coupon Code: Get 1 Month Free on All Plans ",
        "couponDescription": "Enter this coupon code at checkout and get one month free on all plans."
    },
    {
        "couponCode": "EARLY",
        "couponTitle": "15% Off Your Subscription with Code",
        "couponDescription": "Enter this Constant Contact discount code at checkout to take 15% off digital marketing and lead generation."
    },
    {
        "couponCode": "FIRST100",
        "couponTitle": "Get $50 Off Your Subscription",
        "couponDescription": "Subscribe to Constant Contact using this promo code and get $50 off your subscription. Save money on lead generation and email marketing."
    },
    {
        "couponCode": "2023BOARD",
        "couponTitle": "$30 Off Any Purchase",
        "couponDescription": "Save $30 on any purchase at Constant Contact with this promo code. Boost your marketing efforts and reach more customers."
    },
    {
        "couponCode": "SPRING23",
        "couponTitle": "Get 50% Off with Code",
        "couponDescription": "Visit ConstantContact.com today and save 50% on your purchase when you use this coupon code at checkout."
    }
]