[
    {
        "couponCode": "TODAY",
        "couponTitle": "Save up to 45% on 7+ nights with promo code",
        "couponDescription": "Book your hotel stay with this Extended Stay America promo code to save up to 45% on 7+ nights stay."
    },
    {
        "couponCode": "EADTX",
        "couponTitle": "Get 10% Off Your Purchase",
        "couponDescription": "Enjoy a 10% discount at Extended Stay America exclusively for California residents. Use this promo code at checkout. Book now and save."
    },
    {
        "couponCode": "FALL4",
        "couponTitle": "Extended Stay America Coupon: Get Up to 56% Off",
        "couponDescription": "Save big this fall with Extended Stay America's Flash Sale. Book now and enjoy up to 56% off your stay. Take advantage of this limited-time offer and plan your next trip today."
    },
    {
        "couponCode": "DASH4",
        "couponTitle": "Get 52% Off Purchase",
        "couponDescription": "Take 52% off when you add this Extended Stay America code."
    },
    {
        "couponCode": "EXLWL",
        "couponTitle": "Take 50% Off Your Purchase",
        "couponDescription": "Get up to 50% off when you add this Extended Stay America code."
    },
    {
        "couponCode": "EXJTH",
        "couponTitle": "Take 50% Off Your Order",
        "couponDescription": "Big savings at Extended Stay America by getting extra 50% on select products."
    },
    {
        "couponCode": "EXHBK",
        "couponTitle": "Extended Stay America Coupon: 50% Off Your Order",
        "couponDescription": "Save up to 50% on hotels stays with this Extended Stay America code."
    },
    {
        "couponCode": "LEAF",
        "couponTitle": "Up to 50% Off Your Order",
        "couponDescription": "Shop and take up to 50% off your purchase on select stays using a promo code at Extended Stay America."
    },
    {
        "couponCode": "EXIDN",
        "couponTitle": "Extended Stay America Promo Code: Up to 50% Off Your Order",
        "couponDescription": "Buy and save up to 50% with this discount code for eligible items on your purchase at Extended Stay America."
    },
    {
        "couponCode": "EXJEB",
        "couponTitle": "Extended Stay America Coupon Code: Take Up to 50% Off Participating Hotel Stays",
        "couponDescription": "Enjoy up to a 50% discount on participating hotel stays when you enter this coupon code at checkout."
    },
    {
        "couponCode": "PRM24",
        "couponTitle": "Extended Stay America Coupon: Up to 59% Off Your Stay",
        "couponDescription": "Score up to a whopping 59% off on your booking with Extended Stay America. This amazing discount applies to both long-term stays and group bookings, making it the perfect opportunity to plan your extended getaway or organize that reunion you've been dreaming of."
    },
    {
        "couponCode": "SUN24",
        "couponTitle": "Extended Stay America Coupon: 55% Off Your Stay",
        "couponDescription": "Enjoy a fantastic 55% off sitewide at extendedstayamerica.com with the Extended Stay America discount code. Whether you're booking a short getaway or an extended vacation, use this deal to enjoy significant savings on your booking."
    },
    {
        "couponCode": "LUCK4",
        "couponTitle": "Receive 60% Discount on All Orders",
        "couponDescription": "Enter a coupon to take advantage of Extended Stay America's Lucky Stay Flash Sale and save up to 60% on reservations."
    },
    {
        "couponCode": "EEATW",
        "couponTitle": "Extended Stay America Coupon: 50% Off Your Order",
        "couponDescription": "Save up to 50% on downtown Miami Fl by adding this Extended Stay America code."
    },
    {
        "couponCode": "FTMYR",
        "couponTitle": "Extended Stay America Coupon Code: Take Up to 49% Off Any Purchase ",
        "couponDescription": "Enjoy up to a 49% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "STN24",
        "couponTitle": "Extended Stay America Coupon: Extra 51% Off Your Purchase",
        "couponDescription": "Get an additional 51% off when you stay 7+ nights with Extended Stay America's promo code at checkout."
    },
    {
        "couponCode": "PSTES",
        "couponTitle": "Save 54% Off w/ Coupon Code",
        "couponDescription": "Score 54% off with promo code"
    },
    {
        "couponCode": "NEW24",
        "couponTitle": "Extended Stay America Coupon: Up to 58% Off Your Booking",
        "couponDescription": "Score an unbelievable 58% off on your current booking at Extended Stay America, making your long-term accommodation more affordable. The discount code applies to both room rates and additional amenities like in-room kitchens and pet-friendly options."
    },
    {
        "couponCode": "KLE3P",
        "couponTitle": "Get 50% Off Your Order",
        "couponDescription": "Save 50% on your next purchase with this Extended Stay America code."
    },
    {
        "couponCode": "CYB24",
        "couponTitle": "Extended Stay America Coupon: Get Up to 60% Off",
        "couponDescription": "Save up to 60% on your stay at Extended Stay America with this exclusive coupon. Enjoy great discounts on long-term accommodations. Book now and experience comfort at a lower price."
    }
]