[
    {
        "couponCode": "ADBGM",
        "couponTitle": "Take 5% Off Your Order",
        "couponDescription": "Enjoy extra 5% off women's dresses by adding this Babyboo Fashion code."
    },
    {
        "couponCode": "ADBG4",
        "couponTitle": "Babyboo Fashion Coupon Code: Take 5% Off Your Purchase ",
        "couponDescription": "Enjoy a 5% discount on your purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "ADRU3",
        "couponTitle": "Take 3% Off Your Purchase",
        "couponDescription": "Save at Babyboo Fashion by getting 3% on women's dresses."
    },
    {
        "couponCode": "ADRS4",
        "couponTitle": "Get 5% Off Your Order",
        "couponDescription": "Enjoy extra 5% off sitewide by adding this Babyboo Fashion code."
    },
    {
        "couponCode": "ADRU4",
        "couponTitle": "Babyboo Fashion Coupon: 5% Off Your Order",
        "couponDescription": "Enjoy an extra 5% off sitewide by adding this Babyboo Fashion code."
    },
    {
        "couponCode": "ADRU8",
        "couponTitle": "Babyboo Fashion Coupon Code: Take Extra 5% Off Your Purchase ",
        "couponDescription": "Enjoy an extra 5% discount on your purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "adeso",
        "couponTitle": "Babyboo Fashion Promo Code: Up to 10% Off Your Order",
        "couponDescription": "Apply this coupon code during checkout to qualify for up to a 10% discount on your eligible purchase."
    },
    {
        "couponCode": "ADCN0",
        "couponTitle": "Save 15% Off Your Purchase",
        "couponDescription": "Enter this Babyboo Fashion discount code during checkout to score 15% off your qualifying order."
    },
    {
        "couponCode": "adbg6",
        "couponTitle": "Receive 10% Off Your Purchase Sitewide",
        "couponDescription": "Get 10% off your entire order at Babyboo Fashion with this promo code. Shop trendy styles for less and save on your favorite outfits. Don't miss out on this limited-time offer."
    },
    {
        "couponCode": "FREYAP10",
        "couponTitle": "Take 10% Off Your Order",
        "couponDescription": "Use this Babyboo Fashion discount code to save 10% on dresses."
    },
    {
        "couponCode": "EMILY10",
        "couponTitle": "Save 10% Off",
        "couponDescription": "Score 10% off with coupon code"
    },
    {
        "couponCode": "ADNCK",
        "couponTitle": "Save $5 on Your Purchase ",
        "couponDescription": "Shop at Babyboo Fashion and get a $5 discount on your purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "SHEOTT10",
        "couponTitle": "Babyboo Fashion Promo Code: Get Up to 10% Off Any Order ",
        "couponDescription": "Redeem this promo code at checkout and save up to 10% on any order."
    },
    {
        "couponCode": "GET10BOO",
        "couponTitle": "Take Up to 10% Off Any Purchase ",
        "couponDescription": "Enjoy shopping and get up to a 10% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "ADCA2",
        "couponTitle": "Babyboo Fashion Promo Code: 10% Off Your Order",
        "couponDescription": "Receive 10% off your storewide purchase with this discount code at Babyboo Fashion."
    },
    {
        "couponCode": "ADBT2",
        "couponTitle": "Take 7% Off Your Purchase ",
        "couponDescription": "Enjoy shopping and get a 7% discount on your purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "VIPAFC9D",
        "couponTitle": "Get 5% Discount Using Promo Code",
        "couponDescription": "Save up to 5% off with promo code"
    },
    {
        "couponCode": "ADCVB",
        "couponTitle": "Babyboo Fashion Coupon: 5% Off Your Purchase",
        "couponDescription": "Apply this promotional code at checkout to get 5% off your select order."
    },
    {
        "couponCode": "AFTER20",
        "couponTitle": "Babyboo Fashion Promo Code: 20% Off",
        "couponDescription": "Shop and get 20% off using this discount code on your purchase at Babyboo Fashion's Afterdark Sale."
    },
    {
        "couponCode": "ADBH9",
        "couponTitle": "Babyboo Fashion Coupon Code: Up to 10% Off Your Order",
        "couponDescription": "Shop and take up to 10% off your purchase sitewide using a discount code on your cart."
    }
]