[
    {
        "couponCode": "CHEERS",
        "couponTitle": "Annie Selke Promo Code: 20% Off Your Order",
        "couponDescription": "Apply this coupon code during checkout to qualify for a 20% discount on your eligible purchase."
    },
    {
        "couponCode": "HOLLY",
        "couponTitle": "Get 40% Off Your Order with Coupon",
        "couponDescription": "Take a 40% discount on all holiday decor when you apply this Annie Selke promo code during checkout."
    },
    {
        "couponCode": "CYBER",
        "couponTitle": "Annie Selke Cyber Sale: Up to 70% off ",
        "couponDescription": "Up To 70% off, plus extra 25% off select items"
    },
    {
        "couponCode": "SAVINGS",
        "couponTitle": "Black Friday: Up to 70% off ",
        "couponDescription": "Up to 70% Off + 20% Off + Free Shipping"
    },
    {
        "couponCode": "EXTRA20",
        "couponTitle": "Extra 20% Off Your Purchase",
        "couponDescription": "Benefit from an additional 20% discount on sale items at Annie Selke using this coupon code. Don't miss out on this promo on marked-down merchandise."
    },
    {
        "couponCode": "GUEST20",
        "couponTitle": "Annie Selke Coupon Code: Get 20% Off Select Styles",
        "couponDescription": "Annie Selke is having a Guest Ready Sale. You can save 20% on select styles when you use this discount code at checkout."
    },
    {
        "couponCode": "LIST25",
        "couponTitle": "25% Discount on Any Purchase",
        "couponDescription": "Use this coupon at checkout to save 25% on clearance products."
    },
    {
        "couponCode": "STOCKUP",
        "couponTitle": "Annie Selke Promo Code: Up to 25% Off Your Order",
        "couponDescription": "Buy and save up to 25% with this discount code on your sitewide purchase at Annie Selke."
    },
    {
        "couponCode": "VIPSOCIAL",
        "couponTitle": "Get 25% Off Your Order",
        "couponDescription": "Paste this promo code at checkout and save 25% on your order."
    },
    {
        "couponCode": "BIGDEAL25",
        "couponTitle": "25% Off Holiday/Cyber Sale",
        "couponDescription": "Apply this Annie Selke coupon code to save 25% off sitewide."
    },
    {
        "couponCode": "GIFTSALE",
        "couponTitle": "30% Off Your Purchase",
        "couponDescription": "Enter this Annie Selke coupon code at checkout to get 30% off the holiday décor and gifts."
    },
    {
        "couponCode": "VIPACCESS",
        "couponTitle": "Annie Selke Discount Code: Up to 25% Off",
        "couponDescription": "Apply up to 25% off at checkout when you purchase Store-Wide using this discount code on your cart."
    },
    {
        "couponCode": "ANNIE15",
        "couponTitle": "Annie Selke Coupon Code: 15% Off All Orders",
        "couponDescription": "Apply this coupon code from Annie Selke to receive a 15% discount on your order."
    },
    {
        "couponCode": "WAKEUP",
        "couponTitle": "Annie Selke Promo Code: Buy 1 Get 1 50% Off Bedding Item ",
        "couponDescription": "Purchase one bedding item and get another with a 50% discount. Redeem this promo code at checkout."
    },
    {
        "couponCode": "SUNNY",
        "couponTitle": "Save Up to 30% OFF + FREE SHIPPING",
        "couponDescription": "Up to 30% off + 20% Sitewide + Free Shipping with code"
    },
    {
        "couponCode": "30YEARS",
        "couponTitle": "Annie Selke Coupon Code: Take Extra 30% Off Your Purchase ",
        "couponDescription": "Enjoy an extra 30% discount on your purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "ANNIESALE20",
        "couponTitle": "Annie Selke Coupon: 20% Off Your Order",
        "couponDescription": "Apply this Annie Selke discount code during checkout to enjoy 20% off your purchase."
    },
    {
        "couponCode": "OUTDOOR",
        "couponTitle": "Annie Selke Discount Code: 20% Off Your Order",
        "couponDescription": "Purchase at Annie Selke and get 20% off all outdoor rugs using this coupon code on your cart."
    }
]