[
    {
        "couponCode": "BOXING35",
        "couponTitle": "Save 35% Off",
        "couponDescription": "Use this Garden Buildings Direct coupon code at checkout to apply 35% off your orders of all wooden garden buildings."
    },
    {
        "couponCode": "SEPT15",
        "couponTitle": "get 15% off wooden buildings At Garden Buildings Direct",
        "couponDescription": "Enter this Garden Buildings Direct coupon code at checkout to save an extra 15% off your orders of wooden buildings."
    },
    {
        "couponCode": "BIRTHDAY20",
        "couponTitle": "Get 20% Off On £200+ Purchases",
        "couponDescription": "20% off £200+ spend"
    },
    {
        "couponCode": "BONFIRE20",
        "couponTitle": "Save 20% Off",
        "couponDescription": "Visit Garden Buildings Direct and get an additional 20% off orders with this coupon code on your cart."
    },
    {
        "couponCode": "SEASON15",
        "couponTitle": "Save 15% Off",
        "couponDescription": "Order using Garden Buildings Direct's coupon code and receive an additional 15% off your purchase at checkout."
    },
    {
        "couponCode": "DEC20",
        "couponTitle": "Garden Buildings Direct Coupon Code: Up To 20% Off Wooden Buildings",
        "couponDescription": "Add this Garden Buildings Direct discount code at checkout to apply up to 20% off your orders of wooden buildings."
    },
    {
        "couponCode": "BLACK",
        "couponTitle": "Score 20% Off",
        "couponDescription": "Shop for log cabins, garden offices, and more with this Garden Buildings Direct discount code to enjoy 20% off."
    },
    {
        "couponCode": "GARDEN15",
        "couponTitle": "Receive 15% Off Your Purchase",
        "couponDescription": "Score 15% off wooden buildings when you enter this Garden Buildings Direct promotional code at checkout."
    },
    {
        "couponCode": "BOXING10",
        "couponTitle": "Up to 10% Off Your Order",
        "couponDescription": "Apply this Garden Buildings Direct promo code at checkout and get up to 10% off your purchase."
    },
    {
        "couponCode": "AUMTUMN10",
        "couponTitle": "Use Promo Code For 10% Off At Garden Buildings Direct",
        "couponDescription": "Add this Garden Buildings Direct promo code at checkout to save 10% off your orders."
    },
    {
        "couponCode": "SAVE10",
        "couponTitle": "Get 10% Off Sitewide",
        "couponDescription": "Score up to 10% off sitewide purchase at Garden Buildings Direct."
    },
    {
        "couponCode": "GARDEN10",
        "couponTitle": "Save 36% Off w/ Discount Code",
        "couponDescription": "use this promo code to save up to 36% off plus 10% off on wooden buildings"
    },
    {
        "couponCode": "BF20",
        "couponTitle": "Take 20% Off Sitewide",
        "couponDescription": "Receive 20% off sitewide when you apply this Garden Buildings Direct discount code on sheds, log cabins, and more."
    },
    {
        "couponCode": "CROWN10",
        "couponTitle": "Get 10% Discount On Garden Buildings Direct Orders",
        "couponDescription": "Take extra 10% off your Garden Buildings Direct order with this code."
    },
    {
        "couponCode": "15OFF1000",
        "couponTitle": "Save 15% Off",
        "couponDescription": "get 15% off wooden buildings over £1,000 with coupon code enter code at checkout."
    },
    {
        "couponCode": "DEC10",
        "couponTitle": "Garden Buildings Direct Promo Code: Extra 10% Off Your Order",
        "couponDescription": "Apply an additional 10% off Sitewide Orders when you purchase using this discount code on your cart."
    },
    {
        "couponCode": "Bf25",
        "couponTitle": "Save 25% Off Using Code",
        "couponDescription": "Take 25% off your purchase using Garden Buildings Direct's promo code at checkout."
    },
    {
        "couponCode": "FLASH10",
        "couponTitle": "Save 10% Off using Coupon Code",
        "couponDescription": "Apply an extra 10% off wooden buildings over £1000+ using this coupon code on your purchase at Garden Buildings Direct."
    },
    {
        "couponCode": "BEATTHERUSH15",
        "couponTitle": "Save 15% Off",
        "couponDescription": "Buy and save an additional 15% with this discount code on your purchase at Garden Buildings Direct."
    },
    {
        "couponCode": "BF15",
        "couponTitle": "Save 15% Off",
        "couponDescription": "Enjoy 15% off your order by applying this Garden Buildings Direct promo code at checkout."
    }
]