[
    {
        "couponCode": "BRCARDPERK",
        "couponTitle": "Cardmember Exclusive: Extra 25% Off Purchase",
        "couponDescription": "Apply coupon code to save an extra 25% off purchase for Banana Republic cardmembers."
    },
    {
        "couponCode": "BRHOLIDAY",
        "couponTitle": "Enjoy 20% Off Your Purchase Sitewide",
        "couponDescription": "Upgrade your wardrobe today with Banana Republic's stunning collection at a discounted price. Enjoy a 20% discount on your entire purchase with this coupon code. Apply it during checkout to enjoy the savings. Shop now to elevate your style game without breaking the bank."
    },
    {
        "couponCode": "NEWCARD",
        "couponTitle": "Banana Republic Coupon Code: 20% Off Your Order",
        "couponDescription": "Apply this Banana Republic coupon code to get 20% off when you complete your order with a Banana Republic Credit Card."
    },
    {
        "couponCode": "FLASH",
        "couponTitle": "Take 40% off your orders",
        "couponDescription": "Take 40% off your orders when you apply this Banana Republic promo code at checkout."
    },
    {
        "couponCode": "BRFAMILY",
        "couponTitle": "Save 40% Off",
        "couponDescription": "Save 40% off regular-priced items"
    },
    {
        "couponCode": "WELCOMEBR",
        "couponTitle": "Banana Republic Coupon Code: Save 20% On First Orders",
        "couponDescription": "Explore a wide range of accessories and stylish clothing. Get a 20% discount on your first purchase with your Banana Republic Rewards credit card."
    },
    {
        "couponCode": "TREAT",
        "couponTitle": "Banana Republic Promo Code: 40% Off Your Order",
        "couponDescription": "Take 40% off your orders when you apply this Banana Republic promo code at checkout."
    },
    {
        "couponCode": "BRSHIP",
        "couponTitle": "Save 40% Off Sitewide using Coupon Code",
        "couponDescription": "40% off Everything + Free 3-5 Day shipping on $150+ Orders"
    },
    {
        "couponCode": "YOURS",
        "couponTitle": "Save 40% Off",
        "couponDescription": "Redeem this Banana Republic coupon code at checkout and get a 40% discount on your order."
    },
    {
        "couponCode": "BRCARD20",
        "couponTitle": "Save 20% Off with Code",
        "couponDescription": "Score an extra 20% off when you use Gap Inc. credit card at Bananarepublic.gap."
    },
    {
        "couponCode": "BRCARDVIP",
        "couponTitle": "Banana Republic Promo Code: Save 20% On Your Order",
        "couponDescription": "Explore the latest fashion trends and enjoy unbeatable discounts on stylish clothing and accessories. Take an extra 20% off with this Banana Republic promo code."
    },
    {
        "couponCode": "BRINSIDER",
        "couponTitle": "Banana Republic Coupon: 30% Off",
        "couponDescription": "Enjoy 30% off full-priced orders on your cart using Banana Republic's promo code at checkout."
    },
    {
        "couponCode": "NAVYIST",
        "couponTitle": "Banana Republic Coupon Code: Free Shipping on Your Order",
        "couponDescription": "Enjoy free shipping on all orders with this promo code."
    },
    {
        "couponCode": "BRSELECT30",
        "couponTitle": "Banana Republic Coupon- 30% Off Storewide",
        "couponDescription": "Get a 30% discount on all your orders by using this coupon code during checkout."
    },
    {
        "couponCode": "BREXTRA",
        "couponTitle": "Save 20% Off with Code",
        "couponDescription": "Enjoy an extra 20% off sale styles when this Banana Republic coupon code is applied."
    },
    {
        "couponCode": "BRAFF",
        "couponTitle": "Banana Republic Discount Code: Save Extra 30% on Any Styles Items",
        "couponDescription": "Shop at Banana Republic and enjoy extra 30% discount on any styles items. Apply this discount code ay checkout."
    },
    {
        "couponCode": "D914DB84WTDN",
        "couponTitle": "Banana Republic Promo Code: 15% Off Your Purchase",
        "couponDescription": "Enjoy up to an extra 15% off your order with this Banana Republic discount code."
    },
    {
        "couponCode": "BGCWFTDR7XK8",
        "couponTitle": "Banana Republic Coupon: 15% Off Your Order",
        "couponDescription": "Take 15% off your first purchase with this Banana Republic code."
    },
    {
        "couponCode": "DG2D312WHG46",
        "couponTitle": "Banana Republic Code: 15% Off Your First Purchase",
        "couponDescription": "Add this Banana Republic promo code at checkout to save an additional 15% off first your orders."
    },
    {
        "couponCode": "BREXTRA30",
        "couponTitle": "Banana Republic Coupon Code: 30% Off Your Order",
        "couponDescription": "Apply this coupon to receive a 30% discount on your full-priced purchase."
    }
]