[
    {
        "couponCode": "CHEERS20",
        "couponTitle": "Small Woods Coupon: 20% Off Your Order",
        "couponDescription": "Take 20% off your purchase with this Small Woods code."
    },
    {
        "couponCode": "HELLO25",
        "couponTitle": "Extra 25% Off Everything At Smallwoods",
        "couponDescription": "Apply this Smallwoods promo code at checkout to claim an extra 25% off all your orders."
    },
    {
        "couponCode": "FAMILY25",
        "couponTitle": "Get 25% Off Your Order",
        "couponDescription": "Save 25% on your entire purchase at Small Woods."
    },
    {
        "couponCode": "JOLLY30",
        "couponTitle": "Extra 30% Off Your Purchase",
        "couponDescription": "Score an additional 30% off your select order by entering this Smallwoods discount code at checkout."
    },
    {
        "couponCode": "SANTA30",
        "couponTitle": "EXTRA 30% OFF WEEKEND SALE At Smallwoods",
        "couponDescription": "Shop with this Smallwoods discount code to receive an extra 30% off your orders."
    },
    {
        "couponCode": "gift",
        "couponTitle": "Take Up to 10% Off Your Order ",
        "couponDescription": "Shop now at Smallwoods and receive up to a 10% discount on your order. Redeem this discount code at checkout."
    },
    {
        "couponCode": "THANKFUL35",
        "couponTitle": "Get 35% Off Your Order",
        "couponDescription": "Take up to 35% off your purchase on black friday sale at Smallwoods."
    },
    {
        "couponCode": "TAKE30",
        "couponTitle": "Smallwoods Promo Code: Get 30% Off Your Order",
        "couponDescription": "Save big with Smallwoods. Use this promo code to get 30% off your order. Shop now and enjoy great discounts on our top-quality products. Don't miss this chance to save on your favorite items."
    },
    {
        "couponCode": "Merry35",
        "couponTitle": "Save 35% Off Your Order w/ Promo Code",
        "couponDescription": "Get an instant 35% off your qualifying purchase at checkout when this Smallwoods coupon code is applied."
    },
    {
        "couponCode": "SUNDAY",
        "couponTitle": "Take Up to 10% Off Any Purchase ",
        "couponDescription": "Enjoy shopping and get up to a 10% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "XLFRAMES",
        "couponTitle": "Smallwoods Discount Code: 30% Off Your Order",
        "couponDescription": "Save 30% using this coupon code for eligible items on your purchase at Smallwoods."
    },
    {
        "couponCode": "TREATS",
        "couponTitle": "Smallwoods Promo Code: 50% Off Your Order",
        "couponDescription": "Shop and get 50% off your purchase of eligible items using a coupon code on your cart."
    },
    {
        "couponCode": "CUSTOM25",
        "couponTitle": "25% Off Your Purchase",
        "couponDescription": "Receive an extra 25% off custom frames when this Smallwoods coupon code is used."
    },
    {
        "couponCode": "SATURDAY",
        "couponTitle": "Smallwoods Coupon Code: Extra 30% Off Everything",
        "couponDescription": "Use this Smallwoods coupon code at checkout to take extra 30% off your entire order."
    },
    {
        "couponCode": "30FORYOU",
        "couponTitle": "Take Up to 30% Off Your Order",
        "couponDescription": "Save up to 30% on your entire order at Smallwoods by using this promo code at checkout. This offer lets you enjoy significant discounts on a wide range of unique home decor items. Dont miss the chance to elevate your space while keeping your budget in check."
    },
    {
        "couponCode": "FRAMESFORYOU",
        "couponTitle": "Smallwoods Discount Code: Save 25% on Ll Custom Frames",
        "couponDescription": "Shop at Smallwoods and enjoy a 25% discount on LI custom frames. Apply this discount code at checkout."
    },
    {
        "couponCode": "SUNDAYSPECIAL",
        "couponTitle": "Take 30% Off Your Order",
        "couponDescription": "Get extra 30% off sitewide when you use this Small Woods code."
    },
    {
        "couponCode": "NEWFRAME",
        "couponTitle": "Small Woods Coupon: 35% Off Your Order",
        "couponDescription": "Take up to 35% off your purchase with this Small Woods code."
    },
    {
        "couponCode": "FLASHSALE",
        "couponTitle": "Smallwoods Discount Code: Up To 10% Off Your Order",
        "couponDescription": "Add this Smallwoods discount code at checkout to take up to 10% off your orders."
    },
    {
        "couponCode": "WEDNESDAY",
        "couponTitle": "Extra 30% Off Your Order",
        "couponDescription": "When this Smallwoods coupon code is applied, you can receive an additional 30% off your select purchase."
    }
]