[
    {
        "couponCode": "FRAME24",
        "couponTitle": "Get Free Vera Wang Frame On Your Order",
        "couponDescription": "Receive free vera wang frame with purchase of $300 and more."
    },
    {
        "couponCode": "WINE",
        "couponTitle": "Wedgwood Coupon: Get a Free Gift When You Purchase $350+",
        "couponDescription": "Snag a fabulous free gift when you splurge on your favorite Wedgwood items worth $350 or more. Don't miss out on this amazing deal to add some extra sparkle to your Wedgwood collection. Grab this coupon code to start saving."
    },
    {
        "couponCode": "VWWINE",
        "couponTitle": "Wedgwood Coupon: Get a Free Gift When You Spend $350+",
        "couponDescription": "Experience the elegance of Wedgwood with their fantastic offer. Use this coupon code to get a free gift when you spend $350 or more. Whether you're looking for a stunning piece of fine china, timeless jewelry, or luxurious home decor, this deal is perfect for adding a touch of sophistication to your life."
    },
    {
        "couponCode": "GLOBE",
        "couponTitle": "Gift With Purchases $450+ At Wedgwood",
        "couponDescription": "Add this Wedgwood promo code at checkout to obtain a free gift: Love Snow Globe with your orders of $450 or more."
    },
    {
        "couponCode": "HARLEQUIN",
        "couponTitle": "Wedgwood Coupon: Enjoy a Free Harlequin Ornament with Your Order Over £150",
        "couponDescription": "Spend £150 or more at Wedgwood.com and receive a delightful Harlequin Ornament absolutely free. Just apply this promo code at checkout to get this deal."
    },
    {
        "couponCode": "TEA20",
        "couponTitle": "Wedgwood Discount Code: 20% Off Your Order",
        "couponDescription": "Use this promotional code at checkout to score 20% off your qualifying purchase."
    },
    {
        "couponCode": "NATIVITY",
        "couponTitle": "Wedgwood Promo Code: Free Item on Your Order",
        "couponDescription": "When this discount code is applied during checkout, you can get a free nativity ornament on $250 or more total purchases."
    },
    {
        "couponCode": "WELCOMEWW20",
        "couponTitle": "Wedgwood Coupon: 20% Off on Your 1st Purchase with Newsletter Sign-Up",
        "couponDescription": "Join the Wedgwood family today by signing up for the newsletter and you'll get an immediate 20% off on your first purchase using the coupon code. At Wedgwood, there's no better time to save money than today."
    },
    {
        "couponCode": "WELCOMEWW",
        "couponTitle": "Free Shipping Sitewide",
        "couponDescription": "Sign up for the Wedgwood newsletter and get free shipping on your first order. Save money at Wedgwood and use this promo code at checkout."
    },
    {
        "couponCode": "WWWELCOME10",
        "couponTitle": "10% Off Your First Order",
        "couponDescription": "Enjoy an elegant discount of 10% off your first order at Wedgwood, your source for luxury tableware and home decor. With this offer, you can save on everything from stunning fine bone china dinner sets to beautifully crafted Jasperware vases and intricate crystal stemware."
    },
    {
        "couponCode": "TEACUP",
        "couponTitle": "Use the coupon to receive a free gift from Wedgwood on orders over €230.",
        "couponDescription": null
    },
    {
        "couponCode": "PIERROT",
        "couponTitle": "Wedgwood Coupon: Get a Free Pierrot Ornament with Your Order Over £150",
        "couponDescription": "Enjoy a free Pierrot Ornament when you spend over £150 and use the discount code at checkout on wedgwood.com."
    },
    {
        "couponCode": "WW300AFF",
        "couponTitle": "Enjoy 15% Savings On Your Purchase",
        "couponDescription": "Get 15% Discount on Your Order"
    },
    {
        "couponCode": "AFFVERA20",
        "couponTitle": "Wedgwood Coupon Code: Take 20% Off Vera Wang Items",
        "couponDescription": "Enjoy a 20% discount on Vera Wang items when you enter this coupon code at checkout."
    },
    {
        "couponCode": "KING",
        "couponTitle": "Wedgwood Coupon: Enjoy a Free Mouse King Ornament on Orders Over £150",
        "couponDescription": "Receive a complimentary Mouse King Ornament with every order over £150 at Wedgwood.com. Use this promo code at checkout to snag this charming gift."
    },
    {
        "couponCode": "FLUTE24",
        "couponTitle": "Wedgwood Coupon: Free Gift When You Order $250+",
        "couponDescription": "Dive into the luxurious world of Wedgwood with their exciting offer. Use their promo code to enjoy a free gift on orders of $250 or more. Whether you're looking for exquisite dinnerware or elegant home décor, now's the time to spruce up your space with Wedgwood's timeless elegance."
    },
    {
        "couponCode": "WWXMAS",
        "couponTitle": "30% Off Your Purchase",
        "couponDescription": "Receive 30% off Royal Albert products when this Wedgwood coupon code is used."
    },
    {
        "couponCode": "SAVE20",
        "couponTitle": "£20 Off Sitewide",
        "couponDescription": "Check out Wedgwood.com if you are looking for a little something special.  You can find luxurious pottery, dinnerware, and home decor. Use this discount code at checkout to save £20 off your purchase sitewide. Whether you're shopping for yourself or for a gift, Wedgwood has something for everyone."
    },
    {
        "couponCode": "BABYBOOT",
        "couponTitle": "Wedgwood Coupon: Free Product on Your Purchase",
        "couponDescription": "Simply apply this promo code during checkout to get a free gift on $250 or more total orders."
    },
    {
        "couponCode": "AEROPLANE",
        "couponTitle": "Get Free Origami Aeroplane Ornament Purchase Of $250+",
        "couponDescription": "Enjoy free origami aeroplane ornament when you spend $250 and more at Wedgwood."
    }
]