[
    {
        "couponCode": "NEXT10",
        "couponTitle": "MyHeritage Coupon Code: Get 10% Off Your Order",
        "couponDescription": "Receive 10% off on a DNA kit on top of any current discounts at MyHeritage when this promo code is applied."
    },
    {
        "couponCode": "NEXT5",
        "couponTitle": "Get 7% Off Your Purchase with MyHeritage Promo Code",
        "couponDescription": "Enjoy 7% off on a DNA kit  on top any current discount from MyHeritage when this promo code is applied at checkout."
    },
    {
        "couponCode": "NEXTFREE",
        "couponTitle": "Free DNA Shipping at MyHeritage",
        "couponDescription": "Use this MyHeritage coupon code to score free shipping on your DNA kit."
    },
    {
        "couponCode": "USEFULCHARTS",
        "couponTitle": "15% Off Ancestry Charts",
        "couponDescription": "Discover your unique family history at Myheritage.com, and receive up to a 15% discount on your purchase using the promo code."
    },
    {
        "couponCode": "LADY2",
        "couponTitle": "MyHeritage Offer: 50% Off + Free Shipping",
        "couponDescription": "Apply 50% off your purchase using the discount code from \nMyHeritage in your shopping cart at checkout."
    },
    {
        "couponCode": "SAVESEVEN",
        "couponTitle": "MyHeritage Discount Code: Extra 7% Off Your Purchase",
        "couponDescription": "Receive an additional 7% off sitewide orders on your shopping cart when you apply MyHeritage's coupon code at checkout."
    },
    {
        "couponCode": "DUOSDNA",
        "couponTitle": "Get 10% Off Your Purchase",
        "couponDescription": "Enjoy 10% savings on your eligible order by simply using this MyHeritage discount code at checkout."
    },
    {
        "couponCode": "WATCHER",
        "couponTitle": "MyHeritage Discount Code: Get Up to 10% Off",
        "couponDescription": "Save up to 10% on MyHeritage with this discount code. Use this offer to access premium genealogy and DNA testing services at a lower cost. Start tracing your family history today with MyHeritage's advanced tools and features."
    },
    {
        "couponCode": "HOOK",
        "couponTitle": "MyHeritage Discount Code: Save Up tp 10% Off Any Ordre ",
        "couponDescription": "Sat ah MyHeritage and get up to a 30% discount on any purchaes. Apply this discount code at checkout."
    },
    {
        "couponCode": "BALD",
        "couponTitle": "Get Up To 10% Off Any Order",
        "couponDescription": "Use this My Heritage discount code to save up to 10% on your purchase."
    }
]