[
    {
        "couponCode": "GIFT22",
        "couponTitle": "Canada Pet Care Coupon: 22% Off Your Order + Extra $10 Off Orders Over $149 + Free Shipping",
        "couponDescription": "Enjoy 22% off everything on the site, plus an additional $10 off when you spend over $149. And that's not allshipping is on us. Just use this promo code and stock up on all your favorite pet care essentials at Canadapetcare.com."
    },
    {
        "couponCode": "ret15",
        "couponTitle": "Canada Pet Care Coupon: 15% Off Your Order",
        "couponDescription": "Enjoy 15% off flea, tick and heart wormer treatment at Canada Pet Care."
    },
    {
        "couponCode": "TREAT",
        "couponTitle": "20% Off Your Order",
        "couponDescription": "Take 20% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "CPCDEAL24",
        "couponTitle": "Save Up to 35% on Healthy Pet Products Items",
        "couponDescription": "Shop at Canada Pet Care and get up to a 35% discount on Healthy Pet Products items. Apply this discount code at checkout."
    },
    {
        "couponCode": "SALUTE20",
        "couponTitle": "Take Free Shipping with Code",
        "couponDescription": "Apply this coupon code to receive free shipping on your order."
    },
    {
        "couponCode": "BLKFSALE",
        "couponTitle": "Canada Pet Care Coupon: Extra 20% Off Your Order",
        "couponDescription": "Experience unbeatable Black Friday deals with Canada Pet Care, where prices are at their lowest ever and we're offering an additional 20% off on all orders. Today is the perfect day to save money on pet care essentials as we celebrate Black Friday with phenomenal discounts for your furry friends."
    },
    {
        "couponCode": "LOVEDAY18",
        "couponTitle": "CanadaPetCare Discount Code: Enjoy 18% Off Your Purchase",
        "couponDescription": "Save on pet care with this exclusive CanadaPetCare discount code. Enjoy an 18% discount on your purchase. Shop now for quality pet supplies at a reduced price. Grab your savings today."
    },
    {
        "couponCode": "BFJULY20",
        "couponTitle": "Take 20% Discount with Code",
        "couponDescription": "Canada Pet Care is offering 20% off with this promo code when you check out."
    },
    {
        "couponCode": "LBSAVE15",
        "couponTitle": "Canada Pet Care Coupon: Enjoy 15% Off + Free Shipping",
        "couponDescription": "Get ready to save big this Labor Day with the fantastic sale. Use the online coupon code at canadapetcare.com and grab a whopping 15% off on all items. Plus, enjoy the added perk of free shipping."
    },
    {
        "couponCode": "SMRSAVE",
        "couponTitle": "Grab 10% Off Everything In Canadapetcare's Summer Sale",
        "couponDescription": "Score up to 10% off sitewide summer sale at CanadaPetCare."
    },
    {
        "couponCode": "cpchd15",
        "couponTitle": "Canada Pet Care Coupon Code: 15% Off Your Order",
        "couponDescription": "Apply this promo code at checkout to receive an extra 15% off your purchase."
    },
    {
        "couponCode": "ENDSALE",
        "couponTitle": "Take 12% Off Sitewide with Promo Code",
        "couponDescription": "Enter this coupon code at checkout and get a 12% discount on your order."
    },
    {
        "couponCode": "WELCM20",
        "couponTitle": "20% Off for New Customers",
        "couponDescription": "Make your first purchase at Canada Pet Care and take 20% off with this code."
    },
    {
        "couponCode": "JINGLE20",
        "couponTitle": "Take 20% Off Your Order",
        "couponDescription": "Use this Canada Pet Care by getting up to 20% on any purchase."
    },
    {
        "couponCode": "RETURN15",
        "couponTitle": "Canada Pet Care Promo Code: 15% Off",
        "couponDescription": "Buy and save 15% with this discount code on your purchase at Canada Pet Care."
    },
    {
        "couponCode": "NCHM12",
        "couponTitle": "Free Shipping",
        "couponDescription": "Enjoy Free Shipping with Promo Code"
    },
    {
        "couponCode": "CPCMSALE",
        "couponTitle": "Canada Pet Care Promo Code: 25% Off",
        "couponDescription": "Shop using Canada Pet Care's discount code and get 25% off Pick Bravecto + Heartgard Plus on your purchase at checkout."
    },
    {
        "couponCode": "SPCPC12",
        "couponTitle": "Save 12% Off + Free Shipping w/ Coupon Code",
        "couponDescription": "Get 12% Off + Free Shipping with Promo Code"
    },
    {
        "couponCode": "CATMONTH",
        "couponTitle": "Canada Pet Care Coupon: Enjoy 25% Off Frontline Plus + Free Brush",
        "couponDescription": "Get an amazing 25% discount on Frontline Plus, a top-notch product for your pet's health and wellness at canadapetcare.com. Plus, receive a complimentary brush with your purchase."
    },
    {
        "couponCode": "SMRSAVE20",
        "couponTitle": "Canada Pet Care's Discount Code: 20% Off Your Purchase",
        "couponDescription": "Enter this discount code at checkout and enjoy a 20% off on any purchase."
    }
]