[
    {
        "couponCode": "HOLIDAY",
        "couponTitle": "Olaplex Promo Code: Get a free Nº.3 ornament",
        "couponDescription": "Apply this Olaplex promo code at checkout to claim a free N.3 ornament with any order."
    },
    {
        "couponCode": "gday15",
        "couponTitle": "Extra 15% Off Your Order",
        "couponDescription": "Apply this promo code at checkout to get an extra 15% off your first purchase at Olaplex."
    },
    {
        "couponCode": "EYELOVE",
        "couponTitle": "Olaplex Coupon: 50% Off Your Order",
        "couponDescription": "Take 50% off the Lashbond on your purchase of the Browbond using Olaplex's promo code at checkout."
    },
    {
        "couponCode": "VIPCYBER",
        "couponTitle": "Olaplex Discount Code: 30% Off Your Order",
        "couponDescription": "Shop and receive 30% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "IPSYOLA20",
        "couponTitle": "Save 25% Off",
        "couponDescription": "Get 25% off with coupon"
    },
    {
        "couponCode": "WELCOMEOLA",
        "couponTitle": "Receive 30% Discount on All Purchase",
        "couponDescription": "Apply this coupon code from Olaplex to receive a 30% discount on your order."
    },
    {
        "couponCode": "EYES",
        "couponTitle": "Olaplex Coupon Code: Buy 1 Get 1 Free Lashbond Building Serum, Browbond Building Serum",
        "couponDescription": "Purchase one lashbond building serum, browbond building serum and get another free. Enter this coupon code at checkout."
    },
    {
        "couponCode": "BDAY9",
        "couponTitle": "Full-Sized No 9 Serum with $35 Order",
        "couponDescription": "Get ready to treat your tresses with some extra love. We've got a fantastic offer for all the fabulous hair enthusiasts out there. Head over to olaplex.com and grab the promo code, which gives you a free full-sized No 9 Serum with any $35 order. It's time to indulge in the fabulous range of salon-quality treatments that'll leave your locks looking luscious and full of life. Don't miss this amazing opportunity."
    },
    {
        "couponCode": "MYSTERY2",
        "couponTitle": "Olaplex Discount Code: Free Gift on Your Purchase",
        "couponDescription": "Visit Olaplex and get a free gift for storewide orders over $100+ with this coupon code on your cart at checkout."
    },
    {
        "couponCode": "TREATMOM",
        "couponTitle": "Get Bond Intense Moisture Mask Orders Of $60",
        "couponDescription": "Enjoy Bond Intense Moisture Mask when you spend $60 at Olaplex."
    },
    {
        "couponCode": "USBB5OFFNX9M",
        "couponTitle": "Olaplex Coupon: 5% Off Your Order",
        "couponDescription": "Take 5% off when you use this Olaplex discount code."
    },
    {
        "couponCode": "BRIGHTEN",
        "couponTitle": "Olaplex Discount Code: Get Free Gift on N°5p Blonde Enhancer Toning Conditioner",
        "couponDescription": "Shop at Olaplex and get free gift on N5p blonde enhancer toning conditioner. Apply this discount code at checkout."
    },
    {
        "couponCode": "HAIRSTYLE",
        "couponTitle": "Get Volumizing Blow Dry Mist on Nº.9 Bond Protector Nourishing Hair Serum ",
        "couponDescription": "Enjoy shopping and get volumizing blow dry mist on N.9 bond protector nourishing hair serum when you enter this coupon code at checkout."
    },
    {
        "couponCode": "SAVE30DAY5",
        "couponTitle": "30% Off Your Purchase with Coupon",
        "couponDescription": "Don't forget to apply this Olaplex promotional code to receive 30% off when you spend $100 or more at checkout."
    },
    {
        "couponCode": "GIFT2",
        "couponTitle": "Olaplex Discount Code: Free Gift on Your Order",
        "couponDescription": "Shop at Olaplex and get a free gift for orders over $80+ using this coupon code on your cart."
    },
    {
        "couponCode": "HOLA15",
        "couponTitle": "Save 15% Off",
        "couponDescription": "Score 15% off with discount code"
    },
    {
        "couponCode": "WELCOME8",
        "couponTitle": "Olaplex Coupon: Take $30 Off Your Order",
        "couponDescription": "Shop using this promo code on your purchase at olaplex.com and get $30 off at checkout."
    },
    {
        "couponCode": "OLWB7KCES",
        "couponTitle": "Olaplex Promo Code: Up to 15% Off Your Order",
        "couponDescription": "Use this coupon code during checkout to enjoy up to 15% off your total order. This is for a limited time only, so shop at Olaplex now."
    },
    {
        "couponCode": "VIPCYBERUK",
        "couponTitle": "30% Off Your Order",
        "couponDescription": "Shop and take 30% off your purchase using a coupon code on your cart."
    },
    {
        "couponCode": "DAY10PICK",
        "couponTitle": "Get Free Gift on Any Item ",
        "couponDescription": "Paste this promo code at checkout and get free gift on any item."
    }
]