[
    {
        "couponCode": "YUME",
        "couponTitle": "Save 10% Off",
        "couponDescription": "Get 10% off with coupon code"
    },
    {
        "couponCode": "magical",
        "couponTitle": "Save 10% Off w/ Promo Code",
        "couponDescription": "Take an Extra 10% Off on Select Items"
    },
    {
        "couponCode": "XCANA",
        "couponTitle": "Save 10% at Entertainment Earth",
        "couponDescription": "Shop at Entertainment Earth and receive 10% off your entire purchase at checkout with a coupon code."
    },
    {
        "couponCode": "SAILORTORT",
        "couponTitle": "Receive 10% Off Using Promo Code",
        "couponDescription": "Enter this Entertainment Earth coupon at checkout for an extra 10% discount on your entire order."
    },
    {
        "couponCode": "PRETERNIA",
        "couponTitle": "Get 10% Off Select Items with Promo Code",
        "couponDescription": "Enjoy a 10% discount on select items. Enter this coupon code at checkout."
    },
    {
        "couponCode": "DISTRACK",
        "couponTitle": "Take Up to 10% Off Sitewide with Promo Code",
        "couponDescription": "Apply this coupon code at checkout and get up to a 10% discount on your order."
    },
    {
        "couponCode": "VARIANT",
        "couponTitle": "Up to 20% Off Your Order",
        "couponDescription": "Receive up to 20% off your shopping cart when you apply our discount code."
    },
    {
        "couponCode": "JACKBOT",
        "couponTitle": "Additional 10% Off with Code",
        "couponDescription": "Enter this coupon code at checkout to get an extra 10% discount on your order."
    },
    {
        "couponCode": "SKITTLE10",
        "couponTitle": "Get Up to 5% Off Sitewide with Promo code",
        "couponDescription": "Apply this promo code at checkout and get up to 5% discount on all orders."
    },
    {
        "couponCode": "TOYBRO",
        "couponTitle": "Up to 20% Off Your Order",
        "couponDescription": "Receive up to 20% off your shopping cart when you apply our discount code."
    },
    {
        "couponCode": "FNC10",
        "couponTitle": " Entertainment Earth's Discount Code: Score Up to 20% Off Any Purchase",
        "couponDescription": "Apply this discount code at checkout and enjoy up to a 20% off on any purchase."
    },
    {
        "couponCode": "FINDERZ",
        "couponTitle": "Save 20% Off w/ Coupon Code",
        "couponDescription": "Get up to 20% off with discount code"
    },
    {
        "couponCode": "OHMYSOPHII",
        "couponTitle": "Entertainment Earth Coupon: Take 10% Off Any Purchase",
        "couponDescription": "Add this Entertainment Earth promo code to receive 10% off the entire site."
    },
    {
        "couponCode": "INPURSUIT",
        "couponTitle": "Entertainment Earth Discount Code: Save Up to 20% on Your Purchase ",
        "couponDescription": "Shop at Entertainment Earth and enjoy up to a 20% discount on your purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "THESPOT",
        "couponTitle": "Entertainment Earth Coupon Code: Take 10% Off Any Purchase ",
        "couponDescription": "Enjoy a 10% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "JAY10",
        "couponTitle": "Receive 10% Off Select Items",
        "couponDescription": "Get 10% off in-stock anime figures at Entertainment Earth. Use this coupon code at checkout to save big. Shop now and grab your favorite collectibles while supplies last."
    },
    {
        "couponCode": "GIVEME10",
        "couponTitle": "Entertainment Earth Discount Code: Save 10% on Any Purchase ",
        "couponDescription": "Shop at Entertainment Earth and enjoy a 10% discount on any purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "KYLE",
        "couponTitle": "Entertainment Earth Coupon Code: Take Up to 50% Off Your Purchase",
        "couponDescription": "Enjoy shopping and get up to 50% discount on your purchase. Enter this coupon code at checkout."
    },
    {
        "couponCode": "SHELLANIN",
        "couponTitle": "Famous Footwear Discount Code: Save 10% on Any Order",
        "couponDescription": "Apply this discount code at checkout and enjoy 10% discount on any order."
    },
    {
        "couponCode": "THM",
        "couponTitle": "Entertainment Earth Promo Code: Up to 30% Off",
        "couponDescription": "Order today and take up to 30% off with Entertainment Earth's coupon code on your purchase."
    }
]