[
    {
        "couponCode": "FIRSTAPP",
        "couponTitle": "Save 15% on Your First In-App Order with Code",
        "couponDescription": "Use this Zenni Optical promo code on your first in-app purchase to receive 15% off."
    },
    {
        "couponCode": "GLADIUS",
        "couponTitle": "Zenni Optical Coupon: 10% Off Your Order",
        "couponDescription": "Save at Zenni Optical by getting 10% on your purchase."
    },
    {
        "couponCode": "SERENA15",
        "couponTitle": "ZenniOptical Discount Code: Receive 15% Off Your Order Sitewide",
        "couponDescription": "Save 15% on your order at ZenniOptical with this discount code. Enjoy affordable eyewear with a variety of styles for every need. Shop now and take advantage of this limited-time offer."
    },
    {
        "couponCode": "PAX10",
        "couponTitle": "Zenni Promo Code: 10% Off Your Order",
        "couponDescription": "Apply this coupon code during checkout to qualify for a 10% discount on your eligible purchase."
    },
    {
        "couponCode": "HEARTLIT",
        "couponTitle": "ZenniOptical Promo Code: 10% Off",
        "couponDescription": "Shop using ZenniOptical's discount code and get 10% off your purchase at checkout."
    },
    {
        "couponCode": "GUILESGARDEN",
        "couponTitle": "Save 10% with Zenni Optical Coupon Code",
        "couponDescription": "Enjoy 10% off sitewide by adding this Zenni Optical discount code at checkout."
    },
    {
        "couponCode": "KATYBENTZ",
        "couponTitle": "Zenni Promo Code: Get 10% Off Any Order ",
        "couponDescription": "Redeem this promo code at checkout and save 10% on any order."
    },
    {
        "couponCode": "TACTICALGRAMMA10",
        "couponTitle": "Zenni Optical Coupon: 10% Off Your Order",
        "couponDescription": "Take 10% off glasses and contacts at Zenni Optical."
    },
    {
        "couponCode": "evo10",
        "couponTitle": "ZenniOptical Coupon: 10% Off Evo’s Favorite Glasses",
        "couponDescription": "Explore a selection of frames chosen by Evo staff and players. Then customize your lenses to suit your gaming and everyday vision needs. Use this Zenni Optical discount code to save 10% sitewide."
    },
    {
        "couponCode": "BF24",
        "couponTitle": "Zenni Black Friday Sale: Get Up to 30% Off Your Order",
        "couponDescription": "Receive up to 30% off your purchases when you spend over $60 and use this coupon code at checkout. Transitions lenses included."
    },
    {
        "couponCode": "CLOUD9",
        "couponTitle": "9% Off Your Order",
        "couponDescription": "Shop and take 9% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "TACTICALGRAMMA",
        "couponTitle": "Zenni Optical Coupon: 20% Off Your Order",
        "couponDescription": "Use this Zenni coupon code to get 10% off on your next order of frames from Tactical Gramma's selection. \\"
    },
    {
        "couponCode": "GALINTGAMING",
        "couponTitle": "10% Off Your Order Sitewide",
        "couponDescription": "Get 10% off your entire order at ZenniOptical with this coupon code. Shop a wide range of eyewear and accessories. Don't miss out on this limited-time offer."
    },
    {
        "couponCode": "CM24",
        "couponTitle": "Zenni Cyber Monday Code: Get Up to 30% Off",
        "couponDescription": "The more you spend, the more you save with 30% off orders over $140, 20% off orders over $80, and free standard shipping on all orders at Zenni Optical."
    },
    {
        "couponCode": "BOXING21",
        "couponTitle": "Save 10%  with Zenni Discount Code",
        "couponDescription": "Use this promo code at ZenniOptical to get 10% off your entire order when you check out."
    },
    {
        "couponCode": "PRODAD3FBGCD",
        "couponTitle": "Zenni Coupon Code: Take Extra 10% Off Your Purchase ",
        "couponDescription": "Enjoy an extra 10% discount on your purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "NEW15OFF",
        "couponTitle": "Zenni Optical Promo Code: Get 15% Off Your Order",
        "couponDescription": "Enjoy free shipping and save 15% on your purchase of $100 or more at Zenni Optical. Just use this promo code at checkout. This offer is valid for new customers only."
    },
    {
        "couponCode": "GHOST10",
        "couponTitle": "Zenni Promo Code: 10% Off Your Order",
        "couponDescription": "This coupon code is valid for 10% off glasses selected by Ghost Gaming at Zenni Optical. You can customize your lenses to suit your gaming needs."
    },
    {
        "couponCode": "HEALTHYEYES",
        "couponTitle": "Zenni Coupon Code: $25 Off Your Order",
        "couponDescription": "Buy contacts at Zenni Optical and get $25 off eyewear, plus 20% off and free shipping on your first order."
    },
    {
        "couponCode": "samebrain",
        "couponTitle": "ZenniOptical Coupon: 10% Off Your Order",
        "couponDescription": "Get 10% off at Zennioptical.com with this coupon code. Enjoy shopping for your favorite eyewear at reduced prices."
    }
]