[
    {
        "couponCode": "APPLEPAY",
        "couponTitle": "Ralph Lauren Coupon: 40% Off Your Order",
        "couponDescription": "Save big at Ralph Lauren by getting up to 40% on select items."
    },
    {
        "couponCode": "WELCOME15",
        "couponTitle": "Ralph Lauren Promo Code: 15% Off",
        "couponDescription": "Shop using Ralph Lauren's discount code and get 15% off your purchase at checkout."
    },
    {
        "couponCode": "BZSHV6RFVTDQKLKZ",
        "couponTitle": "Ralph Lauren Promo Code: 5% Off Your Order",
        "couponDescription": "Shop and take 5% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "EXTRA40",
        "couponTitle": "Get 40% Off Your Purchase",
        "couponDescription": "Slash 40% off on select styles at Ralph Lauren. Simply add this promo code when you checkout to redeem discount."
    },
    {
        "couponCode": "BOOM50",
        "couponTitle": "Ralph Lauren Discount Code: Extra 50% Off Your Order",
        "couponDescription": "Receive an additional 50% off on select products at Ralph Lauren. Activate the code at the checkout step."
    },
    {
        "couponCode": "LAUREN15",
        "couponTitle": "Ralph Lauren Coupon Code: Up to 15% Off Your Order",
        "couponDescription": "Enjoy 15% off your order with this Ralph Lauren promo code."
    },
    {
        "couponCode": "5KT2GTDRC7DX7N43",
        "couponTitle": "Ralph Lauren Discount Code: Save Extra 30% on Cotton Herringbone Field Jacket ",
        "couponDescription": "Shop at Ralph Lauren and enjoy an extra 30% discount on cotton herringbone file jacket. Apply this discount code at checkout."
    },
    {
        "couponCode": "EL15",
        "couponTitle": "Ralph Lauren Promo Code: 15% Off Your Purchase",
        "couponDescription": "Shop and receive 15% off your order using a discount code at checkout."
    },
    {
        "couponCode": "POLOU",
        "couponTitle": "Ralph Lauren Promo Code: Up to $15 Off for Students ",
        "couponDescription": "Students can enjoy up to $15 off, add code upon checkout."
    },
    {
        "couponCode": "ESCUELA2010",
        "couponTitle": "Ralph Lauren Promo Code: $10 Off Any Purchase",
        "couponDescription": "Score $10 off your purchase by adding this Ralph Lauren code at the checkout stage."
    },
    {
        "couponCode": "FALL50",
        "couponTitle": "Ralph Lauren Discount Code: Up to 50% Off Your Order",
        "couponDescription": "Get up to 50% off your orders when you use this Ralph Lauren promo code during checkout."
    },
    {
        "couponCode": "4WK6THQNCT6GN34G",
        "couponTitle": "Ralph Lauren Coupon Code: $105 Off Your Order",
        "couponDescription": "Score $105 off your qualifying purchases by using this Ralph Lauren coupon code at checkout."
    },
    {
        "couponCode": "FF1-NLWA-P5P6-FFWR",
        "couponTitle": "Take Up to 25% Off on Your Entire Purchase",
        "couponDescription": "Enjoy up to 25% off on your total order when you apply this code during checkout at ralphlauren.com."
    },
    {
        "couponCode": "RALPHLAUREN50",
        "couponTitle": "Get Up to 50% Off Your Purchase",
        "couponDescription": "Receive up to 50% off your order. Use code during the checkout process."
    },
    {
        "couponCode": "FF2-XBPR-2YPA-25B2",
        "couponTitle": "Get Extra 40% Off Your Ralph Lauren Purchase",
        "couponDescription": "Take an extra 40% discount on your order when you input this code during the checkout procedure at ralphlauren.com."
    },
    {
        "couponCode": "VCNQ2VCG6SKRPKR7",
        "couponTitle": "Ralph Lauren Discount Code: Save 30% on Any Purchase  ",
        "couponDescription": "Shop at Ralph Lauren and enjoy a 30% discount on any purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "FZMMP9PN6BZB4K7S",
        "couponTitle": "Ralph Lauren Promo Code: Get 40% Off Any Order ",
        "couponDescription": "Redeem this promo code at checkout and save 40% on any order."
    },
    {
        "couponCode": "BUDDY",
        "couponTitle": "Ralph Lauren Discount Code: Extra $20 Off Your Order ",
        "couponDescription": "Receive an additional $20 off on your Ralph Lauren purchase."
    },
    {
        "couponCode": "DLG7MHPK5LH7DWNL",
        "couponTitle": "Ralph Lauren Discount Code: Up to 60% Off Your Order",
        "couponDescription": "Enjoy up to 60% off on select items at Ralph Lauren. Insert the code at the checkout page."
    },
    {
        "couponCode": "74WBT3FFHMZD7KVT",
        "couponTitle": "Get Extra 30% Off Your Purchase",
        "couponDescription": "Use this coupon to save an additional 30% on the Cotton Herringbone Field Jacket at Ralph Lauren."
    }
]