[
    {
        "couponCode": "HOLIDAY20",
        "couponTitle": "Extra 20% Off Your Order At Fresh Clean Threads",
        "couponDescription": "Enter this Fresh Clean Threads promo code at checkout to apply an extra 20% off your orders of regular priced items."
    },
    {
        "couponCode": "BDAY20",
        "couponTitle": "Fresh Clean Threads Coupon: 20% Off Your Order",
        "couponDescription": "Score a fresh new look with 20% off your purchase at freshcleantees.com, where quality and style meet. This amazing discount applies to their versatile range of categories, including their ultra-comfortable tees and trendy threads collection."
    },
    {
        "couponCode": "FOURTH",
        "couponTitle": "25% Off Almost Everything",
        "couponDescription": "Score a fantastic 25% off your current purchase at freshcleantees.com. This generous discount applies to their soft, stylish t-shirts and comfortable, tailored hoodies - upgrade your wardrobe for less today."
    },
    {
        "couponCode": "GET25",
        "couponTitle": "Fresh Clean Threads Coupon: Get 25% Off Any Order",
        "couponDescription": "Receive 25% off when you spend $140 and more at Fresh Clean Threads."
    },
    {
        "couponCode": "FLASH15",
        "couponTitle": "Fresh Clean Threads Discount Code: $15 Off $75+ Orders",
        "couponDescription": "Use this Fresh Clean Threads coupon code at checkout to save $15 off your orders of $75 or more."
    },
    {
        "couponCode": "LESSLAUNDRY",
        "couponTitle": "Fresh Clean Threads Coupon: Up to 40% Off Your Order",
        "couponDescription": "Get up to 40% off on their Threadbox Packs with this coupon code. Celebrate Anniversary Week with freshcleantees.com."
    },
    {
        "couponCode": "GET30",
        "couponTitle": "30% on Orders $120 or More + Free Gift",
        "couponDescription": "Are you ready to save some cash today? Get your wardrobe essentials at unbeatable prices during the Memorial Day Sale. Use this discount code at freshcleantees.com to receive a fantastic 30% off on orders of $120 or more. But wait, there's more. You'll also score a free gift with your purchase. Don't miss out on this amazing deal - shop now and upgrade your tee collection in style."
    }
]