[
    {
        "couponCode": "holiday23",
        "couponTitle": "WaySpa Coupon: 20% Off Your Order of $150+",
        "couponDescription": "Enjoy 20% off your current indulgence at wayspa.com, your portal to luxury and relaxation. Whether you're booking a rejuvenating massage or planning a tranquil spa day, this incredible deal applies to all their spectacular services and gift certificates."
    },
    {
        "couponCode": "WP10foryou",
        "couponTitle": "Wayspa Coupon: 10% Off When You Spend $100+, Free Shipping Included",
        "couponDescription": "Indulge in a luxurious spa experience with WaySpa and enjoy a smashing 10% off on all orders of $100 or more. That's not all - we're also throwing in free shipping to make your shopping spree even more delightful. Your rejuvenating journey awaits you at WaySpa.com."
    },
    {
        "couponCode": "WP15FORYOU",
        "couponTitle": "Wayspa Coupon: 15% Off When You Order $125+, Free Shipping Included",
        "couponDescription": "Get ready to pamper yourself at wayspa.com. Use the online coupon code to enjoy a fabulous 15% off on all orders of $125 or more. Plus, we'll ship your order for free."
    },
    {
        "couponCode": "WP20foryou",
        "couponTitle": "Wayspa Coupon: 20% Off When You Spend $200+, Free Shipping Included",
        "couponDescription": "Magnify your savings at wayspa.com with a fantastic 20% discount on orders of $200 or more. Plus, enjoy the added bonus of free shipping. Don't miss out on this coupon code deal."
    },
    {
        "couponCode": "monamie",
        "couponTitle": "Wayspa Coupon: 25% Off Your Order",
        "couponDescription": "Unlock a world of relaxation and rejuvenation with a fantastic 25% off coupon code for Wayspa.com. With this irresistible offer, you can indulge in luxurious spa treatments like massages, facials, body wraps or even try out yoga classes at unbeatable prices."
    },
    {
        "couponCode": "spabliss",
        "couponTitle": "Wayspa Coupon: 30% Off Your Order ",
        "couponDescription": "Enjoy a rejuvenating experience at wayspa.com with an exclusive 30% off coupon code. Indulge in blissful spa services for less today."
    },
    {
        "couponCode": "shiplibre",
        "couponTitle": "WaySpa Coupon: Get Free Shipping",
        "couponDescription": "Get ready to unwind and rejuvenate with Wayspa. We're serving the perfect pampering treat with free shipping on your order. Indulge in a blissful massage, a revitalizing facial, or even a full-day spa package for less."
    },
    {
        "couponCode": "materre",
        "couponTitle": "Wayspa Coupon: 15% Off When You Order $100+",
        "couponDescription": "This Wayspthe promo code brings a fantastic opportunity to treat yourself or your loved ones with luxury wellness services. Enjoy 15% off on a wide range of offerings at wayspa.com, including rejuvenating spa treatments, indulgent massage therapies, holistic wellness packages, and much more."
    },
    {
        "couponCode": "CadeauWS",
        "couponTitle": "Wayspa Coupon: 25% Off When You Purchase $125+",
        "couponDescription": "Enjoy a luxurious spa experience for less with this special coupon code at wayspa.com. We are giving you a 25% off coupon code that applies sitewide. Whether you're booking a massage, facial, or body treatment, this deal ensures you can relax and rejuvenate without straining your wallet."
    },
    {
        "couponCode": "15foryou",
        "couponTitle": "Wayspa Coupon: 15% Off Your Purchase",
        "couponDescription": "Shop and save 15% with this promo code for $125+ orders on your cart at Wayspa."
    },
    {
        "couponCode": "20foryou",
        "couponTitle": "Wayspa Promo Code: 20% Off Your Order",
        "couponDescription": "Shop using Wayspa's discount code and get 20% off your $200+ purchase at checkout."
    },
    {
        "couponCode": "10foryou",
        "couponTitle": "Wayspa Coupon Code: Take 10% Off Orders $100+",
        "couponDescription": "Enjoy a 10% discount on orders over $100 when you enter this coupon code at checkout."
    },
    {
        "couponCode": "WAY12MC",
        "couponTitle": "Save 20% Off Using Code",
        "couponDescription": "til may 31 save 20% when you use your caa mastercard to purchase any wayspa gift cert. use promo code"
    },
    {
        "couponCode": "SPOILMOM",
        "couponTitle": "Save 20% Off",
        "couponDescription": "this give the gift of spa! order now and save 20% with coupon code; print or email instantly."
    },
    {
        "couponCode": "GALENTINES",
        "couponTitle": "Grab 15% Off Your Order of $75+",
        "couponDescription": "Hit the spa and enjoy 15% off your purchase of $75 or more when you redeem this promo code at checkout."
    },
    {
        "couponCode": "mapersonne",
        "couponTitle": "Wayspa Coupon: 25% Off When You Order $250+",
        "couponDescription": "Enjoy 25% off on your current purchase at wayspa.com. This generous offer applies sitewide, allowing you to save on everything from relaxing massages to rejuvenating facials. Just apply the discount code at checkout and enjoy premium spa services at a fraction of the cost."
    },
    {
        "couponCode": "mamaman",
        "couponTitle": "Wayspa Coupon: 20% Off When You Purchase $200+ ",
        "couponDescription": "This Wayspthis promo code offers an exciting 20% discount on your purchases. Enjoy a variety of spa services like massages, facials, and body treatments at significantly reduced prices. You can also save on wellness packages and numerous spa products to enhance your relaxation experience."
    },
    {
        "couponCode": "MYLOVE",
        "couponTitle": "Wayspa Coupon: 15% Off When You Order $100+ ",
        "couponDescription": "Score a fantastic deal at wayspa.com and save 15% on orders of $100 or more. This is your chance to give the gift of everlasting love wrapped up in a handy gift card. Perfect for spa enthusiasts, this coupon code is too good to pass up."
    },
    {
        "couponCode": "Joyous23",
        "couponTitle": "WaySpa Coupon: Enjoy 10% Off Orders $80+",
        "couponDescription": "Experience luxury for less with this promo code. Get 10% off when you order $80 or more at Wayspa.com. Indulge in soothing massages and rejuvenating facials at a discount, making self-care more affordable than ever."
    },
    {
        "couponCode": "xmas23",
        "couponTitle": "WaySpa Coupon: 15% Off Your Purchase of $125+",
        "couponDescription": "Enjoy a luxurious spa experience at a fraction of the cost at WaySpa. This discount code gets you 15% off your purchase of $125 or more. Pamper yourself or treat someone special today, and remember, relaxation is just a click away."
    }
]