[
    {
        "couponCode": "GREAT",
        "couponTitle": "Save 30% Off Your Gap Order With Code",
        "couponDescription": "Take 30% off your order at Gap when you enter this code at checkout."
    },
    {
        "couponCode": "TREAT",
        "couponTitle": "10% Off Your Gap Order",
        "couponDescription": "Use this coupon code at checkout to receive a 10% discount on your Gap order."
    },
    {
        "couponCode": "CARD10",
        "couponTitle": "Gap Promo Code: Extra 10% Off Your Order",
        "couponDescription": "Buy and save an additional 10% on your purchase using the Gap Inc. Credit Card at checkout."
    },
    {
        "couponCode": "FRIDAY",
        "couponTitle": "Gap Coupon Code: Take Extra 20% Off Any Purchase ",
        "couponDescription": "Enjoy an extra 20% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "HOLIDAY",
        "couponTitle": "Get 40% Off Your Gap Order With Code",
        "couponDescription": "Save 40% off your order at Gap when you enter this code during checkout."
    },
    {
        "couponCode": "SHOPFIRST",
        "couponTitle": "Up to 25% Off at Gap",
        "couponDescription": "Receive up to 25% off your shopping cart when you apply our discount code."
    },
    {
        "couponCode": "LUXE",
        "couponTitle": "Take Up to 15% Off Using Gap Coupon",
        "couponDescription": "Enter this Gap promo code at checkout for up to a 15% discount on your order."
    },
    {
        "couponCode": "GAPGOODNOW",
        "couponTitle": "Score Up to 20% Off Your Purchase",
        "couponDescription": "Save up to 20% on your cart when you add this Gap discount code at checkout."
    },
    {
        "couponCode": "WELCOMEBR",
        "couponTitle": "Take 20% Off Your Purchase ",
        "couponDescription": "Enjoy shopping and get a 20% discount on your purchase when you use your banana republic rewards credit card. Enter this coupon code at checkout."
    },
    {
        "couponCode": "QDO1S092X",
        "couponTitle": "Score Up to 5% Off Any Purchase",
        "couponDescription": "Enter this Gap coupon code at checkout to get up to 5% off your next purchase of affordable fashions."
    },
    {
        "couponCode": "HELLOATH20",
        "couponTitle": "Up to 20% Off Any Purchase Sitewide",
        "couponDescription": "Shop for skirts, shirts, accessories, and more using this Gap coupon code to get up to 20% off your purchase."
    },
    {
        "couponCode": "YOURVS",
        "couponTitle": "Gap Coupon Code: 15% Off Your Purchase",
        "couponDescription": "Get 15% off your purchase with this Gap coupon code."
    },
    {
        "couponCode": "BRCARDPERK",
        "couponTitle": "Save Extra 10% on Your Order",
        "couponDescription": "Apply the following code to receive an additional 10% off at \nGap."
    },
    {
        "couponCode": "14DAYPASS",
        "couponTitle": "Gap Discount Code: Up to 20% Off Your Order",
        "couponDescription": "Enter this Gap coupon code at checkout and get up to a 20% discount on your order."
    },
    {
        "couponCode": "BRINSIDER",
        "couponTitle": "Get 30% Off Your Order",
        "couponDescription": "Save big at Gap by getting 30% on your purchase."
    },
    {
        "couponCode": "L2X9AMLSD7",
        "couponTitle": "Gap Coupon Code: Up to 20% Off Your Order",
        "couponDescription": "Save up to 20% off your purchase by adding this code at the checkout page."
    },
    {
        "couponCode": "GFLEAVES",
        "couponTitle": "Gap Coupon Code: Save 31% on Your Order",
        "couponDescription": "Apply this discount code at checkout for 31% off your order."
    },
    {
        "couponCode": "TEN",
        "couponTitle": "Enjoy 10% Off Your Purchase",
        "couponDescription": "Score a 10% discount on your select order using this Gap coupon code at checkout."
    },
    {
        "couponCode": "ADDON",
        "couponTitle": "Gap Coupon: 10% Off Your Order",
        "couponDescription": "Use this Gap coupon code at checkout to save 10% on your entire purchase at gap.com. Shop the latest fashion trends for men, women, and kids. Don't miss out on this fantastic opportunity to get high-quality clothing at discounted prices."
    },
    {
        "couponCode": "WRAP",
        "couponTitle": "Gap Coupon: 10% Off Your Order",
        "couponDescription": "Enjoy an extra 10% off at Gap.com with this discount code. Stock up on stylish jeans, cozy sweaters, and trendy accessories."
    }
]