[
    {
        "couponCode": "XMAS",
        "couponTitle": "Creation Watches Coupon: Extra 15% Off Your Order",
        "couponDescription": "Get ready to jingle all the way to savings. Their Christmas Mega Deal is here, offering an extra 15% off on everything at creationwatches.com. Just use the discount code at checkout and watch your savings pile up like presents under the tree."
    },
    {
        "couponCode": "CWX10",
        "couponTitle": "Creation Watches Coupon: Extra 10% Off on Your Entire Order",
        "couponDescription": "Score amazing savings at creationwatches.com with their Christmas Mega Deal. They're offering an extra 10% off on everything in the store. This is the perfect opportunity to grab those must-have watches and accessories at unbeatable prices."
    },
    {
        "couponCode": "GIFTM",
        "couponTitle": "Get Extra 10% Off Gift Ideas For Women",
        "couponDescription": "Score 10% off gift ideas for men on selected men's watches at Creation Watches."
    },
    {
        "couponCode": "SEIKO10",
        "couponTitle": "Get 10% Discount Using Promo Code",
        "couponDescription": "Save 10% off with code"
    },
    {
        "couponCode": "GET5",
        "couponTitle": "Creation Watches Promo Code: Extra 5% Off Your Order",
        "couponDescription": "Shop and take an extra 5% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "HD15",
        "couponTitle": "Extra 15% Off selected watches At Creation Watches",
        "couponDescription": "Shop with this Creation Watches discount code to claim an extra 15% off your orders of selected watches."
    },
    {
        "couponCode": "BFSALE",
        "couponTitle": "Creation Watches Coupon: Get Extra 15% Off Watches",
        "couponDescription": "Receive an extra 15% discount on watches. Paste this promo code at checkout."
    },
    {
        "couponCode": "HOLIDAY",
        "couponTitle": "Creation Watches Promo Code: Get Up to 5% Off Your Order",
        "couponDescription": "Redeem this promo code at checkout and save up to 5% on your order."
    },
    {
        "couponCode": "CMWK15",
        "couponTitle": " Creation Watches Deals: Take 15% Off + Free Shipping",
        "couponDescription": "Shop and save 15% off + Free Shipping using the promo code in your shopping cart at Creation Watches."
    },
    {
        "couponCode": "BF10",
        "couponTitle": "Creation Watches Code: Extra 10 % Off Your Order Store-Wide",
        "couponDescription": "Enjoy 10% off using the promo code from Creation Watches on your shopping cart at checkout."
    },
    {
        "couponCode": "TOP5",
        "couponTitle": "Enjoy Extra 5% Off Your Purchase",
        "couponDescription": "Take extra 5% off on selected watches at Creation Watches."
    },
    {
        "couponCode": "RBLACK",
        "couponTitle": "Creation Watches Coupon: 20% Off Your Order",
        "couponDescription": "Save extra 20% on select ratio watches with this Creation Watches code."
    },
    {
        "couponCode": "BSW25",
        "couponTitle": "Get Extra 10% Off Watches Blowout Sale",
        "couponDescription": "Score up to an extra 10% off select watches during blowout sale at Creation Watches."
    },
    {
        "couponCode": "MANONTIME23",
        "couponTitle": "Creation Watches Promo Code: Get 15% Off Any Order ",
        "couponDescription": "Redeem this promo code at checkout and save 15% on any order."
    },
    {
        "couponCode": "CMSALE",
        "couponTitle": "Creation Watches Coupon: Extra 15% Off Your Order",
        "couponDescription": "Use this Creation Watches discount code to save 15% on your purchase."
    },
    {
        "couponCode": "CM10",
        "couponTitle": "Creation Watches Coupon: Extra 10% Off Your Order",
        "couponDescription": "Get ready for mega savings at CreationWatches.com with the Cyber Monday Mega Deals sale. Enjoy an extra 10% off on everything across the store. This is the perfect time to grab that watch you've been eyeing without breaking the bank. Don't miss out on these massive discounts and apply this coupon code at checkout."
    },
    {
        "couponCode": "WINTER",
        "couponTitle": "Creation Watches Coupon: 10% Off Your Order",
        "couponDescription": "Enjoy 10% off your purchase on winter season sale at Creation Watches."
    },
    {
        "couponCode": "SUPER10",
        "couponTitle": "Creation Watches Discount Code: Save 10% on Any Purchase ",
        "couponDescription": "Shop at Creation Watches and enjoy a 10% discount on any purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "BFR20",
        "couponTitle": "Creation Watches Coupon: 20% Off Your Order",
        "couponDescription": "Take extra 20% off your purchase at Creation Watches."
    },
    {
        "couponCode": "CASI010",
        "couponTitle": "Take 20% Off Your Order",
        "couponDescription": "Save at Creation Watches by getting 20% on select watches."
    }
]