[
    {
        "couponCode": "AERIE20",
        "couponTitle": "Take 20% Off All Orders With American Eagle Discount Code",
        "couponDescription": "Use a code to receive an additional 20% off orders of $50 or more at American Eagle Outfitters."
    },
    {
        "couponCode": "MERRY30",
        "couponTitle": "Save 30% Off $100+, 25% Off $75+, 20% Off $50",
        "couponDescription": "Use this American Eagle coupon code to take an extra 20% off $50, 25% off $75+, and 30% Off $100+."
    },
    {
        "couponCode": "APPNEW25",
        "couponTitle": "Extra 25% Off with App Purchase",
        "couponDescription": "Download the American Eagle app on the App Store and Google Play. Get an extra 25% off your entire purchase when using this AE promo code."
    },
    {
        "couponCode": "BUNDLE30",
        "couponTitle": "Get 30% Off Your Order",
        "couponDescription": "Enjoy 30% off when you spend $125 and more at American Eagle."
    },
    {
        "couponCode": "BFF30",
        "couponTitle": "American Eagle Coupon Code: Take Up to 30% Off Your Purchase ",
        "couponDescription": "Enjoy up to a 30% discount on your purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "MAAAJORSAVES",
        "couponTitle": "American Eagle Coupon: Up to 30% Off Your Purchase",
        "couponDescription": "Enjoy 20% off your purchase of $50, 25% off when you spend $75, or 30% off orders of $100 or more at American Eagle. Simply use the coupon code at checkout to unlock these discounts (valid for US customers only)."
    },
    {
        "couponCode": "LOVEYA",
        "couponTitle": "Get 30% Off Your Purchase",
        "couponDescription": "Enjoy 30% savings on your eligible order by simply using this American Eagle discount code at checkout."
    },
    {
        "couponCode": "EXTRASAVINGS",
        "couponTitle": "American Eagle Outfitters Promo Code: Extra 25% Off",
        "couponDescription": "Shop and receive an additional 25% off using this discount code on your purchase at American Eagle Outfitters."
    },
    {
        "couponCode": "153A5LAF36F43F47E7KJ",
        "couponTitle": "American Eagle Discount Code: 10% Off",
        "couponDescription": "Apply 10% off using this coupon code on your purchase at American Eagle."
    },
    {
        "couponCode": "BOO",
        "couponTitle": "American Eagle Coupon: Members Get 31% Off Your Order ",
        "couponDescription": "Real Rewards Members can enjoy 31% off almost everything at AE and Aerie. Grab this coupon code and dive into their early access sale now."
    },
    {
        "couponCode": "EXTRASUMMER",
        "couponTitle": "American Eagle Outfitters Coupon: Up to 30% Off Your Order of $50, $75, or $100",
        "couponDescription": "Get ready to sizzle this summer with AE.com's fantastic discounts. Splash into savings with an extra 30% off when you spend $100 or more, a cool 25% off on purchases of $75 or more, and a breezy 20% off when you shop for $50 or more. This is the perfect opportunity to refresh your summer wardrobe without breaking the bank."
    },
    {
        "couponCode": "SUNSHINE25",
        "couponTitle": "Enjoy an Extra 25% Off Your Purchase",
        "couponDescription": "Get an additional 25% off on your online shopping at American Eagle Outfitters by using the special discount code. This offer is perfect for all fashion-savvy shoppers looking for the latest trends in apparel and accessories while saving money. Today is a great day to shop at ae.com because you can take advantage of this limited-time offer and get more value for your money."
    },
    {
        "couponCode": "TOPS20",
        "couponTitle": "Score 20% Off Tops With American Eagle Promo Code",
        "couponDescription": "Paste this American Eagle promo code at checkout and save up to 20% on tops."
    },
    {
        "couponCode": "SAVEMORE",
        "couponTitle": "Save 20% Off w/ Promo Code",
        "couponDescription": "Save 20% off with discount code"
    },
    {
        "couponCode": "YAY10",
        "couponTitle": "American Eagle Outfitters Coupon: Extra 10% Off Your Order",
        "couponDescription": "Get ready to shop till you drop. For two days only, enjoy a whopping extra 10% off on all AE & Aerie products at ae.com. Hurry and use the online coupon code at checkout. Don't miss this fantastic deal."
    }
]