[
    {
        "couponCode": "SAVE50",
        "couponTitle": "Macy's Code: Buy 1 Get 1 50% Off ",
        "couponDescription": "Buy 1 and get the 2nd pair at 50% off on full priced sunglasses by Sunglass Hut using this Macy's promo code."
    },
    {
        "couponCode": "NEWYEAR",
        "couponTitle": "Macy's Coupon Code: Extra 20% Off Your Order",
        "couponDescription": "Take an extra 20% off your purchase using a promo code at checkout."
    },
    {
        "couponCode": "SAVE",
        "couponTitle": "Extra 15% Off Sale with Macy's Promo Code",
        "couponDescription": "Get an extra 15% off already reduced prices by applying this Macy's discount code at checkout."
    },
    {
        "couponCode": "and",
        "couponTitle": "Get 25% Off Your Order",
        "couponDescription": "Enjoy 25% off sitewide by adding this Macy's code."
    },
    {
        "couponCode": "FRIEND",
        "couponTitle": "Macy's Coupon Code: Extra 30% Off + 15% Off Beauty",
        "couponDescription": "Shop Macy's Friends and Family Sale. Score an extra 30% off on a wide variety of items for the whole family and home when you apply this Macy's coupon at checkout. Plus receive an extra 15% off on beauty products."
    },
    {
        "couponCode": "GIVEWINE35",
        "couponTitle": "35% Off Your Purchase w/ Promo Code",
        "couponDescription": "Score a 35% discount on your select order when you use this Macy's coupon code during checkout."
    },
    {
        "couponCode": "SGHHOLIDAY24",
        "couponTitle": "Macy's Coupon Code: $75 Off Your Purchase",
        "couponDescription": "Use this promotional code at checkout to get $75 off your qualifying order."
    },
    {
        "couponCode": "CK10",
        "couponTitle": "Macy's Coupon Code: Take 10% Off Your Purchase ",
        "couponDescription": "Enjoy a 10% discount on your purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "OFF100",
        "couponTitle": "Macy's Discount Code: $45 Off Your Order",
        "couponDescription": "Use this Macy's promo code at checkout to score $45 off select purchases of $100 or more."
    },
    {
        "couponCode": "APPONLY",
        "couponTitle": "Macy's Promo Code: Get 20% Off Ray-Ban",
        "couponDescription": "Shop online and apply this Macy's promo code when you checkout to enjoy 20% off Ray-Ban, Oakley, and Persol sunglasses."
    },
    {
        "couponCode": "CLINIQUE20",
        "couponTitle": "20% Off Clinique with Macy's Promo Code",
        "couponDescription": "Take 20% off on Clinique products when this Macy's promo code is applied."
    },
    {
        "couponCode": "JOY",
        "couponTitle": "Macy's Coupon Code: Extra 20% Off Your Order",
        "couponDescription": "Enjoy an additional 20% off select sale and clearance clothing, jewelry, accessories and handbags. Use this Macy's promo code for discount."
    },
    {
        "couponCode": "SPARKLE",
        "couponTitle": "Macy's Discount Code: 20% Off Jewelry ",
        "couponDescription": "Enjoy 20% off on select Sale and Clearance fine jewelry at Macy's with this promo code. Discover the stunning beauty of these unique gems and save while you sparkle."
    },
    {
        "couponCode": "GREAT",
        "couponTitle": "Macy's Coupon Code: 40% Off Shoes ",
        "couponDescription": "Score up to 40% off 2 or more pairs, 30% off 1 pair during great shoe sale at Macy's."
    },
    {
        "couponCode": "LABOR",
        "couponTitle": "Macy's Promo Code: Extra 20% Off Your Order",
        "couponDescription": "Elevate your style and home while enjoying remarkable discounts on a variety of products. Apply this promo code at checkout for a 20% discount on select sale and clearance items at Macy's."
    },
    {
        "couponCode": "VIP",
        "couponTitle": "Macy's Coupon: Extra 30% Off + 15% Off Beauty ",
        "couponDescription": "Use this Macy's discount code at checkout to receive an additional 30% off and 15% off beauty products."
    },
    {
        "couponCode": "ENJOY",
        "couponTitle": "Macy's Coupon Code: 20% Off Your Order",
        "couponDescription": "Elevate your style and home while enjoying remarkable discounts on a variety of products. Apply this promo code at checkout for a 20% discount on select items at Macy's."
    },
    {
        "couponCode": "GOTIME",
        "couponTitle": "Macy's Coupon: Extra 15% Off Your Order",
        "couponDescription": "Shop at Macy's and get an additional 15% discount on any items. Apply this discount code checkout."
    },
    {
        "couponCode": "ZKY8D5KZWJ74",
        "couponTitle": "Macy's Coupon: 20% Off Your Order ",
        "couponDescription": "Use this Macy's promo code to enjoy 20% off your purchase at macys.com. Save on stylish apparel, trendy shoes, or chic home décor."
    },
    {
        "couponCode": "WINEWINEWINE35",
        "couponTitle": "Get 35% Off Wine ",
        "couponDescription": "Paste this promo code at checkout and save 35% on wine."
    }
]