[
    {
        "couponCode": "ACCESS",
        "couponTitle": "Alo Coupon Code: Get 30% Off Your Order",
        "couponDescription": "Apply this Alo Yoga coupon code upon checking out to receive 30% off on your order."
    },
    {
        "couponCode": "SHOPAPP15",
        "couponTitle": "Alo Yoga Promo Code: Extra 15% Off Your Order",
        "couponDescription": "Use this promo code during checkout for an extra 15% off on clothes, sneakers, accessories and more at aloyoga.com."
    },
    {
        "couponCode": "AYPROPROGRAM",
        "couponTitle": "Alo Yoga Promo Code: Extra 25% Off Any Order Sitewide",
        "couponDescription": "Take an additional 25% off on your purchase when you use this Alo Yoga code at checkout."
    },
    {
        "couponCode": "ayadvocate",
        "couponTitle": "Alo Yoga Discount Code: Extra 25% Off Your Order",
        "couponDescription": "Get an extra 25% off your purchase by using this Alo Yoga coupon code at checkout."
    },
    {
        "couponCode": "AYOPROPROGRAM",
        "couponTitle": "Alo Yoga Promo Code: Extra 15% Off Your Purchase",
        "couponDescription": "Shop at Alo Yoga and save an additional 15% by using this discount code during checkout."
    },
    {
        "couponCode": "EREWHON20",
        "couponTitle": "Alo Coupon Code: Take 10% Off Your Purchase",
        "couponDescription": "Use this Alo Yoga coupon code at checkout to enjoy a 10% savings on your entire purchase."
    },
    {
        "couponCode": "MEMBER",
        "couponTitle": "Alo Yoga Coupon: 30% Off All Orders",
        "couponDescription": "Use this coupon code to save 30% on our best-selling products at Alo Yoga."
    },
    {
        "couponCode": "VIP30",
        "couponTitle": "Alo Yoga Promo Code: 30% Off Your Purchase",
        "couponDescription": "Use this coupon code during checkout and save 30% on everything at Alo Yoga."
    },
    {
        "couponCode": "BEAUTY0410",
        "couponTitle": "Get 15% Off Beauty and Wellness Products ",
        "couponDescription": "Redeem this promo code at checkout and save 15% on beauty and wellness products."
    },
    {
        "couponCode": "welcome10",
        "couponTitle": "Alo Yoga Promo Code: Up to 10% Off Any Purchase",
        "couponDescription": "Get up to 10% off on your Alo Yoga order when you redeem this coupon code at checkout."
    },
    {
        "couponCode": "earlyaccess20",
        "couponTitle": "Alo Yoga Coupon Code: 20% Off Any Purchase",
        "couponDescription": "Shop qualifying products at Alo Yoga and save 20% when you apply this code."
    },
    {
        "couponCode": "ACCESS10",
        "couponTitle": "Alo Yoga Promo Code: 10% Off Your Order",
        "couponDescription": "Save 10% on everything by adding this Alo Yoga promo code upon checkout."
    },
    {
        "couponCode": "MOVES20",
        "couponTitle": "Take 20% Off Any Order with Promo Code",
        "couponDescription": "Paste this coupon code at checkout and get a 20% discount on your order."
    },
    {
        "couponCode": "ALOCAP15",
        "couponTitle": "Alo Yoga Promo Code: 15% Off Your Purchase",
        "couponDescription": "Get 15% off your purchase using this Alo Yoga promo code when checking out."
    },
    {
        "couponCode": "ALOBFF10",
        "couponTitle": "Extra 10% Off Any Purchase",
        "couponDescription": "Shop at aloyoga.com and save an additional 10% on your order when you use this promo code at checkout."
    },
    {
        "couponCode": "ALOAPP15",
        "couponTitle": "Alo Yoga Discount Code: 15% Off Your Order",
        "couponDescription": "Save 15% on any order sitewide with Alo Yoga discount code."
    },
    {
        "couponCode": "ALO15",
        "couponTitle": "Save Extra 15% on Any Purchase",
        "couponDescription": "Take an extra 15% off all your orders with this Alo Yoga discount code."
    },
    {
        "couponCode": "SURVEY20",
        "couponTitle": "20% Off Any Purchase at Alo Yoga",
        "couponDescription": "Get this season's styles at Alo Yoga and save 20% when you redeem this promo code at checkout."
    },
    {
        "couponCode": "DIGJ3R3D4Q3",
        "couponTitle": "Alo Yoga Promo Code: Get Up to $40.8 Off Any Order ",
        "couponDescription": "Redeem this promo code at checkout and save up to $40.8 on any order."
    },
    {
        "couponCode": "ALOBFFS",
        "couponTitle": "Up to 30% Off Your Order",
        "couponDescription": "Add this discount code when you checkout to save up to 30% on your next Alo Yoga purchase."
    }
]