[
    {
        "couponCode": "OPAPP10",
        "couponTitle": "Extra 10% Off with Oh Polly Coupon Code",
        "couponDescription": "Receive an additional 10% off selected sale items on your in-app purchase with this promo code."
    },
    {
        "couponCode": "NEWOPAPP",
        "couponTitle": "Oh Polly Discount Code: Take 15% Off Your Order",
        "couponDescription": "Save 15% on your next Oh Polly purchase with this discount code. Shop the latest styles and trends while enjoying instant savings. Dont miss out on updating your wardrobe for less."
    },
    {
        "couponCode": "HOLIDAYGIFT25",
        "couponTitle": "25% Off Any Order: Oh Polly Discount",
        "couponDescription": "Wait no more and use this promo code during checkout. Score 25% off your Oh Polly purchase."
    },
    {
        "couponCode": "TREAT30",
        "couponTitle": "Save 30% Off w/ Discount Code",
        "couponDescription": "Shop with this Oh Polly promo code to claim 30% off your orders of selected Halloween styles."
    },
    {
        "couponCode": "vip25",
        "couponTitle": "Apply This Oh Polly Promo and Receive 20% Off",
        "couponDescription": "Enjoy 20% off your entire Oh Polly order of maxi dresses, jump suits, beach cover-ups and more."
    },
    {
        "couponCode": "ICON20",
        "couponTitle": "Oh Polly Coupon: 20% Off Your Order",
        "couponDescription": "Save 20% on app black friday bestsellers with this Oh Polly code."
    },
    {
        "couponCode": "REFRESH20",
        "couponTitle": "15% Off Instantly with Oh Polly Promo Code",
        "couponDescription": "Receive up to 15% off with promo code when you apply this code during checkout."
    },
    {
        "couponCode": "APP20",
        "couponTitle": "Oh Polly Promo: Use This Promo and Receive Up to 20% Off",
        "couponDescription": "Enjoy 20% off sitewide with Oh Polly coupon. Save money on skirts, dresses, jumpsuits, and more."
    },
    {
        "couponCode": "BANKHOL25",
        "couponTitle": "Save 25% Off",
        "couponDescription": "Get up to 25% off with promo code"
    },
    {
        "couponCode": "newfit589",
        "couponTitle": "Oh Polly Discount Code: Save 10% on Your Order",
        "couponDescription": "Save up to 10% off your entire purchase when you redeem this Oh Polly coupon."
    },
    {
        "couponCode": "APP15",
        "couponTitle": "Take 15% Off Your Oh Polly Order ",
        "couponDescription": "Enjoy 15% off bikini tops, long sleeve dresses, outerwear, and more when you use this Oh Polly promo."
    },
    {
        "couponCode": "save10",
        "couponTitle": "Oh Polly Promo Code: Get 10% Off",
        "couponDescription": "Save 10% off your Oh Polly order of maxi dresses, corset dresses, bottoms, and more."
    },
    {
        "couponCode": "WELCOME10",
        "couponTitle": "Oh Polly Coupon: Save 10% on Your Order",
        "couponDescription": "Receive 10% off your purchases at Oh Polly with this promo code applied to your cart."
    },
    {
        "couponCode": "EXTRA10GLA",
        "couponTitle": "Oh Polly Coupon Code: Extra 10% Off Your Purchase",
        "couponDescription": "Use this Oh Polly coupon code at checkout to receive an additional 10% off your purchase."
    },
    {
        "couponCode": "DELAYS15",
        "couponTitle": "Oh Polly Promo Code: Get 15% Off Your Order",
        "couponDescription": "Receive 15% off on you Oh Polly order when this coupon code is applied to your cart at checkout."
    },
    {
        "couponCode": "IWD25",
        "couponTitle": "Take 25% Off Your Oh Polly Order",
        "couponDescription": "Redeem this coupon code and receive 25% off your entire purchase with Oh Polly."
    },
    {
        "couponCode": "HERO15",
        "couponTitle": "15% Off Using Oh Polly Coupon Instantly",
        "couponDescription": "Use this chance and apply this Oh Polly coupon code and take 15% off your order."
    },
    {
        "couponCode": "FRESHLOOK78958",
        "couponTitle": "Enjoy 15% Off With Oh Polly Coupon Code",
        "couponDescription": "Receive up to 15% discount on your order when you use this coupon code."
    },
    {
        "couponCode": "BROWSE10",
        "couponTitle": "Take 10% Off With Oh Polly Discount Code",
        "couponDescription": "Save 10% off your Oh Polly Order of bottoms, dresses, swimwear, and more when you apply this coupon code."
    },
    {
        "couponCode": "OP10RP1GHC",
        "couponTitle": "Take 5% Off Your Order",
        "couponDescription": "Save 5% on dresses, swimwear and more at Oh Polly."
    }
]