[
    {
        "couponCode": "NEW50",
        "couponTitle": "Get $50 Off Orders $99+ with Promo Code",
        "couponDescription": "Enter this coupon code at checkout and get a $50 discount on your purchase over $99."
    },
    {
        "couponCode": "FDSAVE50",
        "couponTitle": "FreshDirect Coupon: $50 Off on Your First Order of $99+",
        "couponDescription": "Snag a whopping $50 off on your first order of $99 or more at FreshDirect.com with this coupon code. This thrilling deal is the perfect welcome gift for savvy online discount shoppers like you, eagerly looking to stock up their pantry with top-quality groceries."
    },
    {
        "couponCode": "FDFREE24",
        "couponTitle": "FreshDirect Coupon: Free Delivery on Your 1st Order",
        "couponDescription": "Jumpstart your journey with FreshDirect's coupon code. With this fabulous offer, you can enjoy free delivery on your first order. It's the perfect way to experience the convenience of grocery shopping right at your fingertips."
    },
    {
        "couponCode": "FDFREE23",
        "couponTitle": "FreshDirect Coupon: Free Delivery on Your 1st Order",
        "couponDescription": "Get ready to save big on your grocery shopping. With FreshDirect's new promo code, you can now enjoy free delivery on your first order. Pick up some fresh produce, gourmet foods, and household essentials for your next order."
    },
    {
        "couponCode": "SAND5",
        "couponTitle": "$50 Off Orders $99+ (Select Jersey Shore Zip Codes)",
        "couponDescription": "Hey there, online discount shopper. We have an exciting deal for you at FreshDirect.com. Enjoy a whopping $50 off on your current order of $99 or more in select Jersey Shore zip codes. Don't miss out on this fantastic offer to save big on your favorite items. Shop now and experience the joy of huge savings."
    },
    {
        "couponCode": "FRESH6",
        "couponTitle": "Get $50 Off Your Current Buy",
        "couponDescription": "Receive $50 Discount on Your Purchase"
    },
    {
        "couponCode": "FDFREE1",
        "couponTitle": "Take 1% Off Shipping On Your Order",
        "couponDescription": "Receive $1 shipping when you use this Fresh Direct code."
    },
    {
        "couponCode": "BEACH3",
        "couponTitle": "FreshDirect Coupon: $25 Off Your Purchase of $99+ ",
        "couponDescription": "Use this FreshDirect coupon code and get $25 off your purchase of $99 or more. Whether you're stocking up on weekly groceries or planning a special meal, don't miss out on this deal."
    },
    {
        "couponCode": "SUN5",
        "couponTitle": "$25 Off Orders $99+ (Select Long Island Customers)",
        "couponDescription": "Save $25 on your current order of $99 or more in select Long Island seasonal zip codes when shopping at FreshDirect.com. This incredible deal is perfect for stocking up on all your fresh groceries and essentials. Today is the perfect day to take advantage of this special offer and save money on your online grocery shopping at FreshDirect - enjoy high-quality, fresh produce delivered straight to your door."
    },
    {
        "couponCode": "FDFREE",
        "couponTitle": "Free Shipping",
        "couponDescription": "Free shipping with discount code"
    },
    {
        "couponCode": "FRESH11",
        "couponTitle": "Take $50 Off With Coupon",
        "couponDescription": "Score an amazing $50 off your current FreshDirect order, and enjoy incredible savings on the freshest produce, seafood, meats, and more. Don't miss out on this limited-time opportunity to stock up your pantry with all your favorite high-quality foods at unbeatable prices."
    },
    {
        "couponCode": "SUN6",
        "couponTitle": "$25 Off Orders $99+ (Select Jersey Shore Customers)",
        "couponDescription": "Woohoo. Get ready to save big, online discount shoppers. Snag a fantastic $25 off on your current FreshDirect order of $99 or more in select Jersey Shore seasonal zip codes. It's the perfect time to enjoy amazing savings at FreshDirect and stock up on all your favorite items. Don't miss out on this awesome deal."
    },
    {
        "couponCode": "FREEFALL",
        "couponTitle": "FreshDirect Coupon: Free Delivery on Your Order",
        "couponDescription": "Get ready to fill your cart with goodness. FreshDirect is offering free delivery on your next order. Just use the promo code at checkout and save big on all your favorite items. From fresh fruits and veggies, top-quality meats and seafood, pantry staples, bakery delights, to ready-to-eat meals  we've got it all covered."
    },
    {
        "couponCode": "SAND6",
        "couponTitle": "$50 Off First Order of $99+ (Select NJ Customers)",
        "couponDescription": "Get ready for a fantastic deal. Use the code at freshdirect.com and enjoy a whopping $50 off your first order of $99 or more. This exclusive offer is valid in select New Jersey seasonal zip codes. So, don't wait any longer - grab this amazing discount and start shopping now."
    },
    {
        "couponCode": "LIFEMARTSAVE50",
        "couponTitle": "Take $50 Off + Free Shipping",
        "couponDescription": "Take $50 off on Your First Order of $99 or More Plus Get Free Shipping"
    }
]