[
    {
        "couponCode": "SAVEMORE10",
        "couponTitle": "Home Depot Coupon: Take 75% Off Any Purchase",
        "couponDescription": "Use this offer at Home Depot to receive up to 75% off select home and wall decor and an additional 10% off."
    },
    {
        "couponCode": "WALLREFRESH15",
        "couponTitle": "Home Depot Coupon: 15% Off Your Order",
        "couponDescription": "Save 15% on select designer wall paper with this Home Depot code."
    },
    {
        "couponCode": "SUMMERSAVE",
        "couponTitle": "Home Depot Coupon: 10% Off Your Order",
        "couponDescription": "Get an extra 10% off select items when using this Home Depot coupon code at checkout."
    },
    {
        "couponCode": "HOMEDECOR10",
        "couponTitle": "Get 10% Off Tool With Home Depot Coupon",
        "couponDescription": "Save 10% on your purchase. Enter this Home Depot promo code at checkout."
    },
    {
        "couponCode": "LABORDAY24",
        "couponTitle": "Save 10% Off With September Home Depot Coupon",
        "couponDescription": "Save 10% when you shop for furniture decor & kitchenware using Home Depot's discount code on your cart. Offer applicable for members only."
    },
    {
        "couponCode": "THDCOLLEGE20",
        "couponTitle": "$20 Off Your Order",
        "couponDescription": "Shop and take $20 off your purchase of selected orders using a promo code on your cart."
    },
    {
        "couponCode": "BACKTOCAMPUS10",
        "couponTitle": "Enjoy 10% Off With Promo Code",
        "couponDescription": "Apply this Home Depot promo code at checkout to receive 10% off your order."
    },
    {
        "couponCode": "BESTIERGAME",
        "couponTitle": "Home Depot Coupon: Take 15% Off",
        "couponDescription": "Save 15% off when you use this Home Depot promo code at checkout."
    },
    {
        "couponCode": "REFRESH10",
        "couponTitle": "Home Depot Coupon: 10% Off Your Order",
        "couponDescription": "Save 10% on selected wallpaper at Home Depot."
    },
    {
        "couponCode": "WALLPAPER10",
        "couponTitle": "Save 10% Off With Summer Promo Code",
        "couponDescription": "Get 10% off when you use this Home Depot promo code."
    },
    {
        "couponCode": "MEMORIAL10",
        "couponTitle": "Take 10% Off Your Order",
        "couponDescription": "Get up to 10% off your Home Depot purchase with this code."
    },
    {
        "couponCode": "BEDROOM10",
        "couponTitle": "Save Extra 10% Off Select Bedroom Furniture and Decor with Promo Code",
        "couponDescription": "Get an extra 10% discount on select bedroom furniture and decor. Enter this coupon code at checkout."
    },
    {
        "couponCode": "PRESIDENTS24",
        "couponTitle": "Save Up to 30% on Any Furniture, Decor and Kitchenware Item",
        "couponDescription": "Shop at Home Depot and get up to a 30% discount on any furniture, decor, and kitchenware item. Apply this discount code at checkout."
    }
]