[
    {
        "couponCode": "EXTRA10",
        "couponTitle": "Save Up to 80% Off + Get Extra 10% Off Sale ",
        "couponDescription": "Save up to 80% off plus get an extra 10% off sale items using this Princess Polly discount code at checkout."
    },
    {
        "couponCode": "COUPONFOLLOW15",
        "couponTitle": "Save 15% Sitewide | CouponFollow Exclusive",
        "couponDescription": "Redeem this Princess Polly promo code for 15% savings on your purchase. Excludes sale and gift cards."
    },
    {
        "couponCode": "APD30",
        "couponTitle": "Princess Polly Coupon: 30% Off Your Order",
        "couponDescription": "Dive into the world of high-style at princesspolly.com and snatch up a fabulous 30% discount on women's fashion apparel and accessories. Use this coupon code at checkout and start upgrading your wardrobe."
    },
    {
        "couponCode": "VIP30",
        "couponTitle": "Princess Polly Promo Code: Save 30% Off Sitewide",
        "couponDescription": "When you apply this Princess Polly promo code you can get 30% off sitewide of the latest women's fashion. Excludes sale and gift cards."
    },
    {
        "couponCode": "EOY30",
        "couponTitle": "Princess Polly Coupon: 30% Off Your Any Purchase",
        "couponDescription": "Simply apply this promo code during checkout to get 30% off all your orders."
    },
    {
        "couponCode": "SMS30",
        "couponTitle": "Take 30% Off Your Order",
        "couponDescription": "Enjoy 30% off sitewide by adding this Princess Polly code."
    },
    {
        "couponCode": "VIP50",
        "couponTitle": "Princess Polly Coupon Code: Buy 1 Get 1 50% Off",
        "couponDescription": "Enjoy a buy one, get one 50% off offer when you use this promo code at checkout. Discount excludes sale gift cards & charity capsules."
    },
    {
        "couponCode": "FIND25",
        "couponTitle": "Princess Polly Promo Code: Save 25% Off",
        "couponDescription": "Shop your favorite clothing and accessories and use this Princess Polly coupon code at checkout to save 25% off. Excludes sale items and gift cards."
    },
    {
        "couponCode": "LETICIA20",
        "couponTitle": "Princess Polly Discount Code: 20% Off",
        "couponDescription": "Apply 20% off using this coupon code on your purchase at Princess Polly."
    },
    {
        "couponCode": "GIFT25",
        "couponTitle": "Princess Polly Promo Code: Save 25% Off Sale",
        "couponDescription": "Use this Princess Polly coupon code to save 25% off all sale items when used at checkout."
    },
    {
        "couponCode": "MYSTERY",
        "couponTitle": "Mystery Sale: Save up to 20% Off",
        "couponDescription": "Use this Princess Polly coupon code for a discount of up to 255 off revealed at checkout. Excludes sale and gift cards."
    },
    {
        "couponCode": "DRESS40",
        "couponTitle": "Princess Polly Coupon: Save 40% Off Select Styles",
        "couponDescription": "Shop the Summer Sale event and get 40% off select styles when you use this Princess Polly discount code at checkout."
    },
    {
        "couponCode": "rena20",
        "couponTitle": "Take 20% Off Your Order w/ Coupon",
        "couponDescription": "Receive a 20% discount on your eligible purchase by simply using this Princess Polly promo code at checkout."
    }
]