[
    {
        "couponCode": "insider",
        "couponTitle": "Get 20% Off Sitewide with Promo Code",
        "couponDescription": "Save 20% on your order. Enter this coupon code at checkout."
    },
    {
        "couponCode": "MICAELA15",
        "couponTitle": "Enjoy 15% Savings With Promo Code",
        "couponDescription": "Get 15% off with coupon code"
    },
    {
        "couponCode": "CYBERSZN",
        "couponTitle": "First Aid Beauty Promo Code: Get 30% Off Your Order",
        "couponDescription": "Redeem this promo code at checkout and save 30% on your order."
    },
    {
        "couponCode": "4THFREEBIE",
        "couponTitle": "Get Free Free Purple Belt Bag and Mini Anti Chafe on Orders $65+",
        "couponDescription": "Enjoy shopping and get free purple belt bag and mini anti chafe on orders over $65 when you enter this coupon code at checkout."
    },
    {
        "couponCode": "N9CD3PG8",
        "couponTitle": "Save $8 on Your Purchase ",
        "couponDescription": "Shop at First Aid Beauty and get a $8 discount on your purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "GIGGLY",
        "couponTitle": "First Aid Beauty Discount Code: Up to 20% Off Your Order",
        "couponDescription": "Shop and take up to 20% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "CYBERHAUL",
        "couponTitle": "Take 30% Off Your Order",
        "couponDescription": "Enjoy 30% off your purchase and free shipping at First Aid Beauty."
    },
    {
        "couponCode": "SELFCARE",
        "couponTitle": "First Aid Beauty Coupon Code: Take 22% Off Orders $50+ ",
        "couponDescription": "Enjoy a 22% discount on orders of $50 or more when you enter this coupon code at checkout."
    },
    {
        "couponCode": "DM22",
        "couponTitle": "Enjoy 22% Off Orders $50 or More Sitewide",
        "couponDescription": "Save 22% on orders of $50 or more at First Aid Beauty. Use this discount code at checkout for instant savings. Shop skincare essentials and pamper your skin today."
    },
    {
        "couponCode": "CPT15",
        "couponTitle": "Take 15% Off Orders $150+ Sitewide",
        "couponDescription": "Get 15% off all purchases over $150 at First Aid Beauty using this coupon code at checkout. Shop now for top skincare deals."
    },
    {
        "couponCode": "STOCKUP",
        "couponTitle": "Take $25 Off Sitewide with Promo Code",
        "couponDescription": "Use this coupon code at checkout and get a $25 discount on your order."
    },
    {
        "couponCode": "FREESHIP",
        "couponTitle": "First Aid Beauty Promo Code: Free Shipping on Your Order",
        "couponDescription": "Apply free shipping at checkout when you purchase over $100+ store-wide using First Aid Beauty's discount code on your cart."
    },
    {
        "couponCode": "TREAT",
        "couponTitle": "Take 20% Off Any Purchase ",
        "couponDescription": "Enjoy shopping and get a 20% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "FE98W3M",
        "couponTitle": "Up to 30% Off Your Order",
        "couponDescription": "Shop at First Aid Beauty and get up to 30% off your purchase sitewide on your cart."
    },
    {
        "couponCode": "GSHBHZB5",
        "couponTitle": "Get 15% Off Your Order",
        "couponDescription": "Take 15% off your first purchase with this First Aid Beauty code."
    },
    {
        "couponCode": "FAMFIRST",
        "couponTitle": "First Aid Beauty Coupon: 25% Off Your Order, Free Shipping & Gift on $75+ Spend",
        "couponDescription": "Get ready to fill up your shopping cart at firstaidbeauty.com. With their promo code, you can enjoy the Biggest Ever Spring Sale. We're talking 25% off, free shipping, and even a free gift on all orders of $75 or more. This is a fantastic chance to stock up on your favorite skincare essentials or try something new."
    },
    {
        "couponCode": "DIARIES",
        "couponTitle": "First Aid Beauty Coupon: Free Item on Your Order",
        "couponDescription": "Remember to apply this promotional code during checkout to receive a free gift."
    },
    {
        "couponCode": "SKINNY",
        "couponTitle": "Free Gift on Your Order",
        "couponDescription": "Receive a free item when you apply this First Aid Beauty promo code during checkout."
    },
    {
        "couponCode": "FOSTER",
        "couponTitle": "First Aid Beauty Coupon: 20% Off Your Purchase",
        "couponDescription": "Don't forget to enter this promotional code at checkout to receive 20% off your select order."
    },
    {
        "couponCode": "BEAUTY",
        "couponTitle": "First Aid Beauty Discount Code: 15% Off Your Order",
        "couponDescription": "Apply 15% off using this coupon code on your sitewide purchase at First Aid Beauty."
    }
]