[
    {
        "couponCode": "HAWAII",
        "couponTitle": "Medterra Coupon Code: Take Up to 10% Off Any Purchase ",
        "couponDescription": "Enjoy up to a 10% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "NEW25",
        "couponTitle": "Medterra CBD Promo Code: 25% Off Your Order",
        "couponDescription": "Use this coupon code at checkout to save 25% on your qualifying purchase."
    },
    {
        "couponCode": "cart10",
        "couponTitle": "Save 10% Using Their Discount Code",
        "couponDescription": "Get up to 10% off with discount code"
    },
    {
        "couponCode": "JESS15",
        "couponTitle": "Up to 15% Discount with Code",
        "couponDescription": "Use this promo code from Medterra to receive up to 15% off on your shopping cart."
    },
    {
        "couponCode": "FLASH50VIP",
        "couponTitle": "Medterra Promo Code: Get 50% Off Your Order",
        "couponDescription": "Redeem this promo code at checkout and save 50% on your order."
    },
    {
        "couponCode": "Recover",
        "couponTitle": "Save 30% with Code",
        "couponDescription": "Enjoy 30% off your shopping cart when you apply our discount code."
    },
    {
        "couponCode": "july20",
        "couponTitle": "Get 20% Discount Using Promotional Code",
        "couponDescription": "Score 20% off with promo code"
    },
    {
        "couponCode": "DISCOVER20",
        "couponTitle": "Get 20% Off Your Order",
        "couponDescription": "Take 20% off select item by adding this Medterra code."
    },
    {
        "couponCode": "HEALTHY25",
        "couponTitle": "Medterra Coupon: $25 Off Your Order",
        "couponDescription": "Enjoy $25 off everything in the store at Medterra."
    },
    {
        "couponCode": "LOVEDAD",
        "couponTitle": "Medterra's Promo Code: Get 30% Off Your Order",
        "couponDescription": "Redeem this promo code at checkout and enjoy a 30% off on your order."
    },
    {
        "couponCode": "DECBOGO",
        "couponTitle": "Medterra Coupon: Buy One Get One 50% Off",
        "couponDescription": "Receive 50% off your order with Medterra's promo code at the Buy One Get One Deal. Redeem at checkout."
    },
    {
        "couponCode": "feelgood40",
        "couponTitle": "Take 40% Off Any Purchase ",
        "couponDescription": "Enjoy shopping and get a 40% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "WK8S7J84P3",
        "couponTitle": "Medterra Coupon: 20% Off Your Order",
        "couponDescription": "Get up to 20% off your Medterra purchase with this code."
    },
    {
        "couponCode": "CBDPLEASE",
        "couponTitle": "Medterra Promo Code: Enjoy 15% Off Your Purchase",
        "couponDescription": "Get 15% off your Medterra purchase with this promo code. Save big on high-quality wellness products. Shop now to enjoy this limited-time offer."
    },
    {
        "couponCode": "RESUB50",
        "couponTitle": "Save 50% on Any Purchase ",
        "couponDescription": "Shop at Medterra and get a 50% discount on any purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "DISCOVER15",
        "couponTitle": "Medterra Promo Code: Get 15% Off Your Purchase",
        "couponDescription": "Save 15% on your Medterra purchase with this exclusive promo code. Use this special offer to get a discount on high-quality CBD products. Don't miss out on this limited-time deal to save on your next Medterra order."
    },
    {
        "couponCode": "SAFEOPT25",
        "couponTitle": "Medterra's Coupon Code: Take 25% Off CBD Products",
        "couponDescription": "Enter this coupon code at checkout and enjoy a 25% off on CBD products."
    },
    {
        "couponCode": "FREEGUMMY",
        "couponTitle": "Medterra Promo Code: Get Free Gift Orders $10+",
        "couponDescription": "Redeem this promo code at checkout and get free gift on orders over $10."
    },
    {
        "couponCode": "LOVE15",
        "couponTitle": "Get 15% Off Your Order",
        "couponDescription": "Take a 15% discount on your order. Apply this promo code at checkout."
    },
    {
        "couponCode": "DECSUB",
        "couponTitle": "Medterra Promo Code: 40% Off + Free Shipping",
        "couponDescription": "Apply this Medterra promo code at checkout to receive 40% off your orders of plus free shipping on your first 3 subscription months."
    }
]