[
    {
        "couponCode": "APP30",
        "couponTitle": "Take 30% Off First In-App Order",
        "couponDescription": "Experience exclusive savings by downloading the Goddiva app today. Enjoy a 30% discount on your first purchase using this promo code. Don't miss out on this limited-time offer."
    },
    {
        "couponCode": "BYE2024",
        "couponTitle": "Get 30% Off Your Order",
        "couponDescription": "Save 30% on select women's clothing with this Goddiva Ltd code."
    },
    {
        "couponCode": "COUNTDOWN",
        "couponTitle": "25% Off Your Order",
        "couponDescription": "Save 25% on your eligible purchase when this Goddiva Ltd voucher code is applied at checkout."
    },
    {
        "couponCode": "CYBER40",
        "couponTitle": "Goddiva Coupon: 40% Off Your Order",
        "couponDescription": "Use this Goddiva coupon code and enjoy 40% off your purchase this Cyber Monday."
    },
    {
        "couponCode": "LUCKY",
        "couponTitle": "Goddiva Coupon: 30% Off Your In-App Order",
        "couponDescription": "Enjoy a 30% discount on their stunning collection of Loving styles when you shop through the Goddiva app and use this promo code."
    },
    {
        "couponCode": "BFRIDAY30",
        "couponTitle": "Goddiva Coupon: 30% Off Your Order",
        "couponDescription": "Use this coupon code to enjoy 30% off your entire purchase at goddiva.co.uk during this Black Friday weekend."
    },
    {
        "couponCode": "EARLY30",
        "couponTitle": "Goddiva Coupon: 30% Off Your Order",
        "couponDescription": "Get ready to save 30% on your favorite styles before Black Friday at goddiva.co.uk. Just use this coupon code at checkout."
    },
    {
        "couponCode": "TREND20",
        "couponTitle": "Goddiva Ltd Coupon: Extra 20% Off",
        "couponDescription": "Enjoy an additional 20% off your cart using Goddiva Ltd's promo code at checkout."
    },
    {
        "couponCode": "MYSTERY",
        "couponTitle": "Goddiva Discount Code: 40% Off App-Only Purchase",
        "couponDescription": "Save 40% on your Goddiva purchase with this exclusive app-only discount code. This offer is valid for app transactions only. Take advantage of this deal to get high-quality fashion at a reduced price."
    },
    {
        "couponCode": "CS30",
        "couponTitle": "Get 30% Off Using The Promo Code",
        "couponDescription": "Receive 30% Discount with Promo Code"
    },
    {
        "couponCode": "FALL20",
        "couponTitle": "Goddiva Ltd Promo Code: 20% Off Your Order",
        "couponDescription": "Shop and take 20% off your purchase using a coupon code on your cart."
    },
    {
        "couponCode": "BEACH15",
        "couponTitle": "Save 15% on Swimwear at Goddiva Ltd",
        "couponDescription": "Purchase swimwear and get a 15% discount on your order. Enter this coupon code at checkout."
    },
    {
        "couponCode": "AUTUMN40",
        "couponTitle": "Take 40% Off Your Order",
        "couponDescription": "Receive a 40% discount on your eligible purchase by simply using this Goddiva Ltd voucher code at checkout."
    },
    {
        "couponCode": "CANDIESHOP",
        "couponTitle": "Goddiva Promo Code: Save 15% on Your Order Sitewide",
        "couponDescription": "Get your fashion fix for less at Goddiva with this promo code. Score a sweet 15% discount on all items sitewide. Don't miss out on this chance to save big on your next order. Shop now."
    },
    {
        "couponCode": "BIGDAY15",
        "couponTitle": "Get 15% Off On Your Total Order at Goddiva Ltd",
        "couponDescription": "Apply this Goddiva Ltd coupon code to save 15% off Goddiva black bridesmaids dresses purchase."
    },
    {
        "couponCode": "RACEGLAM20",
        "couponTitle": "Goddiva Ltd Coupon: 20% Off Race Day Dresses ",
        "couponDescription": "Apply this Goddiva Ltd promo code at checkout and save 20% on race day dresses."
    },
    {
        "couponCode": "FALL30",
        "couponTitle": "Goddiva Ltd Discount Code: 30% Off Your Order",
        "couponDescription": "Shop at Goddiva Ltd and take 30% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "SLEIGH",
        "couponTitle": "20% Off Your Order",
        "couponDescription": "Add this Goddiva Ltd discount code at checkout to apply 20% off your orders."
    },
    {
        "couponCode": "TOP25",
        "couponTitle": "Save 25% Off w/ Discount Code",
        "couponDescription": "Take 25% off with coupon code"
    },
    {
        "couponCode": "EXTRA10",
        "couponTitle": "Take 10% Off Your Order",
        "couponDescription": "Enjoy an extra 10% off women's dresses, shoes and more at Goddiva Ltd."
    }
]