[
    {
        "couponCode": "BMSM",
        "couponTitle": "Whirlpool Discount Code: Save Up to $200 on Appliances 3+   ",
        "couponDescription": "Enjoy a $100 discount when you purchase two appliances and save $100 when you purchase three or more appliances. Apply this discount code at checkout."
    },
    {
        "couponCode": "WINTER10",
        "couponTitle": "10% Off Your Order with Discount Code",
        "couponDescription": "Save 10% on your eligible purchase when this Whirlpool promotional code is applied at checkout."
    },
    {
        "couponCode": "FALL30",
        "couponTitle": "Whirlpool Promo Code: Get 30% Off Any Item ",
        "couponDescription": "Redeem this promo code at checkout and save 30% on any item."
    },
    {
        "couponCode": "WFQ4242",
        "couponTitle": "Get 15% Off Your Purchase",
        "couponDescription": "Enjoy 15% off your first order by adding this \nWhirlpool code."
    },
    {
        "couponCode": "SAVEFIVE23",
        "couponTitle": "Whirlpool Coupon: 5% Off on Your First Purchase ",
        "couponDescription": "Sign up for a new account on Whirlpool.com and get 5% off your first purchase. This is a perfect opportunity for savvy online shoppers to save more on Whirlpool products, where quality meets affordability."
    },
    {
        "couponCode": "CAPITAL5OFF",
        "couponTitle": "Save 5% on Your First Order",
        "couponDescription": "Shop at Whirlpool and get 5% discount on major appliances on your first order."
    },
    {
        "couponCode": "SWASHBF23",
        "couponTitle": "Whirlpool Coupon: 50% Off Your First Bottle of SwashR Laundry Detergent with Subscription",
        "couponDescription": "Score a fantastic deal on your first bottle of SwashR Laundry Detergent with a whopping 50% off when you order a subscription service. Dive into the world of savings and enjoy top-notch Whirlpool products at unbeatable prices."
    },
    {
        "couponCode": "ENJOY15",
        "couponTitle": "Whirlpool Black Friday Sale: Take 15% Off Electrical Appliances",
        "couponDescription": "Enjoy a 15% discount on electrical appliances when you enter this coupon code at checkout."
    },
    {
        "couponCode": "INSTALL23",
        "couponTitle": "Whirlpool Discount: Get Free Install And Haul Away On Major Appliances",
        "couponDescription": "Receive free install and haul away and major appliances when you spend $1,000 and more."
    },
    {
        "couponCode": "FREEINSTALL",
        "couponTitle": "Free Installation Storewide",
        "couponDescription": "Enter this promo code at Whirlpool for free installation on any dishwasher."
    },
    {
        "couponCode": "wfsbq3243",
        "couponTitle": "Get Up to 10% Off Any Order ",
        "couponDescription": "Paste this promo code at checkout and save up to 10% on any order."
    },
    {
        "couponCode": "WFQ1244",
        "couponTitle": "Whirlpool Coupon: 25% Off Your Order",
        "couponDescription": "Take 25% off your first purchase with this Whirlpool code."
    },
    {
        "couponCode": "SAVE50",
        "couponTitle": "Whirlpool Coupon Code: Take $50 Off Whirlpool Orders $599+ ",
        "couponDescription": "Enjoy a $50 discount on orders over $599 when you enter this coupon code at checkout."
    },
    {
        "couponCode": "LAUNDRYINSTALL",
        "couponTitle": "Whirlpool Code: Free Installation On Laundry Appliances",
        "couponDescription": "Add this Whirlpool promo code at checkout to Get Free Installation on All Laundry Appliances."
    },
    {
        "couponCode": "WHP15",
        "couponTitle": "Get Extra 15% Off Any Appliances ",
        "couponDescription": "Paste this promo code at checkout and save an extra 15% on any appliances."
    },
    {
        "couponCode": "SHIPHOME",
        "couponTitle": "Free Shipping w/ Promo Code",
        "couponDescription": "Free shipping with coupon"
    },
    {
        "couponCode": "WFQ4244",
        "couponTitle": "Whirlpool Coupon Code: Up to 5% Off Your Order",
        "couponDescription": "Save up to 5% off with coupon"
    },
    {
        "couponCode": "wfsbq2243",
        "couponTitle": "Whirlpool Promo Code: Save Up to 15% on Your Order ",
        "couponDescription": "Get up to 15% discount on any purchase. Use this promo code at checkout."
    },
    {
        "couponCode": "ENJOY10",
        "couponTitle": "10% Off on Any Purchase",
        "couponDescription": "Apply this promo code to receive a 10% discount on our best-selling appliances."
    },
    {
        "couponCode": "FALLTIME10",
        "couponTitle": "10% Off Your Order",
        "couponDescription": "Shop and get 10% off your purchase using a promo code at Whirlpool."
    }
]