[
    {
        "couponCode": "KALLMEKRIS20",
        "couponTitle": "Get 20% Off Any Order ",
        "couponDescription": "Paste this promo code at checkout and save 20% on any order."
    },
    {
        "couponCode": "STAR20",
        "couponTitle": "Take 20% Off With Code",
        "couponDescription": "Get a 20% discount with Ana Luisa's promo code on your cart at checkout."
    },
    {
        "couponCode": "HOLIDAY",
        "couponTitle": "Ana Luisa Coupon: Up to 35% Off Your Order - 25% Off 2 Items, 30% Off 3 Items, 35% Off on 4+ Items",
        "couponDescription": "Get ready for the biggest holiday savings at Ana Luisa. Use their special coupon code and enjoy a massive 35% off everything on their site. But that's not all - buy two items and we'll slash 25% off your total, nab three items for a cool 30% discount, or go big with four or more items to get an incredible 35% off."
    },
    {
        "couponCode": "EMMYCOLETTI10",
        "couponTitle": "Ana Luisa Promo Code: 10% Off Your Order",
        "couponDescription": "Take an extra 10% off your purchase when you apply this coupon code at checkout."
    },
    {
        "couponCode": "JESSMOK10",
        "couponTitle": "Receive 10% Off Your Purchase",
        "couponDescription": "Enjoy 10% off your order at Ana Luisa with this exclusive discount code. Shop stunning jewelry pieces crafted with care and elegance. Dont miss this chance to save on timeless designs."
    },
    {
        "couponCode": "LAYNA20",
        "couponTitle": "Save 5% on Your Order",
        "couponDescription": "Save 5% on your order at Ana Luisa with this exclusive discount code. Shop now for stylish jewelry at great prices. Don't miss out on this limited-time offer."
    },
    {
        "couponCode": "KATIEMARIE20",
        "couponTitle": "Ana Luisa Promo Code: Get 20% Off Your Order",
        "couponDescription": "Use this Ana Luisa promo code to get 20% off your order. Shop stylish jewelry and save on your favorite pieces. Don't miss out on this limited-time offer."
    },
    {
        "couponCode": "ALLEY10",
        "couponTitle": "Ana Luisa Coupon: 10% Off",
        "couponDescription": "Shop and receive 10% off orders with Ana Luisa's promo code on your cart."
    },
    {
        "couponCode": "BEINGGRACE20",
        "couponTitle": "Ana Luisa Discount Code: 20% Off Your Order",
        "couponDescription": "Save 20% on your Ana Luisa order with this discount code. Enjoy stylish jewelry at a lower price. Don't miss out on this limited-time offer."
    },
    {
        "couponCode": "EMILYNMAX20",
        "couponTitle": "Take 20% Off Your Order",
        "couponDescription": "Save 20% on your order at Ana Luisa with this exclusive coupon code. Shop stylish jewelry at a great price. Don't miss out on this limited-time offer."
    },
    {
        "couponCode": "KATIEKING20",
        "couponTitle": "Get 20% Off Select Items with Code",
        "couponDescription": "Save 20% on select items at AnaLuisa.com with this discount code. Shop now and enjoy stylish pieces at a reduced price. Don't miss out on this limited-time offer."
    },
    {
        "couponCode": "EMILYMAKEUP10",
        "couponTitle": "Ana Luisa Discount Code: 10% Off Select Products",
        "couponDescription": "Save 10% on BK Beauty brushes at Ana Luisa with this discount code. Elevate your makeup routine with high-quality brushes at a great price. Shop now and enjoy the savings."
    },
    {
        "couponCode": "AMIELYNN10",
        "couponTitle": "Take Up to 10% Off Your Purchase",
        "couponDescription": "Save up to 10% on your purchase at Ana Luisa with this discount code. Shop stylish jewelry and enjoy the savings. Use the code at checkout to get your discount."
    },
    {
        "couponCode": "cart5off",
        "couponTitle": "Ana Luisa Coupon: 5% Off Your Order",
        "couponDescription": "Save 5% on all your favorite items by adding this Ana Luisa code."
    },
    {
        "couponCode": "HELLOSTEPHANIEM20",
        "couponTitle": "20% Off Your Purchase with Coupon",
        "couponDescription": "Don't forget to apply this Analuisa promotional code at checkout to receive 20% off your select order."
    },
    {
        "couponCode": "KHIARAISABELLE20",
        "couponTitle": "Analuisa Promo Code: 20% Off Your Order",
        "couponDescription": "When this coupon code is applied at checkout, you can take 20% off your qualifying purchase."
    },
    {
        "couponCode": "LOUISE10",
        "couponTitle": "Take 10% Off Your Order ",
        "couponDescription": "Enjoy shopping at Ana Luisa and receive a 10% discount on your order. Redeem this discount code at checkout."
    },
    {
        "couponCode": "SIERA10",
        "couponTitle": "Ana Luisa Promo Code: 10% Off",
        "couponDescription": "Buy and save 10% with this discount code on your purchase at Ana Luisa."
    },
    {
        "couponCode": "deal20",
        "couponTitle": "Take Up to 20% Off with Code",
        "couponDescription": "Use this promo code at checkout for up to a 20% discount on your order."
    },
    {
        "couponCode": "SAVEMORE",
        "couponTitle": "Take 25% Off Your Order",
        "couponDescription": "Save big at Ana Luisa by getting 25% on your purchase."
    }
]