[
    {
        "couponCode": "BAILEEN15",
        "couponTitle": "Kindred Bravely Coupon: 15% Off Your Order",
        "couponDescription": "Save 15% on organic bamboo reusable nursing pads and more with this Kindred Bravely code."
    },
    {
        "couponCode": "15_motionmelissa",
        "couponTitle": "Take 15% Off Any Order",
        "couponDescription": "Use this Kindred Bravely by getting 15% on any purchase."
    },
    {
        "couponCode": "BLACKFRIDAY",
        "couponTitle": "Save Up to 30% on Any Purchase ",
        "couponDescription": "Shop at Kindred Bravely and get up to 30% discount on any purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "Reich15",
        "couponTitle": "Kindred Bravely Coupon: 15% Off Your Order",
        "couponDescription": "Take 15% off sitewide by adding this Kindred Bravely code."
    },
    {
        "couponCode": "babynurse15",
        "couponTitle": "Kindred Bravely Coupon: 15% Off Your Order",
        "couponDescription": "Take 15% off bras and underwear with this Kindred Bravely code."
    },
    {
        "couponCode": "LUCKY35",
        "couponTitle": "Get Products for Only $35",
        "couponDescription": "Get exclusive savings on pumping bras for moms at Kindred Bravely. Use this coupon code to purchase for just $35. Take advantage of this limited-time offer now."
    },
    {
        "couponCode": "CONTOUR20",
        "couponTitle": "Take 20% Off Your Purchase",
        "couponDescription": "Save 20% on bras, underwear and more at Kindred Bravely."
    },
    {
        "couponCode": "STRONGMAMA15",
        "couponTitle": "Kindred Bravely Coupon: 15% Off",
        "couponDescription": "Enjoy 15% off eligible items on your cart using Kindred Bravely's promo code at checkout."
    },
    {
        "couponCode": "MOTION15",
        "couponTitle": "Get 15% Off Your Order ",
        "couponDescription": "Paste this promo code at checkout and save 15% on your order."
    },
    {
        "couponCode": "BRITNEY15",
        "couponTitle": "Kindred Bravely Coupon: 15% Off Your Order",
        "couponDescription": "Take extra 15% off nursing and maternity wear at Kindred Bravely."
    },
    {
        "couponCode": "Britneek",
        "couponTitle": "Kindred Bravely Promo Code: Take 15% Off Your Order ",
        "couponDescription": "Enter this promo code at checkout and receive a 15% discount on your order."
    },
    {
        "couponCode": "RACHELWAR",
        "couponTitle": "Kindred Bravely Promo Code: Take Up to 15% Off Select Items",
        "couponDescription": "Get up to 15% off select items at Kindred Bravely with this promo code. This offer is perfect for new mums and mums-to-be. Shop now and save on comfortable and stylish maternity wear."
    },
    {
        "couponCode": "BUNDLE",
        "couponTitle": "Kindred Bravely Coupon: 40% Off Your Order",
        "couponDescription": "Take advantage of the Kindred Bravely  promo code and save 40% on your current purchase. Whether you're shopping for maternity wear, nursing clothes or postpartum essentials, this is your chance to secure a great deal."
    },
    {
        "couponCode": "JUANITAL15",
        "couponTitle": "Kindred Bravely Discount Code: Save 15% on Your Purchase ",
        "couponDescription": "Shop at Kindred Bravely and enjoy a 15% discount on your purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "HOLISTICHEIDI15",
        "couponTitle": "Kindred Bravely Promo Code: Up to 15% Off Your Order",
        "couponDescription": "Buy and save up to 15% with this discount code on your store-wide purchase at Kindred Bravely."
    },
    {
        "couponCode": "MADISONMCK",
        "couponTitle": "Take 15% Off Your Purchase",
        "couponDescription": "Enjoy extra 15% off bamboo wide leg maternity with this code."
    },
    {
        "couponCode": "Jess15",
        "couponTitle": "Get 15% Off Your Order ",
        "couponDescription": "Paste this promo code at checkout and save 15% on your order."
    },
    {
        "couponCode": "TAILYNN15",
        "couponTitle": "Kindred Bravely Promo Code: Save 15% on Your Order",
        "couponDescription": "Enjoy 15% off your purchase at Kindred Bravely with this promo code. Shop comfortable and stylish maternity wear for every stage. Use the code at checkout to save instantly."
    },
    {
        "couponCode": "CAROLINE15",
        "couponTitle": "Take 15% Off Your Order",
        "couponDescription": "Save 15% on simply sublime nursing bra with this Kindred Bravely code."
    },
    {
        "couponCode": "LISMARIE",
        "couponTitle": "Kindred Bravely Discount Code: Save Up to 15% on Your Purchase ",
        "couponDescription": "Shop at Kindred Bravely and enjoy up to a 15% discount on your purchase. Apply this discount code at checkout."
    }
]