[
    {
        "couponCode": "GSBOGO",
        "couponTitle": "Buy One, Get One Free Eyeglasses Or Sunglasses ",
        "couponDescription": "Shop and take your Second Pair for Free using this coupon code on your cart at Glassesshop."
    },
    {
        "couponCode": "HAPPY40",
        "couponTitle": "Save 40% at Glassesshop",
        "couponDescription": "Apply this coupon code from Glassesshop to receive a 40% discount on your order."
    },
    {
        "couponCode": "EXTRA10",
        "couponTitle": "Save 90% Off Sitewide",
        "couponDescription": "Use tihis promo code to save Up to 90% off + extra 10% on orders sitewide."
    },
    {
        "couponCode": "READERS40",
        "couponTitle": "Save Up to 40% with Code",
        "couponDescription": "Shop Glassesshop and receive up to 40% off for a limited time."
    },
    {
        "couponCode": "WELCOME10",
        "couponTitle": "Glassesshop's Promo Code: Get 10% Off Your Order",
        "couponDescription": "Redeem this promo code at checkout and enjoy a 10% off on your order."
    },
    {
        "couponCode": "EYE35",
        "couponTitle": "Score Up to 35% Off",
        "couponDescription": "Shop for glasses, sunglasses, and more with this GlassesShop discount code and get up to 35% off."
    },
    {
        "couponCode": "FIRST50",
        "couponTitle": "Save 10% Off",
        "couponDescription": "Score up to 10% off with coupon"
    },
    {
        "couponCode": "NEW4U",
        "couponTitle": "Glassesshop Coupon Code: Take Up to 10% Off Any Purchase ",
        "couponDescription": "Enjoy up to a 10% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "BFBOGO",
        "couponTitle": "Glassesshop Coupon: BOGO Free on Your Order",
        "couponDescription": "Purchase one, get another one for free using this promotional code at checkout."
    },
    {
        "couponCode": "WELCOME50",
        "couponTitle": "Glassesshop's Coupon Code: Take 50% Off Your Purchase",
        "couponDescription": "Enter this coupon code at checkout and enjoy a 50% off on your purchase."
    },
    {
        "couponCode": "BRIGHT35",
        "couponTitle": "Save 35% Off",
        "couponDescription": "Score up to 35% off entire frames + lenses order at GlassesShop, plus free gift on orders $59 or more."
    },
    {
        "couponCode": "BRIGHT30",
        "couponTitle": "Enjoy Up to 30% Off",
        "couponDescription": "Shop at GlassesShop with this coupon code to receive up to 30% off your order."
    },
    {
        "couponCode": "GS36",
        "couponTitle": "36% Off Your Next Order",
        "couponDescription": "Get a 36% discount when you enter this promo code at glassesshop.com."
    },
    {
        "couponCode": "CMBOGO",
        "couponTitle": "Glassesshop Coupon: BOGO Free on Your Purchase",
        "couponDescription": "Buy one, get another one for free using this promotional code during checkout. Won't last."
    },
    {
        "couponCode": "BLACK40",
        "couponTitle": "Take 40% Off Your Any Order",
        "couponDescription": "Enter this Glassesshop discount code at checkout to get 40% off all your purchases."
    },
    {
        "couponCode": "BOGO60",
        "couponTitle": "Save 60% Off Any Purchase",
        "couponDescription": "Apply this Glassesshop discount code at checkout to receive 60% off your entire purchase when you buy one get one."
    },
    {
        "couponCode": "BOGO6",
        "couponTitle": "Save 60% Off Using Code",
        "couponDescription": "Use this deal at Glasses Shop to get 60% off frames and lenses when you buy one."
    },
    {
        "couponCode": "EYE40",
        "couponTitle": "Glassesshop Coupon: Up to 40% Off Your Purchase",
        "couponDescription": "Enjoy up to 40% off orders on your cart using Glassesshop's promo code at checkout."
    },
    {
        "couponCode": "PROG50",
        "couponTitle": "Take 50% Off Progressive Lenses ",
        "couponDescription": "Enjoy shopping and get a 50% discount on progressive lenses when you enter this coupon code at checkout."
    },
    {
        "couponCode": "SALE4U",
        "couponTitle": "Glassesshop Discount Code: Save 60% on Any Purchase ",
        "couponDescription": "Shop at Glassesshop and enjoy a 60% discount on any purchase. Apply this discount code at checkout."
    }
]