[
    {
        "couponCode": "GETVOLUME20",
        "couponTitle": "Ghirardelli Chocolate Company's Discount Code: 20% Off Chocolate Bars",
        "couponDescription": "Apply this discount code at checkout and enjoy a 20% off on chocolate bars."
    },
    {
        "couponCode": "GCNEWYEAR",
        "couponTitle": "20% Off Your Order Storewide",
        "couponDescription": "Take an extra 20% off your entire purchase with this Ghirardelli Chocolate Company coupon."
    },
    {
        "couponCode": "GCVDAY",
        "couponTitle": "Ghirardelli Chocolate Company Coupon: Extra 20% Off Your Purchase",
        "couponDescription": "Shop and receive an additional 20% off sitewide orders with Ghirardelli Chocolate Company's promo code on your cart."
    },
    {
        "couponCode": "GCEARLYACCESS",
        "couponTitle": "Ghirardelli Coupon: 10% Off Your Order",
        "couponDescription": "Take 10% off sitewide by adding this Ghirardelli code."
    },
    {
        "couponCode": "GCARAMEL15",
        "couponTitle": "Ghirardelli Chocolate Company Promo Code: Get 15% Off Full Price Order ",
        "couponDescription": "Redeem this promo code at checkout and save 15% on full priced order. Valid for new customers only."
    },
    {
        "couponCode": "GACZTFRB2X58374",
        "couponTitle": "Ghirardelli Chocolate Company Discount Code: 10% Off Your Order",
        "couponDescription": "Receive 10% off ysitewide orders on your shopping cart when you apply Ghirardelli Chocolate Company's coupon code at checkout."
    },
    {
        "couponCode": "GCCAPONE15",
        "couponTitle": "Ghirardelli Coupon: 15% Off All Orders",
        "couponDescription": "Ghirardelli Chocolate Company is offering 15% off on selected Items Tall Gold Gift Box 24pc with a coupon."
    },
    {
        "couponCode": "GCYBER20",
        "couponTitle": "Ghirardelli Chocolate Company Coupon: 20% Off Any Purchase",
        "couponDescription": "Use this promo code at checkout to receive an extra 20% off all your orders."
    },
    {
        "couponCode": "GETVOLUME15",
        "couponTitle": "Ghirardelli Chocolate Company's Discount Code: 15% Off First Order",
        "couponDescription": "Apply this discount code at checkout and enjoy a 15% off on first order."
    },
    {
        "couponCode": "GETVOLUME10",
        "couponTitle": "Ghirardelli Chocolate Company's Promo Code: Get 10% Off Orders $500+",
        "couponDescription": "Redeem this promo code at checkout and enjoy a 10% off on orders over $500."
    },
    {
        "couponCode": "FREESHIP60",
        "couponTitle": "Save 20% Off + Free Shipping Using Code",
        "couponDescription": "20% Off Select Gifts and Free Shipping on orders $60+"
    },
    {
        "couponCode": "GET20",
        "couponTitle": "Get 20% Off Sitewide",
        "couponDescription": "Score up to 20% off sitewide purchase at Ghirardelli Chocolate Company."
    },
    {
        "couponCode": "G15MYUSI",
        "couponTitle": "Take 15% Off with Code",
        "couponDescription": "Pick and enjoy 15% discount with coupon code on your purchase. Redeem at checkout."
    },
    {
        "couponCode": "G10LCMA3623",
        "couponTitle": "Ghirardelli Coupon Code: 10% Off All Orders",
        "couponDescription": "Apply this coupon code from Ghirardelli Chocolate Company to receive a 10% discount on your order."
    },
    {
        "couponCode": "GC43KXM82",
        "couponTitle": "Get 15% Off Your Order",
        "couponDescription": "Take extra 15% off sitewide with this Ghirardelli code."
    },
    {
        "couponCode": "GETSHIP50",
        "couponTitle": "Get 50% Off Expedited Shipping",
        "couponDescription": "Score up to 50% off expedited shipping at Ghirardelli."
    },
    {
        "couponCode": "GCBULK20",
        "couponTitle": "Ghirardelli Chocolate Company Discount Code: Save 20% on Bulk Chocolate ",
        "couponDescription": "Shop at Ghirardelli Chocolate Company and enjoy a 20% discount on bulk chocolate. Apply this discount code at checkout."
    },
    {
        "couponCode": "GCSANTA15",
        "couponTitle": "Take 15% Off Full Priced Items ",
        "couponDescription": "Enjoy shopping and get a 15% discount on full priced items when you enter this coupon code at checkout."
    },
    {
        "couponCode": "GCFOND15",
        "couponTitle": "Enjoy 15% Off Sitewide",
        "couponDescription": "Indulge in the rich and decadent flavors of Ghirardelli Chocolate Company with a tempting 15% off promo code. Treat yourself to luxurious chocolate bars or create heartwarming memories with their irresistible hot cocoa mixes, all at an unbeatable price."
    },
    {
        "couponCode": "G15LCJS84",
        "couponTitle": "Ghirardelli Chocolate Company Promo Code: 15% Off Your Order",
        "couponDescription": "Enjoy an extra 15% off your purchase when you apply this coupon code at checkout."
    }
]