[
    {
        "couponCode": "CLASSIC50",
        "couponTitle": "The Art Of Shaving Coupon: 50% Off Your Order of $100+ ",
        "couponDescription": "Here's some exciting news for all online shoppers at theartofshaving.com. Spend $100 or more across the site and a whopping 50% discount on straight razors will be yours. It's time to elevate your grooming game without breaking the bank. Just use the coupon code at checkout to start saving."
    },
    {
        "couponCode": "STR8EDGE50",
        "couponTitle": "The Art Of Shaving Coupon: $100 Off Your Order",
        "couponDescription": "Take $100 off stainless steel 5 8 blade straight razor at The Art Of Shaving."
    },
    {
        "couponCode": "CUTKIT",
        "couponTitle": "The Art Of Shaving Discount Code: Save 30% on Duo Kit ",
        "couponDescription": "Shop at The Art Of Shaving and enjoy a 30% discount on duo kit. Apply this discount code at checkout."
    },
    {
        "couponCode": "EARLYBIRD",
        "couponTitle": "Take 30% Off Any Purchase",
        "couponDescription": "For a limited time, use this coupon code at The Art Of Shaving to save 30% on all orders."
    },
    {
        "couponCode": "WHIMSY20",
        "couponTitle": "The Art Of Shaving Discount Code: Save 20% on Your Purchase ",
        "couponDescription": "Shop at The Art Of Shaving and enjoy a 20% discount on your purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "REDDIT24",
        "couponTitle": "Take 32% Off Your Order",
        "couponDescription": "Save 32% on select products plus a straight razor for just $75 with this The Art Of Shaving code."
    },
    {
        "couponCode": "DAD50",
        "couponTitle": "The Art Of Shaving Promo Code: Get Extra 50% Off Any Order ",
        "couponDescription": "Redeem this promo code at checkout ands save an extra 50% on any order."
    },
    {
        "couponCode": "SHIP50",
        "couponTitle": "The Art Of Shaving's Coupon: Get Free Shipping On Your Order",
        "couponDescription": "Receive free shipping purchase of $50 when you use this The Art Of Shaving code."
    },
    {
        "couponCode": "BIRTHDAY10",
        "couponTitle": "The Art Of Shaving Coupon: 10% Off Sitewide",
        "couponDescription": "Use this promotional coupon code at checkout to receive 10% off your entire order."
    },
    {
        "couponCode": "62496121894530",
        "couponTitle": "The Art of Shaving Promo Code: 15% Off Your Order",
        "couponDescription": "Shop and get 15% off your purchase using a discount code at checkout."
    },
    {
        "couponCode": "TRY50",
        "couponTitle": "Take 50% Off Your Purchase",
        "couponDescription": "Save 50% on samplers by adding this The Art Of Shaving code."
    },
    {
        "couponCode": "KITME",
        "couponTitle": "Get Free Dopp Kit On Your Order",
        "couponDescription": "Enjoy free dopp kit with purchase by adding this The Art Of Shaving code."
    },
    {
        "couponCode": "BEARDLOVE",
        "couponTitle": "Take 50% Off Ultimate Beard Bundle",
        "couponDescription": "Enjoy shopping and get a 50% discount on the ultimate beard bundle when you enter this coupon code at checkout."
    },
    {
        "couponCode": "STRAIGHT50",
        "couponTitle": "The Art Of Shaving Promo: Straight Razor for $50",
        "couponDescription": "Spend $50 and get a straight razor in your shopping cart using the promo code at checkout."
    },
    {
        "couponCode": "SHIP1",
        "couponTitle": "Free Shipping w/ Coupon Code",
        "couponDescription": "Free shipping with code"
    },
    {
        "couponCode": "STRAIGHT25",
        "couponTitle": "The Art Of Shaving Code: Save 20-80% + Get a Straight Razor for $25",
        "couponDescription": "Apply this The Art Of Shaving coupon code at checkout to take 20-80% off your orders of $100 or more plus get a Straight Razor for $25."
    },
    {
        "couponCode": "DAD30",
        "couponTitle": "Take 30% Off Your Order",
        "couponDescription": "Save at The Art Of Shaving by getting extra 30% on sitewide."
    },
    {
        "couponCode": "TAOS20",
        "couponTitle": "Take 20% Off Full Size Shaving Kit ",
        "couponDescription": "Enjoy shopping and get a 20% discount on full size shaving kit when you enter this coupon code at checkout."
    },
    {
        "couponCode": "5STARS",
        "couponTitle": "The Art Of Shaving Coupon Code: Take $10 Off Any 5 Oz Shaving Cream ",
        "couponDescription": "Enjoy a $10 discount on any five oz shaving cream when you enter this coupon code at checkout."
    },
    {
        "couponCode": "CREAM30",
        "couponTitle": "Get 30% Off Any 5 Oz Shavcing Cream ",
        "couponDescription": "Paste this promo code at checkout and save 30% on any five oz shaving cream."
    }
]