[
    {
        "couponCode": "NEWLYWED",
        "couponTitle": "PhotoBook UK Discount Code: Save 65% on Your Purchase",
        "couponDescription": "Enjoy 65% discount on your purchase when you apply this discount code at checkout."
    },
    {
        "couponCode": "HOLIDAYWISH",
        "couponTitle": "Save Up to 60% on Your Purchase ",
        "couponDescription": "Shop at PhotoBook UK and get up to a 60% discount on your purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "CAL2025",
        "couponTitle": "Photobook UK Coupon: 60% Off Your Order",
        "couponDescription": "Save at Photobook UK by getting up to 60% on calendars."
    },
    {
        "couponCode": "bf2024",
        "couponTitle": "Get 55% Off Your Order",
        "couponDescription": "Enjoy up to 55% off when you add this Photo Book UK code."
    },
    {
        "couponCode": "WANDERLUST",
        "couponTitle": "PhotoBook UK Promo Code: Up to 65% Off Your Order",
        "couponDescription": "Take up to 65% off your qualifying purchase by using this coupon code at checkout."
    },
    {
        "couponCode": "getprints",
        "couponTitle": "Get 40% Off Your Order",
        "couponDescription": "Enjoy 40% off photo prints minimum of 50 pieces at Photo Book UK."
    },
    {
        "couponCode": "COZY55HOME",
        "couponTitle": "Get Up to 55% Off Home and Decor Products ",
        "couponDescription": "Paste this promo code at checkout and save up to 55% on home and wall decor products."
    },
    {
        "couponCode": "PB55SAVE",
        "couponTitle": "PhotoBook UK Discount Code: Save Up to 55% Photobooks ",
        "couponDescription": "Shop at PhotoBook UK and enjoy up to 55% discount on all photobooks. Apply this discount code at checkout."
    },
    {
        "couponCode": "WRAP50UP",
        "couponTitle": "Take Up to 50% Off Gifts ",
        "couponDescription": "Enjoy shopping and get up to 50% discount on gift category items when you enter this coupon code at checkout."
    },
    {
        "couponCode": "SNAP45DEAL",
        "couponTitle": "PhotoBook UK Promo Code: Get 45% Off Photo Prints Pieces 60+",
        "couponDescription": "Redeem this promo code at checkout and save 45% on photo prints 60 pieces or more."
    },
    {
        "couponCode": "CART60",
        "couponTitle": "Get 60% Off Almost Everything",
        "couponDescription": "Score 60% off almost everything at Photobook UK."
    },
    {
        "couponCode": "JOY55",
        "couponTitle": "PhotoBook UK Coupon Code: Take Up to 55% Off Your Purchase ",
        "couponDescription": "Enjoy up to a 55% discount on your purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "HOMELIVING",
        "couponTitle": "PhotoBook UK Promo Code: Get 60% Off Your Order",
        "couponDescription": "Redeem this promo code at checkout and save 60% on your order."
    },
    {
        "couponCode": "NEWPHOTOBOOK",
        "couponTitle": "PhotoBook UK Coupon Code: Tale 60% Off Photobooks ",
        "couponDescription": "Enjoy a 60% discount on photobooks and save 40% on upgrades when you enter this coupon code at checkout."
    },
    {
        "couponCode": "19BIRTHDAY",
        "couponTitle": "19% Off Your Order",
        "couponDescription": "Shop and receive 19% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "HALLOWEEN",
        "couponTitle": "PhotoBook UK Promo Code: Up to 70% Off Your Purchase",
        "couponDescription": "Receive up to 70% off select Halloween items when you apply this coupon code at checkout."
    },
    {
        "couponCode": "BESTSELLER",
        "couponTitle": "Take 55% Off Your Order",
        "couponDescription": "Get up to 55% off select best sellers at Photo Book UK."
    },
    {
        "couponCode": "MYDECOR",
        "couponTitle": "PhotoBook UK Coupon: 55% Off Your Order",
        "couponDescription": "Save 55% on canvas prints and calendars with this PhotoBook UK code."
    },
    {
        "couponCode": "MIDYEARBOOK",
        "couponTitle": "Photo Book UK Coupon: 60% Off Your Order",
        "couponDescription": "Take up to 60% off your Photo Book UK purchase with this code."
    },
    {
        "couponCode": "XTRAPAGES",
        "couponTitle": "PhotoBook UK Coupon: 60% Off Your Order",
        "couponDescription": "Save 60% on select products at PhotoBook UK"
    }
]