[
    {
        "couponCode": "GIFTS4YOU",
        "couponTitle": "Save 20% Off Sitewide",
        "couponDescription": "Save 20% off on All Orders"
    },
    {
        "couponCode": "FaLL23",
        "couponTitle": "BeltOutlet Discount Code: Extra 15% Off Your Purchase",
        "couponDescription": "Enjoy an additional 15% off your order when this coupon code is applied."
    },
    {
        "couponCode": "HAPPY26",
        "couponTitle": "Enjoy 26% Discount on All Orders",
        "couponDescription": "Get ready to party with BeltOutlet.com as we commemorate the 26th Anniversary. We're giving you a whopping 26% off coupon code on all orders, so it's the perfect time to stock up on your favorite belts and accessories. Don't miss out on this amazing deal."
    },
    {
        "couponCode": "GIFTS4DAD",
        "couponTitle": "Get 20% Off Men's Accessories with Promo Code",
        "couponDescription": "Get a 20% discount on men's accessories. Enter this coupon code at checkout."
    },
    {
        "couponCode": "BLACK20",
        "couponTitle": "BeltOutlet Coupon: 20% Off Your Any Purchase",
        "couponDescription": "When this promotional code is applied at checkout, you can take 20% off all your orders."
    },
    {
        "couponCode": "OVERSTOCK",
        "couponTitle": "BeltOutlet Promo Code: 20% Off Overstock",
        "couponDescription": "Use this BeltOutlet coupon code at checkout to apply 20% off your orders of already discounted inventory of family essentials."
    },
    {
        "couponCode": "CW20",
        "couponTitle": "Belt Outlet Coupon: 20% Off Your Order",
        "couponDescription": "Take 20% off clearance items at Belt Outlet."
    },
    {
        "couponCode": "GIFT25",
        "couponTitle": "Extra 25% Off All Orders With Coupon Until 12/27",
        "couponDescription": "now through 12/27, take an extra 25% off all orders when you enter coupon code at checkout"
    },
    {
        "couponCode": "CYBER23",
        "couponTitle": "BeltOutlet Coupon: 23% Off Your Order",
        "couponDescription": "Enjoy a special 23% off your purchase at beltoutlet.com with this sitewide discount code. Whether you're shopping for belts, wallets, or other accessories, apply this code to save on your entire order. It's a great way to update your wardrobe while saving some money."
    },
    {
        "couponCode": "HOPTOIT15",
        "couponTitle": "Get 15% Off Your Order",
        "couponDescription": "Save 15% on your entire order with this Belt Outlet code."
    },
    {
        "couponCode": "MOM20",
        "couponTitle": "Get Extra 20% Off Women's Accessories with Promo Code",
        "couponDescription": "Use this coupon code at checkout and get an extra 20% discount on your order. Valid on women's accessories."
    },
    {
        "couponCode": "LABORDAY24",
        "couponTitle": "Save 15% Off Sitewide",
        "couponDescription": "Enjoy 15% off your entire purchase this labor day sale at Belt Outlet."
    },
    {
        "couponCode": "XMAS20",
        "couponTitle": "Get 20% Off All Purchases With Beltoutlet Code",
        "couponDescription": "Shop and receive 20% off All Orders with BeltOutlet's promo code on your cart."
    },
    {
        "couponCode": "MONDAY23",
        "couponTitle": "BeltOutlet Coupon: 30% Off Your Purchase ",
        "couponDescription": "Snag an amazing 30% off on all orders during the Cyber Monday Sale at beltoutlet.com. Use this coupon code and stock up on your favorite styles."
    },
    {
        "couponCode": "THANKSGIVING",
        "couponTitle": "Save 25% Off",
        "couponDescription": "get 25% off your purchases using the promo code at checkout."
    },
    {
        "couponCode": "STYLE17",
        "couponTitle": "Save 17% Off using Coupon Code",
        "couponDescription": "Take an extra 17% off on hats, bags and scarves orders at beltoutlet.com."
    },
    {
        "couponCode": "STOCKING20",
        "couponTitle": "20% Off Stocking Stuffers At BeltOutlet",
        "couponDescription": "Apply this BeltOutlet coupon code at checkout to claim 20% off your orders of stocking stuffers."
    },
    {
        "couponCode": "TRENDY17",
        "couponTitle": "Take 17% Off Your Order",
        "couponDescription": "Save 17% on belts, suspenders and wallets during early black friday sale at Belt Outlet."
    },
    {
        "couponCode": "FRIDAY2024",
        "couponTitle": "BeltOutlet Coupon: 30% Off Your Order",
        "couponDescription": "Get ready for the ultimate shopping spree with this Black Friday Sale. Enjoy 30% off on all orders when you use the coupon code at beltoutlet.com."
    },
    {
        "couponCode": "COZY17",
        "couponTitle": "Take 17% Off Sleepwear, Slippers, Socks, and Underwear ",
        "couponDescription": "Enjoy shopping during Labor Day Sale and get a 17% discount on sleepwear, slippers, socks, and underwear. Enter this coupon code at checkout."
    }
]