[
    {
        "couponCode": "BYEBYE",
        "couponTitle": "Save 40% Off",
        "couponDescription": "Save up to 40% off for single-night stays and up to 50% off for multi-night stays at greatwolf.com."
    },
    {
        "couponCode": "AARP",
        "couponTitle": "Up to 20% Off Sitewide",
        "couponDescription": "Take advantage of this 20% off discount code on Water Park bookings at Great Wolf Lodge when you purchase online today. With this special offer, you can experience all the fun and excitement of a water park vacation without breaking the bank. It is the perfect time to save money and make memories at Great Wolf Lodge."
    },
    {
        "couponCode": "WPBUNDLE",
        "couponTitle": "Great Wolf Lodge Coupon: 15% Off Your Purchase",
        "couponDescription": "Save 15% on Great Wolf Lodge day passes with this exclusive coupon. Dive into family fun with thrilling water attractions and exciting activities. Book now for discounted aquatic adventures."
    },
    {
        "couponCode": "WPHEROES",
        "couponTitle": "Get Up to 15% Off Your Purchase",
        "couponDescription": "Take up to an extra 15% off for first responders with this Great Wolf Lodge discount code."
    },
    {
        "couponCode": "HEROES",
        "couponTitle": "great wolf lodge, a 55,000 sqft water park fun for kids & parents. use coupon code for",
        "couponDescription": null
    },
    {
        "couponCode": "BIGFALL",
        "couponTitle": "Save 30% Off Using Code",
        "couponDescription": "Enjoy up to 30% off Standard Suites or up to 40% off Themed and Premium Suites at greatwolf.com."
    },
    {
        "couponCode": "GETAWAY1",
        "couponTitle": "Save 40% Off w/ Discount Code",
        "couponDescription": "Save up to 40% on your booking by using this great Great Wolf code."
    },
    {
        "couponCode": "MOREFUN",
        "couponTitle": "Save 20% Off using Coupon Code",
        "couponDescription": "Save 20% on our best available rates for two or more night stays"
    },
    {
        "couponCode": "ALLONE",
        "couponTitle": "$250 Off At Checkout",
        "couponDescription": "Get an awesome deal on a family getaway. Greatwolf.com is offering $250 off on All In One Package. Book for an unforgettable vacation at one of their many indoor water park resorts."
    },
    {
        "couponCode": "TRIPLEFUN",
        "couponTitle": "40% Off Your Water Park Experience",
        "couponDescription": "Check out this amazing promo code for 40% off at Great Wolf Lodge. This is a great opportunity to save big on your stay at the largest family indoor water park."
    },
    {
        "couponCode": "AAA",
        "couponTitle": "25% Off Sitewide",
        "couponDescription": "Save big with a 25% off promo code for Great Wolf Lodge. With so many exciting activities and attractions, now is the perfect time to plan an unforgettable family vacation. Don't miss out on this amazing opportunity to treat your family to a magical experience while saving money."
    },
    {
        "couponCode": "WELCOME",
        "couponTitle": "Get 30% Discount Using Promotional Code",
        "couponDescription": "Score 30% off with coupon code"
    },
    {
        "couponCode": "BPOWER",
        "couponTitle": "Great Wolf Lodge Coupon: Take 30% Off Any Purchase",
        "couponDescription": "With a promo code from Great Wolf Lodge, you may get 30% off of the subscription to Chicago Gurnee Il Water Park Fun."
    },
    {
        "couponCode": "HEROESA",
        "couponTitle": "Great Wolf Lodge Coupon: Up to 25% Off Your Stay (Military/EMS/Fire/Doctors/Nurses/Police)",
        "couponDescription": "Score up to 25% off on your stay at greatwolf.com with the thrilling \"Calling All Heroes\" deal. It's the perfect opportunity for savvy online discount shoppers like you to book now and save big. Don't miss this chance to transform your trip into an epic adventure while enjoying fantastic savings."
    },
    {
        "couponCode": "VOYAGERS",
        "couponTitle": "Take 30% Off Your Order",
        "couponDescription": "Save up to 30% on when you join the voyagers club at Great Wolf.."
    },
    {
        "couponCode": "BENEFITHUB",
        "couponTitle": "Take Extra 40% Off Your Purchase",
        "couponDescription": "Grab an extra 40% discount on your order. Enter this promo code at checkout."
    },
    {
        "couponCode": "MOREFUNA",
        "couponTitle": "Great Wolf Lodge Coupon: 30% Off on Stays of Two Nights or More",
        "couponDescription": "Experience substantial savings of 30% off your total lodging cost when you book a stay for two or more nights at Great Wolf Lodge. Unlock this coupon code and save \non your next Great Wolf Lodge booking."
    },
    {
        "couponCode": "RAKEANDSAVE",
        "couponTitle": "Save 40% Off Sitewide",
        "couponDescription": "Use this promo code to save up to 40% 1 night stay or 50% 2+ night stay sitewide."
    },
    {
        "couponCode": "FAMILY",
        "couponTitle": "Great Wolf Lodge Sale: Water Park Stays Starting at $26 Per Person",
        "couponDescription": "Splash into savings at greatwolf.com with their fantastic deals. Starting at a mere $26 per person, you can secure your stay at their exhilarating water park. Get ready to dive into fun and make a splash with these unbeatable prices."
    },
    {
        "couponCode": "48HOUR",
        "couponTitle": "48 Hour Flash Sale: Save Up to 48% on Select Stay Bookings",
        "couponDescription": "Don't miss out on this incredible limited-time offer from greatwolf.com. For 48 hours only, enjoy massive savings of up to 48% off select stay bookings at the fantastic Great Wolf Lodge. With such unbeatable discounts, there's never been a better time to treat yourself and your family to an unforgettable getaway filled with adventure, excitement, and relaxation."
    }
]