[
    {
        "couponCode": "101609",
        "couponTitle": "Dollar Coupon: 10% Off Your Order",
        "couponDescription": "Take 10% off a weekly or weekend car rental at Dollar."
    },
    {
        "couponCode": "101926",
        "couponTitle": "Dollar Rent A Car Discount Code: Get Double Frontier Miles on Your Car Rental",
        "couponDescription": "Apply this discount code at checkout and get double frontier miles on your car rental."
    },
    {
        "couponCode": "DEK30",
        "couponTitle": "Book Now and Save 30%",
        "couponDescription": "Apply this code to get 30% off your next daily, weekly, or weekend rental of premium cars and above. Mid-size SUVs are excluded."
    },
    {
        "couponCode": "101731",
        "couponTitle": "15% Off at Dollar Car Rental",
        "couponDescription": "Enter this coupon code at checkout to save 15% on your reservation."
    },
    {
        "couponCode": "2015",
        "couponTitle": "Take 50% Off Your Booking",
        "couponDescription": "Book through Dollar Car Rental and save 50% when you use this coupon code."
    },
    {
        "couponCode": "100352",
        "couponTitle": "Enjoy Up to 10% Off Your Order",
        "couponDescription": "Enter this Dollar Rent A Car coupon code at checkout to save up to 10% on your purchase."
    },
    {
        "couponCode": "102095",
        "couponTitle": "Dollar Rent A Car Coupon Code: Take 25% Off Rental Reservations ",
        "couponDescription": "Enjoy a 25% discount on rental reservations when you enter this coupon code at checkout."
    },
    {
        "couponCode": "DAGP",
        "couponTitle": "Get Free Day of GPS Rental with Code",
        "couponDescription": "Enjoy a free day of GPS rental when you book with Dollar Rent A Car using this exclusive promo code. Stay on track without extra fees and make your trip stress-free. Enter the code at checkout to claim your free GPS rental day."
    },
    {
        "couponCode": "102035",
        "couponTitle": "Dollar Rent A Car Promo Code: Get 15% Off Your Order ",
        "couponDescription": "Redeem this promo code at checkout and save 15% on your order."
    },
    {
        "couponCode": "102121",
        "couponTitle": "Get Up to 25% Off Base Rate for Car Rentals ",
        "couponDescription": "Paste this promo code at checkout and save up to 25% on the base rate for car rentals."
    },
    {
        "couponCode": "EDSO2",
        "couponTitle": "Dollar Coupon: 15% Off Your Order",
        "couponDescription": "Save 15% on weekly car rentals by adding this Dollar code."
    },
    {
        "couponCode": "101959",
        "couponTitle": "Dollar Rent A Car Promo Code: Extra 10% Off on Base Rate for Rental",
        "couponDescription": "Get an extra 10% discount on the base rate for rental. Paste this promo code at checkout."
    },
    {
        "couponCode": "101608",
        "couponTitle": "Get 35% Off Your Order",
        "couponDescription": "Enjoy up to 35% off pay later base rate booking at Dollar Rent A Car."
    },
    {
        "couponCode": "101604",
        "couponTitle": "Save 10% on Select Bookings",
        "couponDescription": "Book select weekend or weekly rentals and take 10% off your reservation with the use of this code."
    },
    {
        "couponCode": "102033",
        "couponTitle": "Get 15% Off Your Order",
        "couponDescription": "Take extra 15% off spokane airport location at Dollar."
    },
    {
        "couponCode": "102129",
        "couponTitle": "Get 20% Off Your Next Rental Base Rate ",
        "couponDescription": "Paste this promo code at checkout and save 20% on your next rental base rate."
    },
    {
        "couponCode": "101799",
        "couponTitle": "Take 15% Discount at Dollar",
        "couponDescription": "Apply the following code to receive 15% off the base rate."
    },
    {
        "couponCode": "101822",
        "couponTitle": "1 Free Day on Your Weekly Car Rental",
        "couponDescription": null
    },
    {
        "couponCode": "101126",
        "couponTitle": "Up to 10% Off Bookings",
        "couponDescription": "Apply this discount code at checkout to save up to 10% on your Dollar car rental."
    },
    {
        "couponCode": "101789",
        "couponTitle": "Enjoy 20% Savings With Their Promo Code",
        "couponDescription": "Take 20% off with discount code"
    }
]