[
    {
        "couponCode": "ANNIV15",
        "couponTitle": "Save 15% with this Coupon Code",
        "couponDescription": "MyFonts is passing its anniversary savings onto you. Use this coupon code to save 15% on your favorite fonts."
    },
    {
        "couponCode": "WELCOME10",
        "couponTitle": "Take 10% Off Sitewide with Promo Code",
        "couponDescription": "New and existing customers can enjoy a sitewide 10% off with this MyFonts coupon code."
    },
    {
        "couponCode": "JOELMKR50",
        "couponTitle": "MyFonts Promo Code: Get 50% Off Your Order ",
        "couponDescription": "Use this coupon code at checkout to receive a 50% discount on your order."
    },
    {
        "couponCode": "BHMDE30",
        "couponTitle": "Save 30% Off w/ Coupon Code",
        "couponDescription": "Take 30% off when you use this My Fonts discount code."
    },
    {
        "couponCode": "CYBERMONDAY",
        "couponTitle": "Save 15% Off using Coupon Code",
        "couponDescription": "save 15% off monotype fonts subscription, create + deploy plan  use coupon code"
    },
    {
        "couponCode": "MFPG20",
        "couponTitle": "MyFonts Promo Code: 20% Off Fonts",
        "couponDescription": "Enhance your projects with stunning fonts while enjoying significant savings. Get 20% off on 40+ select fonts at MyFonts with this promo code."
    },
    {
        "couponCode": "MDFONTG50",
        "couponTitle": "Save 50% Off",
        "couponDescription": "Score 50% off with discount code"
    },
    {
        "couponCode": "AUKFONTG60",
        "couponTitle": "Save 60% Off w/ Discount Code",
        "couponDescription": "Score 60% off with discount code"
    },
    {
        "couponCode": "THCK25",
        "couponTitle": "25% Off Your Order",
        "couponDescription": "Shop and get 25% off your purchase of Tommy Hilfiger and Calvin Klein using a coupon code on your cart."
    },
    {
        "couponCode": "MYFONTSLT10",
        "couponTitle": "10% Off Select Fonts",
        "couponDescription": "Redeem this MyFonts coupon code for 10% off all Linotype Foundry Fonts for a limited time.  Apply code at checkout."
    },
    {
        "couponCode": "ETEWUT50",
        "couponTitle": "Myfonts Coupon: 50% Off on All Etewut Foundry Fonts",
        "couponDescription": "Get ready to revamp your font collection with a spectacular deal. Myfonts.com is hosting Fontsgiving, a grand sale where all Etewut Foundry Fonts are available at a whopping 50% off. It's time to snag those creative, striking fonts you've been eyeing and bring your design projects to life."
    },
    {
        "couponCode": "BOGOITC",
        "couponTitle": "Get Free Plantin With  Legacy Sans Purchase",
        "couponDescription": "Receive free Plantin when you BUY ITC Legacy Sans items at myfonts."
    },
    {
        "couponCode": "PEGGO50",
        "couponTitle": "Myfonts Coupon: 50% Off Your Order",
        "couponDescription": "Score a massive 50% off on your current typography project with Myfonts.com. This incredible discount code is applicable to a wide range of items, including professional typefaces, creative fonts, and font packages, empowering you to transform your design work."
    },
    {
        "couponCode": "SKNTYP50",
        "couponTitle": "Myfonts Coupon: 50% Off on All Skinny Type Foundry Fonts",
        "couponDescription": "Indulge in their Fontsgiving sale at MyFonts.com, where you can score an incredible 50% off on all fonts from the renowned Skinny Type Foundry. Today is the perfect opportunity to expand your font library and save money."
    },
    {
        "couponCode": "RICH10",
        "couponTitle": "Myfonts Discount Code: 10% Off",
        "couponDescription": "Visit Myfonts and get 10% off orders with this coupon code on your cart at checkout."
    },
    {
        "couponCode": "CAPE50",
        "couponTitle": "Myfonts Coupon: 50% Off Cape Arcona Foundry",
        "couponDescription": "Get ready to revamp your font library with a whopping 50% off on all Cape Arcona Foundry fonts. This Fontsgiving, myfonts.com is bringing you an incredible deal that's just too good to miss. Dive into the vast selection and add some fresh style to your collection today."
    },
    {
        "couponCode": "NICOLAS50",
        "couponTitle": "Myfonts Coupon: 50% Off on All NicolassFonts",
        "couponDescription": "Enjoy a fantastic 50% off on your current purchase at myfonts.com with their exclusive coupon code. From popular typefaces to unique fonts, enhance your designs for half the price. Don't miss out on this amazing savings opportunity."
    },
    {
        "couponCode": "BOGOMT2",
        "couponTitle": "Take $314.99 Off w/ Promo Code",
        "couponDescription": "Take $314.99 off when you add both desktop families by adding this My Fonts code."
    },
    {
        "couponCode": "BOGOHD1",
        "couponTitle": "Get $25 Off On Dual Desktop Families At My Fonts",
        "couponDescription": "Receive $25 off when you add both desktop families at My Fonts."
    },
    {
        "couponCode": "GGFONTG65",
        "couponTitle": "Save 65% on Gleb Guralnyk Fonts",
        "couponDescription": "MyFonts features over 100 font families by Gleb Guralnyk. Enter this coupon code to take 65% off your tab."
    }
]