[
    {
        "couponCode": "LULUSWW",
        "couponTitle": "Lulul's Promo: New Customers Save 20% off ",
        "couponDescription": "20% Off for New Customers. Available to new customers only, you must be a new Lulus.com account holder and logged into your Lulus account at the time of purchase. Valid for orders shipping outside the United States only."
    },
    {
        "couponCode": "NEW2LULUS",
        "couponTitle": "Enjoy 20 Off Your Order",
        "couponDescription": "Take 20% off your first purchase at Lulus. Remember to use this coupon code at checkout."
    },
    {
        "couponCode": "NEWLULUSFAN",
        "couponTitle": "Lulus Discount Code: Extra 20% Off Your Order",
        "couponDescription": "Take an extra 20% off on all your orders when you use this Lulus promo code at checkout."
    },
    {
        "couponCode": "HELLOLULUS",
        "couponTitle": "Get 20% Off Any Order ",
        "couponDescription": "Paste this promo code at checkout and save 20% on any order. Valid for new customers only."
    },
    {
        "couponCode": "DEALS20APP",
        "couponTitle": "Lulus Coupon: Extra 20% Off Your Purchase",
        "couponDescription": "Shop and receive an additional 20% off deals with this promo code for app orders on your cart."
    },
    {
        "couponCode": "DRESSUP",
        "couponTitle": "20% Off Dresses At Lulus",
        "couponDescription": "Use this Lulus discount code at checkout to unlock 20% off your orders in the \"Dresses\" category."
    },
    {
        "couponCode": "FIFTY",
        "couponTitle": "Lulus Promo Code: 20% Off Your Order",
        "couponDescription": "Shop and receive 20% off using this discount code on your purchase at Lulus."
    },
    {
        "couponCode": "PARTYMODE",
        "couponTitle": "Lulus Discount Code: 30% Off Select Dresses",
        "couponDescription": "Enter this Lulus discount code at checkout to unlock 30% off your orders on the Pick Your Party Sale."
    },
    {
        "couponCode": "DEALS20",
        "couponTitle": "Extra 20% Off Your Order",
        "couponDescription": "Get an additional 20% off on select styles at Lulus. Simply enter code at checkout."
    },
    {
        "couponCode": "ALLISONK20",
        "couponTitle": "Lulus Promo Code: 20% Off Your Order",
        "couponDescription": "When this coupon code is applied at checkout, you can take 20% off your qualifying purchase."
    },
    {
        "couponCode": "CARLYL20",
        "couponTitle": "Lulus Discount Code: 20% Off",
        "couponDescription": "Visit Lulus and get 20% off for members with this coupon code on your cart at checkout."
    },
    {
        "couponCode": "WORLDWIDE",
        "couponTitle": "Free International Shipping w/ Purchase $150+ at Lulus Using Code",
        "couponDescription": "Shop at lulus.com and enjoy free shipping worldwide when you purchase $150 and up. Use this code at checkout to avail this promo."
    },
    {
        "couponCode": "GET15APP",
        "couponTitle": "Lulus Coupon Code: 15% Off Your First Order",
        "couponDescription": "Redeem 15% off on your total purchase, simply install the Lulus mobile app and input the provided Lulus coupon code during the checkout process."
    },
    {
        "couponCode": "PARTYAPP",
        "couponTitle": "Take 20% Off Your Order",
        "couponDescription": "Save 20% on cocktail and day party dresses in app with this Lulus code."
    },
    {
        "couponCode": "COCKTAILapp",
        "couponTitle": "Take 20% Off Your Order",
        "couponDescription": "Enjoy 20% off cocktail dresses with this Lulus code."
    },
    {
        "couponCode": "partyblushjumper4643cs",
        "couponTitle": "Lulus Coupon: 30% Off Your Order",
        "couponDescription": "Take 30% off when you use this Lulus code."
    },
    {
        "couponCode": "JUMP25APP",
        "couponTitle": "Up to 25% Off Rompers & Jumpsuits",
        "couponDescription": "Explore a wide range of stylish rompers, jumpsuits, and more through the app, all at great deals. Apply this exclusive Lulus discount code for up to 25% off your purchase."
    },
    {
        "couponCode": "CASUALapp",
        "couponTitle": "Lulus Coupon Code: Save 20% on Your Order",
        "couponDescription": "Save big on casual clothing at Lulus with this coupon code. Get 20% off stylish everyday wear today. Copy and paste this code at checkout to redeem the discount. Don't miss out."
    },
    {
        "couponCode": "SAVE",
        "couponTitle": "20% Off Your Order",
        "couponDescription": "Get 20% off your purchase sitewide using a promo code on your cart."
    },
    {
        "couponCode": "idealjumper7473sg",
        "couponTitle": "Lulus Coupon Code: 15% Off Your Order",
        "couponDescription": "Shop at Lulus and receive 15% off your purchase using a coupon code"
    }
]