[
    {
        "couponCode": "RELAX",
        "couponTitle": "take a break from the summer heat with a self-care trio, yours free when you spend $60. use coupon code at checkout. set includes: hello, calm mask 15 ml, eye mask, and feel good candle. offer is valid through 8/28 or while supplies last",
        "couponDescription": null
    },
    {
        "couponCode": "JOY",
        "couponTitle": "Origins Coupon: Free Items on Your Purchase",
        "couponDescription": "Don't forget to apply this discount code to receive a free 5-piece ginger bath and body set when you spend $90 at checkout."
    },
    {
        "couponCode": "DAY9",
        "couponTitle": "Enjoy Free full-size Ginger Souffle when you spend $90 orders at origins.com.",
        "couponDescription": null
    },
    {
        "couponCode": "APPLE",
        "couponTitle": "Free Item on Your Order",
        "couponDescription": "Take a free item on your purchase worth $90 using a promo code on your cart."
    },
    {
        "couponCode": "CHECKS",
        "couponTitle": "enjoy our best-selling checks and balances cleanser (15 ml) - yours free with any $30 purchase! use coupon code at checkout. valid 9/25-10/31",
        "couponDescription": null
    },
    {
        "couponCode": "MASKS",
        "couponTitle": "Free masks & facial brush w/ $45 order",
        "couponDescription": null
    },
    {
        "couponCode": "GIFT",
        "couponTitle": "Free Recycled Tote + Travel Size Checks and Balances Cleanser When You Spend $65",
        "couponDescription": null
    },
    {
        "couponCode": "SURPRISE",
        "couponTitle": "FREE MYSTERY GIFT with $35 purchase",
        "couponDescription": null
    },
    {
        "couponCode": "BESTS",
        "couponTitle": "Use Code For Free Gift On $100+ Orders",
        "couponDescription": "Apply this code at checkout and get free gift on orders over $100."
    },
    {
        "couponCode": "TREAT25",
        "couponTitle": "Save 25% Off w/ Coupon Code",
        "couponDescription": "Apply this Origins discount code at checkout to get 25% off on $110 or more total purchases."
    },
    {
        "couponCode": "DAY10",
        "couponTitle": "Origins Coupon: 25% Off Your Order or Choose Previous Deals",
        "couponDescription": "Catch the final day of Origins 10 Days 10 Deals Event and enjoy a whopping 25% off sitewide using the promo code. You can also choose to redeem any of their previous offers. This fantastic offer is valid until 6 am ET on 12/15. Don't miss out on this amazing opportunity to save big while shopping for your favorite Origins products."
    },
    {
        "couponCode": "FAMILY",
        "couponTitle": "Origins Coupon: Get 20% Off Any Order, or 25% Off on Orders $125+",
        "couponDescription": "Get ready for a shopping spree at Origins.com. For one day only, you have an exclusive early access to the Origins Friends & Family event. The entire site is on sale with a 20% discount, and if your order exceeds $125, you'll get an even bigger discount of 25%.Hurry up as this offer is only valid until 6 am ET on 9/17."
    },
    {
        "couponCode": "DAY8",
        "couponTitle": "Buy a Mega-Mushroom Treatment Lotion Get a Mega-Mushroom Treatment Lotion at origins.com.",
        "couponDescription": null
    },
    {
        "couponCode": "CREAM",
        "couponTitle": "Get Free Rejuvenating Hand Treatment on Orders $150+ ",
        "couponDescription": "Paste this promo code at checkout and get free rejuvenating hand treatment on orders of $150 or more. Valid for members only."
    },
    {
        "couponCode": "SERUM",
        "couponTitle": "Get Free Full Size Ginzing Serum on Orders $75+ ",
        "couponDescription": "Enjoy shopping and get free full size ginzing serum on orders of $75 or more. Enter this coupon code at checkout."
    },
    {
        "couponCode": "CLEAN",
        "couponTitle": "Get Free Gift Purchase Of $80+",
        "couponDescription": "Receive free gift when you spend $80 and more at Origins."
    },
    {
        "couponCode": "DAY7",
        "couponTitle": "Save 30% Off w/ Coupon Code",
        "couponDescription": "enjoy 30% off your gift sets with the promo code at checkout."
    },
    {
        "couponCode": "2DAY",
        "couponTitle": "Free Shipping when Spending $50+ w/ Discount Code",
        "couponDescription": "Free 2-Day Shipping Upgrade When You Spend $50"
    },
    {
        "couponCode": "HOLIDAY",
        "couponTitle": "Origins Coupon: 25% Off Your Order ",
        "couponDescription": "Enjoy 25% off sitewide at Origins with this promo code. It's the perfect time to shop and stock up on your favorite products."
    }
]