[
    {
        "couponCode": "cookies",
        "couponTitle": "Ashley Furniture Promo Code: 5% Off Your Order",
        "couponDescription": "Shop and take 5% off your purchase using a discount code on your cart."
    },
    {
        "couponCode": "FAST15",
        "couponTitle": "Ashley Furniture Discount Code: Extra 15% Off Your Purchase",
        "couponDescription": "Ashley Furniture is offering an additional 15% off on your order along with free shipping when you enter this code at checkout."
    },
    {
        "couponCode": "LASTCHANCE",
        "couponTitle": "Ashley Furniture Coupon: Extra 10% Off Your Order",
        "couponDescription": "Receive an additional 10% off your Ashley Furniture purchase when you apply this coupon code at checkout."
    },
    {
        "couponCode": "P1LKHAAMP9",
        "couponTitle": "Ashley Furniture Coupon Code: $50 Off All Orders",
        "couponDescription": "Use this Ashley Furniture promo code to receive $50 off orders over $100."
    },
    {
        "couponCode": "HOLIDAY10",
        "couponTitle": "Up to 10% Off Any Order Sitewide",
        "couponDescription": "Score up to 10% off on furniture using this Ashley Furniture coupon code at checkout."
    },
    {
        "couponCode": "PRESDAY10",
        "couponTitle": "Save 10% Off w/ Discount Code",
        "couponDescription": "Take 10% off accent chairs, cabinets, tables  by using this Ashley Furniture code."
    },
    {
        "couponCode": "POPUP10",
        "couponTitle": "Ashley Discount Code: Up to 10% Off Your Order",
        "couponDescription": "Receive up to 10% off on your Ashley Furniture purchases when this discount code is used at checkout."
    },
    {
        "couponCode": "BARSTOOL",
        "couponTitle": "Ashley Furniture Coupon: $100 Off Your Order",
        "couponDescription": "Use this coupon code to receive $100 off store-wide on orders of $1,000 or more at Ashley Furniture."
    },
    {
        "couponCode": "LDDEAL",
        "couponTitle": "Ashley Coupon Code: Clearance Up to 50% Off + Extra 10% Off",
        "couponDescription": "Visit Ashley Furniture for clearance items up to 50% off, plus an additional 10% off with this coupon code at checkout."
    },
    {
        "couponCode": "P1LKHN5PW0",
        "couponTitle": "Ashley Furniture Promo Code: Get $50 Off Your Order",
        "couponDescription": "Redeem this promo code at checkout and save $50 when you spend over $999."
    },
    {
        "couponCode": "TPAWFF1",
        "couponTitle": "Ashley Discount Code: Up to 30% Off Any Purchase ",
        "couponDescription": "Enjoy up to a 30% discount on any purchase when you apply this Ashley Furniture coupon code at checkout."
    },
    {
        "couponCode": "RUGS15",
        "couponTitle": "Extra 15% Off Washable Rugs with Ashley Furniture Code",
        "couponDescription": "Redeem this promo code at checkout and enjoy an extra 15% discount on washable rugs at Ashley Furniture."
    },
    {
        "couponCode": "BRIDAL",
        "couponTitle": "Take $100 Off Your Order",
        "couponDescription": "Use this coupon code at checkout and get $100 off your order at Ashley Furniture."
    },
    {
        "couponCode": "SAVE20",
        "couponTitle": "Save 20% with Ashley Furniture Promo Code",
        "couponDescription": "Get 20% off on accessories $999.99+ at Ashley Furniture. Use this code at checkout to receive discount."
    },
    {
        "couponCode": "Ashley",
        "couponTitle": "Ashley Promo Code: Get Up to 66% Off Your Order",
        "couponDescription": "update your home decor for less and enjoy up to 66% off a wide range of products using this  furniture promo code."
    },
    {
        "couponCode": "VETSDAY",
        "couponTitle": "Save 10% Off Clearance",
        "couponDescription": "Take an extra 10% off on Clearance items at ashleyfurniture.com."
    },
    {
        "couponCode": "A7KRXDYFP2",
        "couponTitle": "Ashley Furniture Promo Code: 50% Off",
        "couponDescription": "Receive 50% off your storewide purchase with this discount code at Ashley Furniture."
    },
    {
        "couponCode": "A7KRXXLADA",
        "couponTitle": "Ashley Furniture Discount Code: Enjoy $60 Off Your Order",
        "couponDescription": "Get $60 off your order at Ashley Furniture with this discount code. Save on stylish furniture and home decor today. Don't miss out on this limited-time offer."
    },
    {
        "couponCode": "THANKS",
        "couponTitle": "Ashley Furniture Coupon: 15% Off Your Order",
        "couponDescription": "Get ready to refresh your home with Ashley Furniture's latest deal. Enjoy a fabulous 15% off on their wide range of high-quality, stylish furniture and home decor accessories with this promo code. Known for its timeless appeal and exceptional durability, Ashley Furniture has a wide selection of affordable pieces to choose from."
    },
    {
        "couponCode": "HNYBEST10",
        "couponTitle": "Ashley Furniture Coupon Code: Extra 25% Off Any Purchase",
        "couponDescription": "Get an extra 25% off on any items at Ashley Furniture when you apply this code at checkout."
    }
]