[
    {
        "couponCode": "BALANCE5",
        "couponTitle": "eBay UK Discount Code: Save 5% on Select Items",
        "couponDescription": "Save 5% on select items at eBay UK with this discount code. Shop now and enjoy savings on your favorite products. Don't miss out on this limited-time offer."
    },
    {
        "couponCode": "WINTERSALE10",
        "couponTitle": "Take 10% Off Your Order",
        "couponDescription": "Save at EBay UK by getting 10% on your purchase."
    },
    {
        "couponCode": "TREAT8",
        "couponTitle": "eBay Discount Code: Up to 10% Off Your Order",
        "couponDescription": "When this eBay voucher code is applied, you can save up to 10% on your eligible purchase."
    },
    {
        "couponCode": "PREWORNXMAS50",
        "couponTitle": "Take 50% Off Your eBay Purchase ",
        "couponDescription": "Enjoy shopping and get a 50% discount on any purchase when you enter this eBay coupon code at checkout."
    },
    {
        "couponCode": "JNQ424GHVT2TX4D4",
        "couponTitle": "eBay Promo Code: 10% Off Your Purchase",
        "couponDescription": "Apply 10% off at checkout when you purchase using this eBay discount code on you cart."
    },
    {
        "couponCode": "SIZZLE15",
        "couponTitle": "eBay Discount Code: Save 15% Off",
        "couponDescription": "Apply this eBay coupon code to save 15% off on selected sellers with a max discount of £75."
    },
    {
        "couponCode": "Jingle15",
        "couponTitle": "eBay Coupon: Save 15% on Your Order",
        "couponDescription": "Save 15% on your order at eBay UK with this discount code. Enjoy great deals on a wide range of products."
    },
    {
        "couponCode": "PAPERWH5OFF",
        "couponTitle": "Score 5% Off Your Purchase Instantl",
        "couponDescription": "Use this eBay.co.uk voucher code at checkout to receive 5% off your eligible order."
    },
    {
        "couponCode": "CHILLY5",
        "couponTitle": "eBay Promo Code: Take 5% Off Your Purchase",
        "couponDescription": "Apply this eBay promo code at checkout to save 5% on your next purchase. Whether you're shopping for fashion, electronics, or home goods, this offer gives you extra savings."
    },
    {
        "couponCode": "FLASH5",
        "couponTitle": "eBay Promo Code: Save 5% on Any Purchase ",
        "couponDescription": "Shop at eBay UK and enjoy a 5% discount on any purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "AJB10OFF",
        "couponTitle": "eBay Discount Code: Save 10% on Your Purchase",
        "couponDescription": "Get 10% off you purchases with eBay UK's promo code on your cart at checkout."
    },
    {
        "couponCode": "SPROUT10",
        "couponTitle": "eBay Voucher Code: 10% Off Your Order",
        "couponDescription": "Shop with select sellers on eBay UK this spring and save an extra 10% off on your purchase using this eBay code at checkout. Minimum purchase required is £9.99. Max discount £75. Terms apply."
    },
    {
        "couponCode": "slay5",
        "couponTitle": "Up to 65% off Refurbished Mobiles + Extra 5% Off ",
        "couponDescription": "Save up to 65% on refurbished mobiles and get an additional 5% off with this eBay coupon code."
    },
    {
        "couponCode": "FROSTY8",
        "couponTitle": "Get 8% Off Your Order at eBay",
        "couponDescription": "Get an 8% discount on your purchase. Use this eBay coupon code at checkout."
    },
    {
        "couponCode": "FRESH20",
        "couponTitle": "Take 20% Off Any Seller",
        "couponDescription": "Enjoy shopping and get a 20% discount on any seller when you enter this coupon code at checkout."
    },
    {
        "couponCode": "FESTIVEFUN",
        "couponTitle": "eBay Discount Code: Take 10% Off Your Order",
        "couponDescription": "Get up to 10% off on select items when this eBay coupon code is applied to your cart at checkout."
    },
    {
        "couponCode": "JOLLY20",
        "couponTitle": "Save 20% on Your Purchase with eBay Coupon",
        "couponDescription": "Score 20% off your select order by applying this eBay voucher code at checkout."
    },
    {
        "couponCode": "QUICK8",
        "couponTitle": "Take 8% Off Your eBay Purchase",
        "couponDescription": "Use this eBay discount code at checkout to save 8% on select items."
    },
    {
        "couponCode": "CRISPY5",
        "couponTitle": "eBay Coupon Code: 5% Off Your Order",
        "couponDescription": "Use this eBay discount code at checkout to receive 5% off on your purchase."
    },
    {
        "couponCode": "DRESSUP20",
        "couponTitle": "Get 20% Off Your Purchase with eBay Coupon",
        "couponDescription": "Score 20% off select styles when this eBay voucher code is applied at checkout."
    }
]