[
    {
        "couponCode": "MONITOR",
        "couponTitle": "15% Off on Top-Selling Computer Monitors",
        "couponDescription": "Save 15% off on top selling computer monitors when using this Samsung promo code at checkout."
    },
    {
        "couponCode": "MANSION20",
        "couponTitle": "Get Up to 20% Off Any Order",
        "couponDescription": "Paste this promo code at checkout and save up to 20% on any order."
    },
    {
        "couponCode": "HOLAAWIN10",
        "couponTitle": "Samsung Coupon Code: 10% Off Your Order",
        "couponDescription": "Uncover amazing deals by using this Samsung promo code at checkout to save 10% off your order."
    },
    {
        "couponCode": "DTOEXTRA",
        "couponTitle": "Samsung Promo Code: Get 5% Off Any Order ",
        "couponDescription": "Redeem this promo code at checkout and save 5% on any order."
    },
    {
        "couponCode": "SAVETEN",
        "couponTitle": "Samsung Promo Code: 10% Off Your Order",
        "couponDescription": "Shop and get 10% off your purchase using a coupon code on your cart."
    },
    {
        "couponCode": "EXTRAWEAR10",
        "couponTitle": "Samsung Coupon: Extra 10% Off on Galaxy Watch5 Pro Bluetooth",
        "couponDescription": "Take advantage of an extra 10% off on the Galaxy Watch5 Pro Bluetooth at Samsung.com. This sleek, high-tech smartwatch can be yours for less today."
    },
    {
        "couponCode": "GALAXY4U",
        "couponTitle": "Samsung Promo Code: 15% Off Your Order",
        "couponDescription": "This Samsung discount code gets you 15% off on their bestselling mobile phones at samsung.com."
    },
    {
        "couponCode": "ref-qx5dca",
        "couponTitle": "Samsung Coupon: 5% Off",
        "couponDescription": "Enjoy 5% off eligible items on your cart using Samsung's promo code at checkout."
    },
    {
        "couponCode": "EDGE",
        "couponTitle": "Samsung Coupon Code: Enjoy £200 Off Select Product",
        "couponDescription": "Save £200 on the Galaxy Book4 Edge with this Samsung coupon code. Upgrade your tech with this powerful laptop at a fantastic discount."
    },
    {
        "couponCode": "360BOOK",
        "couponTitle": "Samsung Coupon Code: Take £200 Off Select Item",
        "couponDescription": "With this Samsung coupon code, you can save £200 on the Galaxy Book4 360. Experience sleek design, powerful performance, and versatility for less. Grab this deal before it's gone."
    },
    {
        "couponCode": "BOOK2",
        "couponTitle": "Get £650 Off Galaxy Book2 Pro 360 and Book2 Pro",
        "couponDescription": "Paste this promo code at checkout and save £650 on Galaxy book2 pro 360 and book2 pro."
    },
    {
        "couponCode": "SD15",
        "couponTitle": "Samsung Coupon: Up to 15% Off Your Favorite Samsung Products ",
        "couponDescription": "Unlock 15% off on your favorite Samsung products when you use this discount code at samsung.com."
    },
    {
        "couponCode": "IT_5",
        "couponTitle": "Samsung Coupon: 5% Off Monitors & Laptops ",
        "couponDescription": "Snag yourself a deal with 5% off on your purchase of monitors and laptops at samsung.com. Also shop their variety of Samsung goodies, including the latest Galaxy smartphones, QLED TVs, washing machines, refrigerators and even tablets."
    },
    {
        "couponCode": "HOLIDAYSIT15",
        "couponTitle": "Samsung Coupon: 15% Off Monitors and Laptops",
        "couponDescription": "Enjoy 15% off your current purchase of monitors or laptops on samsung.com. Don't forget to shop for the latest Galaxy smartphone, QLED TV, or innovative home appliances like the Family Hub refrigerator."
    },
    {
        "couponCode": "WEBGSG5",
        "couponTitle": "Samsung Coupon: 5% Off Your Order",
        "couponDescription": "Enjoy extra 5% off your purchase with this Samsung promo code."
    },
    {
        "couponCode": "TABS9FE",
        "couponTitle": "Samsung Promo Code: £80 Off Your Order",
        "couponDescription": "Shop and take £80 off your purchase using a discount code on your cart."
    },
    {
        "couponCode": "ref-m33p7z",
        "couponTitle": "Save 5% on Any Item ",
        "couponDescription": "Shop at Samsung and get a 5% discount on any item. Apply this discount code at checkout."
    },
    {
        "couponCode": "SAM07",
        "couponTitle": "Samsung Offer: $500 Off Your Cart",
        "couponDescription": "Enjoy $500 off your cart using this promo code on your purchase at Samsung."
    },
    {
        "couponCode": "ref-gagyzg",
        "couponTitle": "Samsung Coupon: 5% Off Your Order",
        "couponDescription": "Take 5% off your Samsung purchase with this code."
    },
    {
        "couponCode": "ref-mlpr3j",
        "couponTitle": "Samsung Discount Code: Receive 5% Off Select Items",
        "couponDescription": "Get 5% off select Samsung products with this discount code. Shop now to enjoy savings on your favorite devices. This is a limited-time offer, so dont miss out."
    }
]