[
    {
        "couponCode": "SERVICE15",
        "couponTitle": "Get 15% Off Your Next Order",
        "couponDescription": "With this code you can take up to 15% off your next purchase of eligible e-liquids, salts, disposable devices, and more."
    },
    {
        "couponCode": "FREESHIPPING",
        "couponTitle": "Free Shipping Sitewide",
        "couponDescription": "Apply this code at checkout to redeem free shipping for all orders of $99 or more."
    },
    {
        "couponCode": "COMEBACK10",
        "couponTitle": "10% Off with Flawless Vape Shop",
        "couponDescription": "Use this promotional code to redeem an extra 10% discount on select liquids, hardware, disposables, and more."
    },
    {
        "couponCode": "FVS15",
        "couponTitle": "15% Extra Savings at Flawless Vape Shop",
        "couponDescription": "With this code you can save up to an additional 15% on your purchase of vaping supplies and hardware at checkout."
    },
    {
        "couponCode": "FLAWLESSFIRST",
        "couponTitle": "10% Savings on E-Liquids",
        "couponDescription": "Get up to 10% off your order of e-liquids and more by applying this coupon at checkout."
    },
    {
        "couponCode": "DEWDROP",
        "couponTitle": "Flawless Vape Shop Discount Code: Get Free Gift on Salt Nicotine",
        "couponDescription": "Shop at Flawless Vape Shop and get a free gift when you purchase salt nicotine. Apply this discount code at checkout."
    },
    {
        "couponCode": "PNPDEAL",
        "couponTitle": "Save Up to 10% on VOOPOO PnP Coils",
        "couponDescription": "Shop at Flawless Vape Shop and get up to a 10% discount on VOOPOO PnP coils. Apply this discount code at checkout."
    },
    {
        "couponCode": "REDDIT15",
        "couponTitle": "15% Off Vape Starter Kit",
        "couponDescription": "Use this code to gain a 15% discount on the purchase of a Wismec Active Bluetooth Speaker Vape Starter Kit."
    },
    {
        "couponCode": "XROS4",
        "couponTitle": "Flawless Vape Shop Discount Code: Save 4% on Vaporesso XROS 4 Kit Pod System",
        "couponDescription": "Shop at Flawless Vape Shop and enjoy a 4% discount on Vaporesso XROS 4 kit pod system. Apply this discount code at checkout."
    },
    {
        "couponCode": "LP1DEAL",
        "couponTitle": "Flawless Vape Shop Promo Code Get Up to 10% Off SMOK LP1 Coils",
        "couponDescription": "Redeem this promo code at checkout and save up to 10% on SMOK LP1 coils."
    },
    {
        "couponCode": "thanks10",
        "couponTitle": "E-Liquid for Only $3.60",
        "couponDescription": "Use this promo to get the 100mL Mystery E-Liquid Bottle for just $3.60."
    },
    {
        "couponCode": "DC25DISCOUNT",
        "couponTitle": "Take Up To 25% Off Your Order",
        "couponDescription": "Save at Flawless Vape Shop by getting up to 25% on your purchase."
    },
    {
        "couponCode": "CBA3S",
        "couponTitle": "Flawless Vape Shop Discount Code: Save Up to 10% on Uwell Caliburn A3S Kit Features a 520 mAh Battery and 16W Output Power",
        "couponDescription": "Shop at Flawless Vape Shop and enjoy up to a 10% discount on uwell caliburn A3S kit features a 520 mAh battery and 16W output power. Apply this discount code at checkout."
    },
    {
        "couponCode": "BF20",
        "couponTitle": "Save 20% Off using Coupon Code",
        "couponDescription": "Get an Additional 20% Off on Hardware with Promo Code"
    },
    {
        "couponCode": "SKNV4",
        "couponTitle": "Get 4% Off Your Purchase",
        "couponDescription": "Save at Flawless Vape Shop by getting 4% on your order."
    },
    {
        "couponCode": "MTDISCOUNT",
        "couponTitle": "Save Up to 10% on Lost Mary MT15000 Turbo Disposable Vibrant Flavors",
        "couponDescription": "Shop at Flawless Vape Shop and get up to a 10% discount on Lost Mary MT15000 turbo disposable vibrant flavors. Apply this discount code at checkout."
    },
    {
        "couponCode": "OREALLY",
        "couponTitle": "Take Up To 10% Off Your Order",
        "couponDescription": "Enjoy up to 10% off your Flawless Vape Shop purchase with this code."
    },
    {
        "couponCode": "MODISCOUNT",
        "couponTitle": "Get Up To 15% Off Your Order",
        "couponDescription": "Take up to 15% off when you add this Flawless Vape Shop code."
    },
    {
        "couponCode": "HEBCC",
        "couponTitle": "Get Up to 10% Off Happy End Blue Cotton Candy",
        "couponDescription": "Paste this promo code at checkout and save up to 10% on happy end blue cotton candy."
    },
    {
        "couponCode": "FVS20",
        "couponTitle": "Get 20% Off Across Website Using Promo Code",
        "couponDescription": "Take 20% Sitewide with Promo Code"
    }
]