[
    {
        "couponCode": "CFCITY8",
        "couponTitle": "Get 8% Off at Viator | CouponFollow Exclusive",
        "couponDescription": "apply coupon code at check-out to get 8% off your next viator experience when you book your experience in london, mexico city, new york and many more city destinations! \n\ndiscount will only activate if you click through on this link and then apply cfcity8 at check-out. discount only valid mon 23 dec 2024 -sun 5 jan 2025. discount is not valid on the viator app. discount cannot be used in conjunction with any other offers unless stated on this page. selected tours excluded including theme parks."
    },
    {
        "couponCode": "MST10",
        "couponTitle": "Viator Coupon: Up to 10% Off Your Purchase",
        "couponDescription": "Enjoy up to 10% off Vancouver tours on your cart using Viator's promo code at checkout."
    },
    {
        "couponCode": "VICS15EXP",
        "couponTitle": "Extra 15% Off Your Next Order",
        "couponDescription": "Book your travel experience today and receive an additional 15% discount by applying this Viator promo code at checkout."
    },
    {
        "couponCode": "KUCH15",
        "couponTitle": "Viator Promo Code: Get Up to 15% Off Any Order ",
        "couponDescription": "Redeem this promo code at checkout and save up to 15% on any order."
    },
    {
        "couponCode": "DEACVI10",
        "couponTitle": "Viator Coupon: 10% Off Your Booking",
        "couponDescription": "Use this coupon code at Viator.com and score 10% off on your holiday bookings. Get set to explore select destinations at wallet-friendly prices."
    },
    {
        "couponCode": "HGV10",
        "couponTitle": "Save 10% on Any Purchase ",
        "couponDescription": "Shop at Viator and get a 10% discount on any purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "GOTOSEA",
        "couponTitle": "Viator Coupon: 10% Off Your Purchase",
        "couponDescription": "Apply this promo code during checkout to qualify for a 10% discount on your eligible order."
    },
    {
        "couponCode": "COUPON12",
        "couponTitle": "Get 12% Off at Viator | CouponFollow Exclusive",
        "couponDescription": "apply this couponfollow exclusive code and get 12% off when you spend $200 on your next viator adventure.\n\napply coupon code at check-out to get 12% off your next viator experience. discount will only activate when you spend over $200 and if you click through on this link and then apply coupon code at check-out. discount is not valid on the viator app. discount cannot be used in conjunction with any other offers unless stated on this page. selected tours excluded including theme parks."
    },
    {
        "couponCode": "APPFIRST10",
        "couponTitle": "10% Off First 3 App Bookings",
        "couponDescription": "Book through the app and use this Viator promo code to get 10% off your first 3 bookings."
    },
    {
        "couponCode": "BFF15PERK",
        "couponTitle": "Viator Promo Code: Get Up to 15% Off Your Order",
        "couponDescription": "Apply this promo code at checkout for up to a 15% discount on your order."
    },
    {
        "couponCode": "WONDER25",
        "couponTitle": "Save $25 on $100+",
        "couponDescription": "Get $25 off when you spend at least $100 and apply this Viator coupon code at checkout."
    },
    {
        "couponCode": "THANKSTLN10",
        "couponTitle": "Viator Coupon Code: Take 10% Off Any Purchase ",
        "couponDescription": "Enjoy a 10% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "COUPON30",
        "couponTitle": "Get $30 Off | CouponFollow Exclusive",
        "couponDescription": "Apply this coupon code at check-out to get $30 off your next Viator experience when you spend over $265. \n\nDiscount is not valid on the Viator APP. Viator Rewards cannot be earned when using a discount. Discount cannot be used in conjunction with any other offers unless stated on this page. Selected tours excluded including theme parks."
    },
    {
        "couponCode": "VICS5EXP",
        "couponTitle": "Take 5% Off Your Order",
        "couponDescription": "Apply this coupon code at Viator to receive 5% off your order at checkout."
    },
    {
        "couponCode": "PRIMEDAYDEAL",
        "couponTitle": "10% Off Your Order",
        "couponDescription": "Shop and take 10% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "COUPONSAVE8",
        "couponTitle": "Save 8% Off | CouponFollow Exclusive",
        "couponDescription": "Save 8% off everything at Viator with this CouponFollow exclusive code. \n\nDiscount will only activate if you click through on this link and then apply code at check-out. Not valid on the Viator APP. Viator Rewards cannot be earned when using a discount. Discount cannot be used in conjunction with any other offers unless stated on this page."
    },
    {
        "couponCode": "WILD20",
        "couponTitle": "Viator Coupon: 20% Off Your Purchase",
        "couponDescription": "Take 20% off when you spend $200 with this Viator code."
    },
    {
        "couponCode": "LIFEMART10",
        "couponTitle": "Extra 10% Off with Code",
        "couponDescription": "Enter this Viator coupon code at checkout for an additional 10% discount on your order today."
    },
    {
        "couponCode": "CFAUGUST8",
        "couponTitle": "Save 8% Off | CouponFollow Exclusive",
        "couponDescription": "Save 8% off everything at Viator with this CouponFollow exclusive code. \n\nDiscount will only activate if you click through on this link and then apply code at check-out and your tour must be in August 2024. Not valid on the Viator APP. Viator Rewards cannot be earned when using a discount. Discount cannot be used in conjunction with any other offers unless stated on this page."
    },
    {
        "couponCode": "COUPONFOLLOW12",
        "couponTitle": "CouponFollow Exclusive | 12% Off Your Booking at Viator",
        "couponDescription": "Enjoy 12% off on your next adventure when you spend over $250 at Viator and use this exclusive CouponFollow promo code at checkout."
    }
]