[
    {
        "couponCode": "LABOR20",
        "couponTitle": "Get 25% Discount Using Promo Code",
        "couponDescription": "Score 25% off with code"
    },
    {
        "couponCode": "EARLY24",
        "couponTitle": "Take 25% Off Your Order",
        "couponDescription": "Enjoy an extra 25% off when you spend $125 and more at The Met Store."
    },
    {
        "couponCode": "GIFT24",
        "couponTitle": "Save 20% on Select Items Sitewide",
        "couponDescription": "Enjoy a 20% discount on select items sitewide at The Met Store. Use this coupon code during checkout to unlock your savings. Shop now and discover unique art-inspired gifts and products."
    },
    {
        "couponCode": "METSTORE15",
        "couponTitle": "The Met Store Coupon: 15% Off When You Spend $100+",
        "couponDescription": "Indulge your artistic side with 15% off your current purchase at The Met Store, where culture and creativity meet. Whether you're in search of stunning jewelry inspired by ancient designs, exhibition catalogues, or art-inspired apparel and home decor, this discount opens up a world of possibilities."
    },
    {
        "couponCode": "AUTUMN24",
        "couponTitle": "The Met Store Coupon: 20% Off Your Order",
        "couponDescription": "Use this Met Store coupon code and get 20% off your purchase. Save on a wide selection of art-inspired gifts, books, and home decor."
    },
    {
        "couponCode": "FRAME24",
        "couponTitle": "The Met Store Coupon: 25% Off Your Order",
        "couponDescription": "Take 25% off met custom prints at The Met Store."
    },
    {
        "couponCode": "SUMMER24",
        "couponTitle": "20% Off $100+ Orders At The Met Store",
        "couponDescription": "Apply this The Met Store coupon code at checkout to take 20% off your jewelry, clothing AND accessories orders of $100 or more."
    },
    {
        "couponCode": "MEM24",
        "couponTitle": "Get 25% Off Your Order",
        "couponDescription": "Enjoy 25% off your purchase and free shipping when you spend $100 and more at The Met Store."
    },
    {
        "couponCode": "EARLY23",
        "couponTitle": "Take 25% Off Orders $125+",
        "couponDescription": "Enjoy 25% discount on orders of $125 or more when you enter this coupon code at checkout."
    },
    {
        "couponCode": "SPRING24",
        "couponTitle": "The Met Store Coupon: 25% Off All Orders",
        "couponDescription": "Use a code to get 25% off plus free delivery on purchases over $100 at The Met Store."
    },
    {
        "couponCode": "ART24",
        "couponTitle": "The Met Store Coupon: 25% Off Your Order",
        "couponDescription": "Take 25% off when you use this The Met Store code."
    },
    {
        "couponCode": "PRES24",
        "couponTitle": "25% Off $125+ Purchase At The Met Store",
        "couponDescription": "Enter this The Met Store promo code at checkout to receive 25% off your orders of over $125."
    },
    {
        "couponCode": "TABLE24",
        "couponTitle": "The Met Store Code: Take 30% Off Tableware",
        "couponDescription": "Enter this The Met Store coupon code at checkout to save 30% off your orders of Artistic Tableware."
    },
    {
        "couponCode": "SHINE23",
        "couponTitle": "Take 25% Off Your Purchase At The Met Store",
        "couponDescription": "Use this The Met Store discount code at checkout to take 25% off your entire order."
    },
    {
        "couponCode": "TREE23",
        "couponTitle": "Get 50% Off Your Purchase",
        "couponDescription": "Take 50% off holiday ornaments. Just add this code in your cart."
    },
    {
        "couponCode": "BEST24",
        "couponTitle": "The Met Store Coupon: 30% Off Your Order + Free Gift with Jewelry Purchases Over $125",
        "couponDescription": "Enjoy 30% off sitewide with this coupon code at store.metmuseum.org. Plus, spend $125 or more on jewelry and receive a delightful free gift."
    },
    {
        "couponCode": "SNOW24",
        "couponTitle": "The Met Store Discount Code: Save 25% on Orders $125+ ",
        "couponDescription": "Shop at The Met Store and enjoy a 25% discount on orders over $125. Apply this discount code at checkout."
    },
    {
        "couponCode": "BLACK24",
        "couponTitle": "Black Friday Sale: 25% Off Any Order",
        "couponDescription": "Enjoy shopping during the Black Friday Sale and get a 25% discount on your order. Enter this coupon code at checkout."
    },
    {
        "couponCode": "LABOR24",
        "couponTitle": "The Met Store Coupon: 25% Off Your Order ",
        "couponDescription": "Use this coupon code at The Met Store to get 25% off your order. Discover the exquisite beauty of art-inspired products, including jewelry, home décor, books, and stationery from The Metropolitan Museum's collection."
    },
    {
        "couponCode": "BEST23",
        "couponTitle": "The Met Store Coupon: 30% Off Your Order",
        "couponDescription": "If you are an online discount shopper, shop  store.metmuseum.org for an amazing deal. As part of the second phase of the holiday weekend sale, we are offering an incredible 30% off on every product across the entire site. This is the perfect chance to purchase unique art-inspired gifts, jewelry, home décor and more at unbeatable prices."
    }
]