[
    {
        "couponCode": "COUPON13",
        "couponTitle": "Get 13% Off Your Order ",
        "couponDescription": "Paste this promo code at checkout and save 13% on your order."
    },
    {
        "couponCode": "BTS15",
        "couponTitle": "Milanoo Coupon: 15% Off Your Order",
        "couponDescription": "Use this Milanoo coupon code to enjoy a fantastic 15% off on your current purchase. Whether you're looking for fashionable clothing, elegant shoes, chic accessories, or even stunning wedding apparel and costumes, Milanoo has got you covered."
    },
    {
        "couponCode": "MLAN",
        "couponTitle": "Enjoy Additional 12% Savings Using Promotional Code",
        "couponDescription": "Get an Extra 12% Off with Promo Code"
    },
    {
        "couponCode": "MLBC",
        "couponTitle": "Milanoo Coupon: Extra 15% Off Your Order",
        "couponDescription": "Take advantage of Milanoo's Black Friday Cyber Monday Sale and get an additional 15% discount on all items across the site. This is the perfect opportunity to save big on your favorite fashion pieces at Milanoo."
    },
    {
        "couponCode": "MN14",
        "couponTitle": "Get 13% Discount Using Promo Code",
        "couponDescription": "Score 13% off with code"
    },
    {
        "couponCode": "SALO15",
        "couponTitle": "Milanoo Promo Code: Get 15% Off Your Order ",
        "couponDescription": "Redeem this promo code at checkout and save 15% on your order."
    },
    {
        "couponCode": "victoria15",
        "couponTitle": "Enjoy Up to 15% Off Your Order",
        "couponDescription": "Receive up to a 15% discount when this Milanoo coupon code is applied."
    },
    {
        "couponCode": "LOVE",
        "couponTitle": "Milanoo Coupon Code: Take 10% Off Any Purchase ",
        "couponDescription": "Enjoy a 10% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "PARTYQUEEN",
        "couponTitle": "Milanoo Promo Code: Get 10% Off Any Order ",
        "couponDescription": "Redeem this promo code at checkout and save 10% on any order."
    },
    {
        "couponCode": "MISSBELLA",
        "couponTitle": "Save 10% on Any Purchase ",
        "couponDescription": "Shop at Milanoo and get a 10% discount on any purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "EWEDRG15",
        "couponTitle": "Get 15% Discount Using Promo Code",
        "couponDescription": "Take up to 15% off with promo code"
    },
    {
        "couponCode": "COMEIN5EN",
        "couponTitle": "Save 5% Off with Code",
        "couponDescription": "Get an Extra 5% Off on Select Products"
    },
    {
        "couponCode": "CN13",
        "couponTitle": "13% Off Everything Using Coupon",
        "couponDescription": "Shop at milanoo.com and receive a 13% off all your online order using this code during checkout."
    },
    {
        "couponCode": "MIL16",
        "couponTitle": "Get 16% Off Storewide",
        "couponDescription": "Milanoo offers an extra 16% discount on all your orders today."
    },
    {
        "couponCode": "VEEN",
        "couponTitle": "20% Discount Using Coupon Code",
        "couponDescription": "Save 20% off with coupon"
    },
    {
        "couponCode": "ILARIACUT9",
        "couponTitle": "Enjoy 15% Discount Using Promo Code",
        "couponDescription": "Take up to 15% off with promo code"
    },
    {
        "couponCode": "LABOR15",
        "couponTitle": "Milanoo Coupon: 15% Off Your Order",
        "couponDescription": "Take advantage of a stunning 15% off discount at milanoo.com, your online destination for fabulous fashion. Enjoy unbeatable prices on items such as elegant wedding dresses, chic cosplay costumes, and stylish swimwear with this promo code."
    },
    {
        "couponCode": "PRIME",
        "couponTitle": "15% Off Sitewide",
        "couponDescription": "Get ready to step up your fashion game with a fabulous 15% off promo code for Milanoo. Bursting with trend-setting outfits and must-have accessories, Milanoo is your one-stop shop for all things stylish. This fantastic deal allows you to save money on Milanoo's top products, making it easier than ever to look chic on a budget. Don't miss out, start shopping now and enjoy the savings."
    },
    {
        "couponCode": "FALL13",
        "couponTitle": "13% Off w/ Promotional Code",
        "couponDescription": "Buy and enjoy 13% discount on your eligible order with code at checkout. No minimum order value required."
    },
    {
        "couponCode": "SS15",
        "couponTitle": "Milanoo Coupon: 15% Off Any Purchase",
        "couponDescription": "Enjoy shopping even more with a fantastic 15% off on your favorite items at milanoo.com. Indulge in the latest trends of dresses, shoes, and cosplay costumes without breaking the bank."
    }
]