[
    {
        "couponCode": "ADDIT",
        "couponTitle": "Enjoy Up to 5% Off on Equipment and Accessories",
        "couponDescription": "Score up to 5% off select items at Anova Culinary. Use the code at checkout."
    },
    {
        "couponCode": "HOLIDAY10",
        "couponTitle": "Anova Culinary Coupon: 10% Off Your Order",
        "couponDescription": "Take 10% off your purchase on black friday sale at Anova Culinary."
    },
    {
        "couponCode": "ANOVAONE",
        "couponTitle": "Save $100 on Anova One with Code",
        "couponDescription": "For a limited time, you can get $100 off the original Anova One when you apply this discount code at checkout."
    },
    {
        "couponCode": "ANOVA20",
        "couponTitle": "Anova Culinary Promo Code: 20% Off Any Purchase",
        "couponDescription": "Use this coupon code during checkout and save 20% on ovens, vacuum sealers, accessories, and more at Anova."
    },
    {
        "couponCode": "OVEN30",
        "couponTitle": "Anova Culinary Promo Code: Up to 10% Off Any Purchase",
        "couponDescription": "Get your kitchen needs from Anova and enjoy up to 10% off your purchase when you use this code at checkout."
    },
    {
        "couponCode": "holidaysave",
        "couponTitle": "Get 10% Off Your Purchase",
        "couponDescription": "Save 10% on your order when you apply this coupon code at anovaculinary.com."
    },
    {
        "couponCode": "HOLIDAY",
        "couponTitle": "Anova Culinary Coupon Code: $30 Off Your Purchase",
        "couponDescription": "Buy Anova Culinary Sous Vide with this coupon code and enjoy $30 off. Redeem the code as you complete your purchase."
    },
    {
        "couponCode": "ANOVAGIFT",
        "couponTitle": "Take Extra 25% Off Your Order at Anova Culinary",
        "couponDescription": "Score an extra 25% off on any purchase sitewide at anovaculinary.com when you use this code."
    },
    {
        "couponCode": "HOLIDAYDEAL",
        "couponTitle": "Anova Culinary Discount Code: Extra 25% Off Any Order Sitewide ",
        "couponDescription": "Score up to an extra 25% off your purchase sitewide at Anova Culinary. Enter the code when checking out."
    },
    {
        "couponCode": "dad20",
        "couponTitle": "Anova Culinary Coupon: Up to 20% Off Any Purchase",
        "couponDescription": "Shop kitchen appliances and get up to 20% off with this Anova promo code."
    },
    {
        "couponCode": "ANOVADAD",
        "couponTitle": "Anova Culinary Discount Code: Extra 20% Off Your Purchase",
        "couponDescription": "Save extra 20% on Anova Culinary Precision cookers or oven. Apply this code at checkout."
    },
    {
        "couponCode": "D20",
        "couponTitle": "Take 20% Off Any Purchase with Promo Code",
        "couponDescription": "Redeem this coupon code at checkout and get a 20% discount on your order."
    },
    {
        "couponCode": "ANOVA10",
        "couponTitle": "Anova Culinary Promo Code: 10% Off Your Purchase",
        "couponDescription": "Enjoy 10% off your cart when you enter this code before finalizing your purchase at anovaculinary.com."
    },
    {
        "couponCode": "HEALTHYANOVA",
        "couponTitle": "Anova Culinary Coupon Code: 10% Off Your Purchase",
        "couponDescription": "Apply this promo code at checkout and get a 10% discount on combi-oven."
    },
    {
        "couponCode": "OVENACCESS",
        "couponTitle": "Score 10% Off on Precision Oven Accessories",
        "couponDescription": "Enjoy 10% off on all precision oven accessories with this Anova Culinary promo code at checkout."
    },
    {
        "couponCode": "OvenKit",
        "couponTitle": "Save Extra 10% Using Anova Culinary Code",
        "couponDescription": "Enjoy an extra 10% off when you purchase pans, baking sheets, and more with this Anova Culinary discount code."
    },
    {
        "couponCode": "HOLIDAY17",
        "couponTitle": "Extra $10 Off Your Purchase",
        "couponDescription": "Get an extra $10 off on orders in the US. Enter code when you checkout and save $80 total at anovaculinary.com."
    },
    {
        "couponCode": "FACEBOOK50",
        "couponTitle": "Save $50 on Anova Culinary Equipment",
        "couponDescription": "Shop culinary equipment at Anova and get $50 off your order with this code."
    },
    {
        "couponCode": "HOLIDAYPREGAME",
        "couponTitle": "Save 20% on Any Order Sitewide with Code",
        "couponDescription": "Receive 20% off on any purchase at anovaculinary.com."
    },
    {
        "couponCode": "SUMMERSALE",
        "couponTitle": "Get Up to 25% Off Your Purchase",
        "couponDescription": "Shop kitchen equipment and save up to 25% when you use this Anova Culinary code at checkout."
    }
]