[
    {
        "couponCode": "AFTERXMAS",
        "couponTitle": "Save Up to Extra 50% Off Any Item",
        "couponDescription": "Shop now at Belk and receive up to an extra 50% discount on any item. Enter this discount code at checkout."
    },
    {
        "couponCode": "THXSANTA",
        "couponTitle": "Enjoy Up to 65% Off Select Items",
        "couponDescription": "Save up to 65% on select fine jewelry at Belk. Use this discount code to unlock incredible savings. Shop now and sparkle for less."
    },
    {
        "couponCode": "KEEPITGOING",
        "couponTitle": "Belk Promo Code: Get Extra 60% Off Fine Jewelry",
        "couponDescription": "Enter this promo code at checkout and receive an extra 60% discount on fine jewelry."
    },
    {
        "couponCode": "63507335",
        "couponTitle": "65% Off Fine Jewelry & Silverworks Brand Orders",
        "couponDescription": "Score a dazzling 65% discount on retgular or sale fine jewelry and silverworks pieces from top brands at Belk.com. Don't miss this chance to sparkle and shine with these amazing deals. Shop at Belk for an incredible selection, fantastic prices, and unbeatable customer service  it's the ultimate destination for all your shopping needs."
    },
    {
        "couponCode": "BELKDAYS",
        "couponTitle": "Take Up to 50% Off Any Item ",
        "couponDescription": "Enjoy up to a 50% discount on any item when you enter this coupon code at checkout."
    },
    {
        "couponCode": "XMASCUTE",
        "couponTitle": "Belk Discount Code: Save Extra 20% on Beauty Products ",
        "couponDescription": "Shop at Belk and enjoy an extra 20% discount on beauty products. Apply this discount code at checkout."
    },
    {
        "couponCode": "TIME2SAVE",
        "couponTitle": "Belk Coupon: 55% Off Your Purchase",
        "couponDescription": "Shop and save 55% with this promo code for select items on your cart at Belk."
    },
    {
        "couponCode": "GIVESHINE",
        "couponTitle": "Belk Coupon Code: Up to 70% Off Your Purchase",
        "couponDescription": "Use this promo code at checkout to get up to 70% off your qualifying order."
    },
    {
        "couponCode": "SAVEEXTRA",
        "couponTitle": "Belk Coupon Code: Save Extra 20% on Clearance",
        "couponDescription": "Shop at Belk and enjoy an extra 20% discount on any clearance purchase. Apply this Belk discount code at checkout."
    },
    {
        "couponCode": "SHIMMER",
        "couponTitle": "Take 65% Off Jewelry",
        "couponDescription": "Save 65% off all Jewelry with this Belk coupon code."
    },
    {
        "couponCode": "BIGHOLIDAY",
        "couponTitle": "Get 50% Off Any Item ",
        "couponDescription": "Paste this promo code at checkout and save 50% on any item."
    },
    {
        "couponCode": "LOOKS4LESS",
        "couponTitle": "Belk Coupon: 50% Off Your Order",
        "couponDescription": "Take 50% off your purchase with this Belk code."
    },
    {
        "couponCode": "LASTMINUTE",
        "couponTitle": "Take 50% Off Your Purchase",
        "couponDescription": "Save at Belk by getting 50% on select items."
    },
    {
        "couponCode": "SHINE4XMAS",
        "couponTitle": "Belk Coupon: 65% Off Your Order",
        "couponDescription": "Take 65% off your purchase with this Belk code."
    },
    {
        "couponCode": "GOBACKHAPPY",
        "couponTitle": "Save an Extra 40% Off",
        "couponDescription": "Take an extra 40% off when using this Belk promo code at checkout."
    },
    {
        "couponCode": "33908284",
        "couponTitle": "Belk Coupon: 50% Off Your Order",
        "couponDescription": "Take 50% off your purchase by adding this Belk code."
    },
    {
        "couponCode": "38501512",
        "couponTitle": "Take Up to 60% Off",
        "couponDescription": "Save up to 60% and an extra 70% discount on fine jewelry silverworks when you apply this Belk coupon code."
    },
    {
        "couponCode": "CLEARFAVES",
        "couponTitle": "Belk Promo Code: Extra 10% Off Your Order",
        "couponDescription": "Shop and get an extra 10% off your purchase using a coupon code on your cart."
    },
    {
        "couponCode": "OHSOPRETTY",
        "couponTitle": "Belk Discount Code: Extra 20% Off Your Order",
        "couponDescription": "Save an additional 20% using this coupon code for full-priced beauty & fragrances on your purchase at Belk."
    },
    {
        "couponCode": "36893796",
        "couponTitle": "Belk Coupon: 55% Off Your Order",
        "couponDescription": "Big savings at Belk by getting up to 55% on your purchase."
    }
]