[
    {
        "couponCode": "MGM19PIN",
        "couponTitle": "Enjoy 10% Off",
        "couponDescription": "Use this Priority Pass promo code to get 10% off your membership."
    },
    {
        "couponCode": "HKTMVSCEMEA12",
        "couponTitle": "Priority Pass Discount Code: Up to 35% Off Your Order",
        "couponDescription": "Get up to 35% off membership plans when this discount code is used."
    },
    {
        "couponCode": "MGM16PIN",
        "couponTitle": "Priority Pass Coupon Code: Save 10% Off Instantly",
        "couponDescription": "Enjoy an extra 10% off Priority Pass membership plans when this discount code is applied."
    },
    {
        "couponCode": "PRIORITY20",
        "couponTitle": "Get 20% Off Collinson COVID-19 UK Travel Testing",
        "couponDescription": "Get 20% off testing at airport and city locations across the UK and at home testing kits booked with Collinson COVID-19 UK Travel Testing at Priority Pass."
    },
    {
        "couponCode": "AFFCMUS",
        "couponTitle": "Enjoy 15% Off Your First Year",
        "couponDescription": "Sign up for Priority Pass and enter this Priority Pass coupon code to receive 15% off your first year."
    },
    {
        "couponCode": "PRIORITY5",
        "couponTitle": "Get 5% Off Collinson COVID-19 UK Travel Testing",
        "couponDescription": "Get 5% off on pre-departure testing for travel within and departing from Hong Kong, Indonesia, and Singapore booked with Collinson COVID-19 UK Travel Testing at Priority Pass."
    },
    {
        "couponCode": "DACYBERMON17",
        "couponTitle": "Enjoy up to 80% Off",
        "couponDescription": "Save money with up to 80% off Vacation Bonus with your Priority Pass membership purchase."
    },
    {
        "couponCode": "DACMPJ17",
        "couponTitle": "Save up to 40%",
        "couponDescription": "Apply this Priority Pass coupon code to receive up to 50% off your membership."
    },
    {
        "couponCode": "DABLACKFRI17",
        "couponTitle": "Enjoy 40% Off Memberships",
        "couponDescription": "Use this Priority Pass coupon code to receive up to 40% off your membership at Priority Pass."
    },
    {
        "couponCode": "DABLKFRI17",
        "couponTitle": "Up to 15% Off",
        "couponDescription": "Apply this Priority Pass promo code to receive up to 15% off on your purchase of membership."
    }
]