[
    {
        "couponCode": "BUBBLE",
        "couponTitle": "Save 25% Off Sitewide using Coupon Code",
        "couponDescription": "Up to 25% off Sitewide and Free 2% BHA and Bubble Headband on $75"
    },
    {
        "couponCode": "CYBER",
        "couponTitle": "Save 25% Off",
        "couponDescription": "Get 25% off with coupon code"
    },
    {
        "couponCode": "FIRM",
        "couponTitle": "Get a Free Full-Sized Retinol Treatment with $95 Purchase",
        "couponDescription": "Score a fantastic deal at Paula's Choice. You can now receive a free full-size 1% Retinol Treatment when you make a purchase of $95. Don't miss this incredible chance to enhance your skincare routine while saving big."
    },
    {
        "couponCode": "EXCELLENCE",
        "couponTitle": "Take 20% Off Your Order",
        "couponDescription": "Save 20% on award winners with this Paula's Choice code."
    },
    {
        "couponCode": "BEST",
        "couponTitle": "Save 20% off Paula's choice + Free Gift on $95+",
        "couponDescription": "Save 20% off Sitewide and Choose Your Own Clinical Best-Seller on orders of $95 or more."
    },
    {
        "couponCode": "TRAVEL",
        "couponTitle": "Free Gift with Purchase at Paula's Choice",
        "couponDescription": "Get a Free Travel Size 2% BHA Exfoliant with Full Size Purchase at Paula's Choice."
    },
    {
        "couponCode": "FSCLEAR",
        "couponTitle": "Get Free Shipping Storewide From Paula's Choice",
        "couponDescription": "Enjoy free delivery on all your orders by using this coupon code at checkout at Paula's Choice. Stock up on the latest skincare today."
    },
    {
        "couponCode": "dana15",
        "couponTitle": "Get 15% Off Your Paula's Choice Order",
        "couponDescription": "Paste this promo code at checkout and save 15% on your order at \nPaula's Choice. Save big on skincare today."
    },
    {
        "couponCode": "SHEER",
        "couponTitle": "Take Free Travel Size C5 SPF On Your Order",
        "couponDescription": "Enjoy free travel size C5 SPF when you buy BHA liquid exfoliant at Paula's Choice."
    },
    {
        "couponCode": "SHELBY15",
        "couponTitle": "Take 15% Off Sitewide",
        "couponDescription": "Enjoy 15% off on your next purchase of serums, toners, and more with this Paula's Choice discount code."
    },
    {
        "couponCode": "PC15OFF",
        "couponTitle": "Save 15%",
        "couponDescription": "Receive up to 15% off your entire purchase when you apply this Paula's Choice discount code."
    },
    {
        "couponCode": "PERKSPOT10",
        "couponTitle": "Enjoy 10% Off at Paula's Choice",
        "couponDescription": "Receive 10% off your Paula's Choice order when you enter this code at checkout."
    },
    {
        "couponCode": "PC20OFF",
        "couponTitle": "Paula's Choice Coupon Code: 20% Off Any Order ",
        "couponDescription": "Get a 20% discount on your order when you enter this promo code at checkout."
    },
    {
        "couponCode": "welcome15",
        "couponTitle": "Score 15% Off Your Order w/ Coupon",
        "couponDescription": "Get 15% off your eligible purchase when you apply this Paula's Choice discount code at checkout."
    },
    {
        "couponCode": "29YEARS",
        "couponTitle": "Save 20% Off Sitewide + $189 Worth of Gifts",
        "couponDescription": "Use this Paula's Choice promo code and get 20% off sitewide."
    },
    {
        "couponCode": "FINALE",
        "couponTitle": "Paula's Choice Coupon: 20% Off Your Order",
        "couponDescription": "Get 20% off sitewide and $180 worth of gifts at Paula's Choice."
    },
    {
        "couponCode": "SAFEOPT15",
        "couponTitle": "Score 15% Off",
        "couponDescription": "Shop for skincare, body care, makeup, and more with this Paula's Choice promo code to save 15%."
    },
    {
        "couponCode": "GIFTS",
        "couponTitle": "Paula's Choice Coupon: Receive a Free Mandelic Acid Exfoliant on $60, Plus Omega+ Complex Serum and C5 Eye Cream on $135 ",
        "couponDescription": "Shop at paulaschoice.com and enjoy a complimentary Mandelic Acid Exfoliant when you spend $60. If your order totals $135 or more, we'll also add an Omega+ Complex Serum and a C5 Eye Cream to your package absolutely free."
    },
    {
        "couponCode": "BRIGHT",
        "couponTitle": "Free C15 Super Booster with Purchases Over $99",
        "couponDescription": "Enjoy a complimentary C15 Super Booster when you spend over $99 at Paula's Choice and apply this coupon code. This amazing offer allows you to experience the powerful benefits of this top-rated product without any additional cost. With fantastic deals like this, today is the perfect day to save money and revamp your skincare routine with Paula's Choice high-quality products."
    },
    {
        "couponCode": "TV15",
        "couponTitle": "Take 15% Off",
        "couponDescription": "Enter this Paula's Choice coupon code and enjoy 15% off sitewide for your next order of serum, toner, makeup, and more."
    }
]