[
    {
        "couponCode": "BFOUTLET15",
        "couponTitle": "Lenovo Outlet Coupon: Extra 15% Off Your Order",
        "couponDescription": "Take an additional 15% off outlet orders on your sitewide purchase using Lenovo Outlet's promo code at checkout."
    },
    {
        "couponCode": "OUTLET25",
        "couponTitle": "Lenovo Outlet Promo Code: Extra 25% Off Your Purchase",
        "couponDescription": "Order using Lenovo Outlet's coupon code and receive an additional 25% off select items on your purchase at checkout."
    },
    {
        "couponCode": "OUTLET10",
        "couponTitle": "Lenovo Outlet Discount Code: 10% Off Your Order",
        "couponDescription": "Shop using Lenovo Outlet's discount code and get 10% off your Sitewide purchase at checkout."
    },
    {
        "couponCode": "OUTLET20",
        "couponTitle": "Lenovo Outlet Coupon: 20% Off Your Purchase",
        "couponDescription": "Take an extra 20% off using a coupon code at outlet.lenovo.com."
    },
    {
        "couponCode": "OUTETSALE",
        "couponTitle": "Take 10% Off Your Purchase ",
        "couponDescription": "Enjoy 10% off new arrivals when you use this Lenovo discount code."
    },
    {
        "couponCode": "OUTLETSALE",
        "couponTitle": "Take 10% Off Your Order",
        "couponDescription": "Save 10% on discounted PCs at Lenovo Outlet. For limited time only."
    },
    {
        "couponCode": "OUTLET15",
        "couponTitle": "Save 15% at Lenovo Outlet",
        "couponDescription": "Shop using this Lenovo Outlet to receive 15% off your purchase of Lenovo products."
    },
    {
        "couponCode": "DOORBUSTERS",
        "couponTitle": "Save 5% on Lenovo IdeaTab",
        "couponDescription": "Enter this Lenovo Outlet coupon code to receive a refurbished Lenovo IdeaTab for 5% off."
    },
    {
        "couponCode": "OUTLETSAVE20",
        "couponTitle": "Lenovo Outlet Coupon Code: Extra 20% Off Your Order Sitewide",
        "couponDescription": "Get an extra 20% off all outlet items at Lenovo with this coupon code. Save big on laptops, desktops, and accessories. Shop now for the best deals on Lenovo products."
    }
]