[
    {
        "couponCode": "clearend25",
        "couponTitle": "Woodcraft Promo Code: 25% Off Your Order",
        "couponDescription": "Shop and get 25% off your purchase of clearance items using a discount code on your cart."
    },
    {
        "couponCode": "SHIP2ME",
        "couponTitle": "Free Shipping on Your Order",
        "couponDescription": "Shop and get free shipping on your purchase sitewide using a coupon code on your cart."
    },
    {
        "couponCode": "BUNNY",
        "couponTitle": "Free Shipping Sitewide",
        "couponDescription": "Hop into amazing savings at Woodcraft.com with this delightful promo code. Enjoy free standard shipping on all your woodworking essentials when you spend just $39 or more. It's time to unleash your creativity and start crafting."
    },
    {
        "couponCode": "BM63SQSETA23",
        "couponTitle": "Woodcraft Coupon: 23% Off Your Order",
        "couponDescription": "Take 23% off your purchase with this Woodcraft code."
    },
    {
        "couponCode": "Monster",
        "couponTitle": "Woodcraft Coupon: Get Free Standard Shipping When You Spend $35+",
        "couponDescription": "Score free standard shipping on orders over $35 at Woodcraft.com. Use this coupon code at checkout and start saving."
    },
    {
        "couponCode": "30USA",
        "couponTitle": "$30 Off Orders $200+ Using Code",
        "couponDescription": "Score a fantastic deal at Woodcraft.com. Grab your favorite woodworking goodies and enjoy a whopping $30 discount on any purchase of $200 or more. Just apply this coupon code at checkout to enjoy the deal. Don't miss this golden opportunity to upgrade your workshop while saving big."
    },
    {
        "couponCode": "20FORDAD",
        "couponTitle": "$20 Off Any Order Sitewide of $200+",
        "couponDescription": "Use this Woodcraft promo code to save $20 on your current purchase at woodcraft.com. Explore a wide range of high-quality woodworking tools, supplies, and accessories, perfect for any DIY enthusiast or professional carpenter. Save on items such as power tools, hand tools, wood finishes, and lumber. Don't miss this opportunity to make the most of your woodworking projects with top-notch products from Woodcraft."
    },
    {
        "couponCode": "PRIME",
        "couponTitle": "Enjoy Free Shipping On Your Order",
        "couponDescription": "Receive free shipping with minimum purchase of $25."
    },
    {
        "couponCode": "DEC23TEN",
        "couponTitle": "Woodcraft Coupon: $10 Off Orders $25+",
        "couponDescription": "Unlock a sweet deal at woodcraft.com with this coupon code. Simply tap this offer and enjoy a $10 discount on your current purchase. Happy shopping."
    },
    {
        "couponCode": "SAVE25",
        "couponTitle": "Woodcraft Coupon Code: Take 25% Off Any Purchase ",
        "couponDescription": "Enjoy a 25% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "MOM24",
        "couponTitle": "Woodcraft Coupon: $10 Off Your Order of $40+",
        "couponDescription": "Use this coupon code to get a $10 discount on your current purchase at woodcraft.com. Save on everything from power tools to wood finishes and more. Whether you're a professional carpenter or a DIY enthusiast, this coupon can help you get the best quality woodworking supplies for less."
    },
    {
        "couponCode": "SHOPMASTER",
        "couponTitle": "Get 5% Savings Using Promo Code",
        "couponDescription": "Save up to 5% off with discount code"
    },
    {
        "couponCode": "HELLO",
        "couponTitle": "Get 10% Off Sitewide with Promo Code",
        "couponDescription": "Enter this coupon code at checkout and get a 10% discount on your order. Valid on power tools & accessories, hand tools, hardware, wood, finishing, workshop, home goods and kits and projects."
    },
    {
        "couponCode": "PENCIL",
        "couponTitle": "Save 10% with Code",
        "couponDescription": "Apply this woodcraft.com coupon code to save 10% on orders."
    },
    {
        "couponCode": "GETMY15",
        "couponTitle": "Woodcraft Discount Code: Get 25% Off Orders $500+ Sitewide",
        "couponDescription": "Save big on your next purchase at Woodcraft with this exclusive discount code. Get a solid 25% off all orders over $500 sitewide. Don't miss out on this deal."
    },
    {
        "couponCode": "freeship",
        "couponTitle": "Get Up to 25% Off Sitewide with Promo Code",
        "couponDescription": "Enter this coupon code at checkout and get up to a 25% discount on your order."
    },
    {
        "couponCode": "DEC22TEN",
        "couponTitle": "Get $10 Off on Orders $25+",
        "couponDescription": "Enjoy $10 off when you spend $25."
    },
    {
        "couponCode": "WORKSHOP",
        "couponTitle": "Save 10% Off using Coupon Code",
        "couponDescription": "Score up to 10% off with code"
    },
    {
        "couponCode": "Dec24Ten",
        "couponTitle": "Woodcraft Coupon: $10 Off Your Order of $25+",
        "couponDescription": "Use this Woodcraft coupon code to save $10 on your purchase of $25 or more. Whether youre looking for premium woodworking tools, high-quality lumber, or unique project kits, Woodcraft has you covered."
    },
    {
        "couponCode": "DASHER",
        "couponTitle": "Woodcraft Coupon: Free Shipping With Your $35 Purchase",
        "couponDescription": "Enjoy the convenience of free shipping on your order at woodcraft.com with this discount code. Just spend $35 to qualify for this deal."
    }
]