[
    {
        "couponCode": "H0LIDAYS",
        "couponTitle": "ITA Airways Promo Code: Enjoy 20% Off Your Order",
        "couponDescription": "Use this promo code to get 20% off your purchase at ITA Airways. This limited-time offer helps you save on flights and services. Book now and enjoy great savings on your next trip."
    },
    {
        "couponCode": "TRAVEL20",
        "couponTitle": "ITA Airways Discount Code: Receive 20% Off Your Purchase",
        "couponDescription": "Save 20% on round-trip flights with this ITA Airways discount code. Enjoy big savings on your travel plans. Book now and fly for less."
    },
    {
        "couponCode": "TRAVEL",
        "couponTitle": "Save 15% Off using Coupon Code",
        "couponDescription": "Use this promo code to get 15% discount to italy at checkout."
    },
    {
        "couponCode": "BF20",
        "couponTitle": "Get 20% Off Any Order ",
        "couponDescription": "Paste this promo code at checkout and save 20% on any order."
    },
    {
        "couponCode": "SAUDI",
        "couponTitle": "ITA Airways US Coupon: 20% Off Your Order",
        "couponDescription": "Save at ITA Airways US by getting 20% on select items."
    },
    {
        "couponCode": "BANGKOK20",
        "couponTitle": "ITA Airways Promo Code: 20% Off",
        "couponDescription": "Shop and get 20% off using this discount code on your purchase at ITA Airways."
    },
    {
        "couponCode": "SINGLE20",
        "couponTitle": "ITA Airways Discount Code: 20% Off Your Order",
        "couponDescription": "Use this promotional code at checkout to score 20% off your qualifying purchase."
    },
    {
        "couponCode": "CYBER",
        "couponTitle": "Take Up to 5% Off Your Order",
        "couponDescription": "Enter this ITA Airways discount code at checkout to get up to 5% off your qualifying purchase."
    },
    {
        "couponCode": "HALLOWEEN20",
        "couponTitle": "Save 20% on Your Purchase",
        "couponDescription": "Enjoy a 20% discount on your purchase. Apply this coupon code at checkout."
    },
    {
        "couponCode": "ITA20",
        "couponTitle": "Take 20% Off Your Purchase",
        "couponDescription": "Receive 20% off when you use this ITA Airways code."
    },
    {
        "couponCode": "DUBAI",
        "couponTitle": "ITA Airways Promo Code: 20% Off Your Booking",
        "couponDescription": "When this coupon code is applied at checkout, you can take 20% off flights to Dubai."
    },
    {
        "couponCode": "AUGURI20",
        "couponTitle": "ITA Airways Discount Code: Save 20% on Italy, Europe, North Africa, and Middle East Tickets ",
        "couponDescription": "Apply this discount code at checkout and enjoy a 20% discount on Italy, Europe, North Africa, and Middle East tickets."
    },
    {
        "couponCode": "COLOR_ITA20",
        "couponTitle": "20% Off Your Order",
        "couponDescription": "Shop and take 20% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "BREAK",
        "couponTitle": "Get Up to 30% Off Your Booking with Coupon",
        "couponDescription": "Redeem this ITA Airways coupon code at checkout to get up to 30% off your flights."
    },
    {
        "couponCode": "25OFF",
        "couponTitle": "ITA Airways Coupon Code: Get 25% Off",
        "couponDescription": "Book your ITA Airways Intra European, Middle East, and North Africa flights using this coupon code and get your booking for 25% off."
    },
    {
        "couponCode": "FLYUS",
        "couponTitle": "Get 25% Off on Your Trip",
        "couponDescription": "Fly from the United States to Italy using this ITA Airways coupon code and get 25% off."
    },
    {
        "couponCode": "BLACK",
        "couponTitle": "Save 20% Off",
        "couponDescription": "Add this ITA airways discount code at checkout to apply 20% off to any destination to fly between 10 January 2025 and 31 March 2025 from the United States to any ITA Airways destination in all travel classes."
    },
    {
        "couponCode": "HALLOWEEN",
        "couponTitle": "ITA Airways Coupon: 25% Off Your Purchase",
        "couponDescription": "Shop and receive 25% off orders with this promo code on your cart at ITA Airways."
    }
]