[
    {
        "couponCode": "15YR75",
        "couponTitle": "Save $15 off $75",
        "couponDescription": "Use Yves Rocher promo code and score $15 off on orders over $75."
    },
    {
        "couponCode": "50OFF3",
        "couponTitle": "Take 50% Off on First 3 Products",
        "couponDescription": "With this Yves Rocher coupon code, you can save 50% on your first 3 products. Make sure you check out at YvesRocher.ca using this code. Offer terms apply."
    },
    {
        "couponCode": "EXTRA10",
        "couponTitle": "Enjoy 50% Discount Using Promo Code",
        "couponDescription": "Get 50% off with code"
    },
    {
        "couponCode": "BLKFRIDAY10",
        "couponTitle": "Yves Rocher Canada Promo Code: Get Extra 10% Off Any Order $75+",
        "couponDescription": "Redeem this promo code at checkout and save an extra 10% on any order over $75."
    },
    {
        "couponCode": "FACE30",
        "couponTitle": "Yves Rocher Canada Promo Code: Get 30% Off Face Care Products ",
        "couponDescription": "Redeem this promo code at checkout and save a 30% on face care products."
    },
    {
        "couponCode": "BOXINGWEEK10",
        "couponTitle": "Yves Rocher Canada Coupon: 10% Off When You Spend $75+",
        "couponDescription": "Get ready to save big with Yves Rocher's Boxing Week Sale. Enjoy a fabulous 10% off on your favorite beauty and skincare products when you spend $75 or more. Don't miss out on this fantastic deal and start filling your shopping cart now."
    },
    {
        "couponCode": "COZYSHIP",
        "couponTitle": "Yves Rocher Coupon: 10% Off Your Order",
        "couponDescription": "Use this Yves Rocher discount code to save 10% on your purchase."
    },
    {
        "couponCode": "YRLOVE",
        "couponTitle": "Yves Rocher Coupon: 40% Off When You Order 3 Products",
        "couponDescription": "Get ready to save big with their Flash Offer at Yves Rocher. We're slashing prices by a whopping 40% on not one, not two, but three amazing products. Hurry over to yvesrocher.ca with this coupon code and snag this fabulous deal right away."
    },
    {
        "couponCode": "SURPRISE",
        "couponTitle": "Yves Rocher Canada Coupon: Get Up to 10% Off",
        "couponDescription": "Save up to 10% on your order with this coupon. Get discounts on your favorite Yves Rocher beauty products. Shop now and enjoy great savings on skincare, makeup, and more."
    },
    {
        "couponCode": "Yves30h",
        "couponTitle": "Yves Rocher Canada Coupon: 30% Off Your Order",
        "couponDescription": "When this discount code is applied during checkout, you can get 30% off your select purchase."
    },
    {
        "couponCode": "YVES30WK",
        "couponTitle": "Get Up to 10% Off Any Order ",
        "couponDescription": "Paste this promo code at checkout and save up to 10% on any order."
    },
    {
        "couponCode": "SPC20",
        "couponTitle": "Yves Rocher Coupon: 20% Off Your Order",
        "couponDescription": "Take 20% off makeup, haircare and more at Yves Rocher."
    },
    {
        "couponCode": "FLASH20",
        "couponTitle": "Yves Rocher Coupon: 20% Off Your Order Over CAD$75",
        "couponDescription": "Get excited, savvy online shoppers. When you spend over CAD$75 at yvesrocher.ca, you'll enjoy a whopping 20% off on your order. It's the perfect opportunity to stock up on your favourites or try something new from their range."
    },
    {
        "couponCode": "EXTRA30",
        "couponTitle": "Yves Rocher Coupon: Extra 30% Off Your Order of $100+",
        "couponDescription": "Use this coupon code to enjoy an extra 30% off on purchases of $100 or more. Stock up on your favorite beauty products and treatments at Yves Rocher Canada."
    },
    {
        "couponCode": "LUCKY20",
        "couponTitle": "Yves Rocher Coupon: 20% Off Your Order of $75+",
        "couponDescription": "Get ready to save like never before at yvesrocher.ca. With luck on your side, you can now unlock a fantastic 20% off on any order when you spend over $75. Enjoy the best in beauty and skincare for less today."
    },
    {
        "couponCode": "CHANCE20",
        "couponTitle": "Yves Rocher Canada Discount Code: Save 20% on Any Purchase",
        "couponDescription": "Shop at Yves Rocher Canada and enjoy a 20% discount on any purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "40OFF2",
        "couponTitle": "Yves Rocher Canada Discount Code: Save 40% on First 2 Products",
        "couponDescription": "Apply this discount code at checkout and enjoy 40% discount on first two products."
    },
    {
        "couponCode": "3VIP50",
        "couponTitle": "Get 50% Savings Using The Promo Code",
        "couponDescription": "Score 50% off with discount code"
    },
    {
        "couponCode": "YRSAV10",
        "couponTitle": "Yves Rocher Coupon: Get 10% Off Any Purchase",
        "couponDescription": "Enjoy 10% off your Yves Rocher order with this code."
    },
    {
        "couponCode": "40OFF100",
        "couponTitle": "Get 15% Discount Using Promo Code",
        "couponDescription": "Score up to 15% off with coupon code"
    }
]