[
    {
        "couponCode": "MEMORIES10",
        "couponTitle": "Score 20% Off on Your Purchase",
        "couponDescription": "20% off favorites with a minimum spend of $10 and using this StubHub promo code at checkout."
    },
    {
        "couponCode": "SAVE15",
        "couponTitle": "StubHub Discount Code: Save 15% Off on Live Event Tickets",
        "couponDescription": "Customers can save 15% off select live event tickets when using this StubHub discount code."
    },
    {
        "couponCode": "DH83M2",
        "couponTitle": "Get 10% Off with this StubHub Discount Code",
        "couponDescription": "Apply this StubHub discount code to take 10% off your total purchase when spending $100 or more on tickets for local sporting events, concerts, and shows."
    },
    {
        "couponCode": "TREATYOSELF",
        "couponTitle": "Get up to 20% Off Your Entire Purchase",
        "couponDescription": "Load up on tickets and apply this StubHub promo code for up to 20% off, applied to your entire shopping cart."
    },
    {
        "couponCode": "STUB20",
        "couponTitle": "StubHub Coupon: 20% Off Your Tickets",
        "couponDescription": "Buy tickets to your next event and get 20% off when you redeem this StubHub promo code at checkout."
    },
    {
        "couponCode": "FTP",
        "couponTitle": "30% Off Your Entire Purchase with Code",
        "couponDescription": "Take $30 off with code on $100+ orders"
    },
    {
        "couponCode": "25omin",
        "couponTitle": "Up To 25% Off MLS Tickets",
        "couponDescription": "Take 25% off with this StubHub discount code."
    },
    {
        "couponCode": "TAKE5",
        "couponTitle": "75% Off End of Summer Shows",
        "couponDescription": "Get 75% off tickets this summer with this StubHub discount code."
    },
    {
        "couponCode": "HOLLYWORD208",
        "couponTitle": "Save 10% on Show Tickets",
        "couponDescription": "Apply this StubHub discount code at checkout for a 10% discount on theatre performances, musicals, and comedy shows."
    },
    {
        "couponCode": "STUB13",
        "couponTitle": "Take 13% Off Select Purchases",
        "couponDescription": "Save 13% on tickets for sports, concerts, and theater with StubHub. Use the discount code to unlock big savings. Enjoy your favorite events for less now."
    },
    {
        "couponCode": "PAYFASTER",
        "couponTitle": "StubHub Discount Code: $10 Off Purchases of $100+",
        "couponDescription": "Save $10 any ticket purchase of $100 or more with this StubHub discount code."
    },
    {
        "couponCode": "HERD",
        "couponTitle": "StubHub Promo Code: Score $20 Off Your Order",
        "couponDescription": "Enter this StubHub discount code to receive $20 off tickets for concerts, sporting events, and more for your first purchase."
    },
    {
        "couponCode": "MEMORIAS10",
        "couponTitle": "$10 Off Your Order with StubHub Coupon Code",
        "couponDescription": "Use this special $10 off StubHub discount code to save on tickets to sporting events, concerts, and more."
    },
    {
        "couponCode": "FALL10",
        "couponTitle": "Score 10% Off Your Order with StubHub Coupon Code",
        "couponDescription": "Buy tickets for concerts, sporting events, comedy shows, and more using this StubHub coupon code and get 10% off your order."
    },
    {
        "couponCode": "CYBER30",
        "couponTitle": "Save 30% Off w/ Discount Code",
        "couponDescription": "Take 30% off with coupon code"
    },
    {
        "couponCode": "STUB10",
        "couponTitle": "Take Extra 10% Off Any Ticket ",
        "couponDescription": "Redeem this promo code at checkout and receive an extra 10% discount on any ticket."
    },
    {
        "couponCode": "applepay-10",
        "couponTitle": "Apply this StubHub Discount Code for $10 Off",
        "couponDescription": "Customers who use Apple Pay for the first time when purchasing any tickets will receive a $10 discount. Use this StubHub discount code at checkout; minimum $100 purchase required."
    },
    {
        "couponCode": "25NOMIN",
        "couponTitle": "Save up to 25% on Local Shows and Events",
        "couponDescription": "New and returning customers can save up to 25% off their next concert, theatre, sporting or comedy event in participating cities with this StubHub discount code."
    },
    {
        "couponCode": "10OFF",
        "couponTitle": "StubHub Promo Code: Extra 10% Off Your Order",
        "couponDescription": "Shop and take an extra 10% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "VTHANKS",
        "couponTitle": "Up to 40% Off on Your Order of $100 or More",
        "couponDescription": "Get 40% off with this StubHub promo code on your favorite events this summer. Save up to 40% off on festivals, concerts, and much more!"
    }
]