[
    {
        "couponCode": "CLEARANCE50",
        "couponTitle": "Take Up to 50% Off Any Item ",
        "couponDescription": "Enjoy shopping and get up to a 50% discount on any item when you enter this coupon code at checkout."
    },
    {
        "couponCode": "TIME15",
        "couponTitle": "Invicta Stores Coupon: 15% Off Your Order",
        "couponDescription": "Save 15% on jewelry, sunglasses and more at Invicta Stores."
    },
    {
        "couponCode": "YT20",
        "couponTitle": "Save 20% Off Sitewide",
        "couponDescription": "grab an extra 20% off on your sitewide purchases using the promo code at checkout."
    },
    {
        "couponCode": "NEW40",
        "couponTitle": "Save 40% Off with Code",
        "couponDescription": "Use this Invicta Stores coupon code at checkout to receive an extra 40% off all your orders."
    },
    {
        "couponCode": "YT25",
        "couponTitle": "Take 25% Off Your Order",
        "couponDescription": "Get extra 25% off sitewide by using this Invicta Stores code."
    },
    {
        "couponCode": "0PEN30",
        "couponTitle": "Invicta Stores Coupon: 30% Off Your Order",
        "couponDescription": "Save at Invicta Stores by getting 30% on your purchase."
    },
    {
        "couponCode": "44707",
        "couponTitle": "Invicta Stores Coupon: $17 Off",
        "couponDescription": "Receive $17 off select items on your order with this promo code from Invicta Stores. Redeem at checkout."
    },
    {
        "couponCode": "X25",
        "couponTitle": "Get Extra 25% Off Invicta Orders With Code",
        "couponDescription": "Use this Invicta promo code at checkout to save extra 25% off your orders."
    },
    {
        "couponCode": "TREAT20",
        "couponTitle": "Save 20% Off w/ Discount Code",
        "couponDescription": "Enter this Invicta Stores coupon code at checkout to get an extra 20% off your order."
    },
    {
        "couponCode": "DIA20",
        "couponTitle": "Save 20% Off using Coupon Code",
        "couponDescription": "Add this  promo code at checkout to enjoy 20% off your orders of Dia De Los DEALS."
    },
    {
        "couponCode": "extra35",
        "couponTitle": "Take 35% Off Jewelry",
        "couponDescription": "Get an additional 35% off your jewelry or watch purchases online with the current promo code."
    },
    {
        "couponCode": "WELCOME40",
        "couponTitle": "Invicta Stores Coupon- 40% Off w/ Code",
        "couponDescription": "Take 40% off your next order when you enter this promo code at checkout. Won't last."
    },
    {
        "couponCode": "OPEN20",
        "couponTitle": "Save 20% Off using Coupon Code",
        "couponDescription": "Add this Invicta coupon code at checkout to enjoy an extra 20% off your orders of diamond watches."
    },
    {
        "couponCode": "SAVECC35",
        "couponTitle": "Save 35% Sitewide",
        "couponDescription": "Use this Invicta Stores coupon to unlock a massive 35% discount on your purchase at InvictaStores.com. Simply enter this coupon code at checkout and watch the prices drop on your favorite Invicta watches and accessories. Don't miss your chance to elevate your style while saving big."
    },
    {
        "couponCode": "RT50",
        "couponTitle": "Get 50% Off Entire Purchase With Invicta Code",
        "couponDescription": "Save extra 50% on your entire purchase by adding this Invicta Stores code."
    },
    {
        "couponCode": "HELLO20",
        "couponTitle": "20% Watch Savings",
        "couponDescription": "Save 20% on watches for men  and women when the coupon code is applied at checkout."
    },
    {
        "couponCode": "WELCOME35",
        "couponTitle": "Invicta Stores Promo Code: 35% Off Orders $99+",
        "couponDescription": "Shop smart at Invicta Stores with this promo code. Enjoy an exclusive 35% discount on orders over $99. Upgrade your timepiece collection today."
    },
    {
        "couponCode": "THANKS25",
        "couponTitle": "Enjoy 25% Off Latest Styles",
        "couponDescription": "Apply this discount code at checkout to get a 25% off on qualifying online purchases of Invicta watches and latest trends."
    },
    {
        "couponCode": "SAVECC30",
        "couponTitle": "Get 30% Off Sitewide",
        "couponDescription": "Unlock incredible savings at InvictaStores.com with this coupon. Enjoy a generous 30% off on your favorite Invicta watches and accessories when you apply this coupon code during checkout. Don't miss this fantastic opportunity to elevate your style while keeping your wallet happy."
    },
    {
        "couponCode": "prime20",
        "couponTitle": "Get 20% Off Sitewide with Promo Code",
        "couponDescription": "Enjoy shopping and grab a 20% discount on your order. Enter this coupon code at checkout."
    }
]