[
    {
        "couponCode": "EM20",
        "couponTitle": "Daniel Footwear Coupon Code: Take 20% Off Your Purchase ",
        "couponDescription": "Enjoy a 20% discount on your purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "ABAN5",
        "couponTitle": "Extra 5% Off Sitewide",
        "couponDescription": "For a limited time, Daniel Footwear is offering an additional 5% discount. Add this code at checkout to redeem offer."
    },
    {
        "couponCode": "DAN5",
        "couponTitle": "Daniel Footwear Discount Code: Save 5% on Any Purchase ",
        "couponDescription": "Shop at Daniel Footwear and enjoy a 5% discount on any purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "FPP15",
        "couponTitle": "Daniel Footwear Promo Code: Get 15% Off Full Price items",
        "couponDescription": "Purchase any full price item and enjoy a 15% discount on your order when you enter this coupon code at checkout."
    },
    {
        "couponCode": "FP12",
        "couponTitle": "Get Up to 12% Off Full Price Items with Promo Code",
        "couponDescription": "Enter this coupon code at checkout and get up to a 12% discount on regular-price items."
    },
    {
        "couponCode": "EX30",
        "couponTitle": "Get Extra 30% Off Sale Items with Promo Code",
        "couponDescription": "Enter this coupon code at checkout and get an extra 30% discount on your order."
    },
    {
        "couponCode": "SALE15",
        "couponTitle": "Daniel Footwear Coupon: 15% Off",
        "couponDescription": "Shop and save 15% with this promo code for select items on your cart at Daniel Footwear."
    },
    {
        "couponCode": "FIRST10",
        "couponTitle": "New Customers Save 10%",
        "couponDescription": "Daniel Footwear is offering a 10% discount for new customers. Use this code at checkout to redeem offer."
    },
    {
        "couponCode": "BCC5",
        "couponTitle": "5% Discount with Code",
        "couponDescription": "Shop Daniel Footwear and save 5% on your order when you redeem this coupon code."
    },
    {
        "couponCode": "BCP5",
        "couponTitle": "Save 5% on Order with Code",
        "couponDescription": "Shop online at DanielFootwear.com today and get 5% off your entire purchase. Simply apply this promo code during checkout to redeem the discount."
    },
    {
        "couponCode": "EX15",
        "couponTitle": "Get 15% Off Eligible Items with Promo Code",
        "couponDescription": "Get a 15% discount on eligible items. Enter this coupon code at checkout."
    },
    {
        "couponCode": "BCA10",
        "couponTitle": "Save 10% at Daniel Footwear",
        "couponDescription": "Enter this coupon code at checkout to take 10% off your Daniel Footwear purchase."
    },
    {
        "couponCode": "WEB10",
        "couponTitle": "10% Off Select Items",
        "couponDescription": "Shop qualifying shoes at Daniel Footwear and save 10% with this code."
    },
    {
        "couponCode": "BC5",
        "couponTitle": "Save an Additional 5%",
        "couponDescription": "Add this code at checkout to save an extra 5% on your order."
    },
    {
        "couponCode": "FP15",
        "couponTitle": "Daniel Footwear Coupon Code: 15% Off Your Order",
        "couponDescription": "Daniel Footwear has a promo code that will save you an additional 15% off everything."
    },
    {
        "couponCode": "EX20",
        "couponTitle": "Get Additional 20% Discount On Daniel Footwear Sale",
        "couponDescription": "Score an extra 20% off sale purchase at Daniel Footwear."
    },
    {
        "couponCode": "BF20",
        "couponTitle": "Daniel Footwear Coupon: 20% Off Your Order",
        "couponDescription": "Use this promo code at Daniel Footwear to get 20% off your entire order when you check out."
    },
    {
        "couponCode": "FP10",
        "couponTitle": "10% Off Your First Order",
        "couponDescription": "Use this code to save 10% on your first purchase from Daniel Footwear."
    },
    {
        "couponCode": "BOOTS20",
        "couponTitle": "Take Up to 20% Off Any Purchase ",
        "couponDescription": "Enjoy shopping and get up to a 20% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "PD5",
        "couponTitle": "5% Off with Code",
        "couponDescription": "Apply this promo code to save 5% on your next Daniel Footwear purchase."
    }
]