[
    {
        "couponCode": "FAMILY",
        "couponTitle": "Save 50% Off With Children's Place Code",
        "couponDescription": "Use this code at checkout checkout and receive 50% off your purchase at Children's Place."
    },
    {
        "couponCode": "25OFFER8",
        "couponTitle": "Children's Place Coupon: 80% Off Clearance",
        "couponDescription": "Take 80% off clearance items with this Children's Place code."
    },
    {
        "couponCode": "CYBER60",
        "couponTitle": "The Children's Place Coupon: 60% to 80% Off Your Order",
        "couponDescription": "The Children's Place is offering a 60% to 80% off the entire site using the discount code."
    },
    {
        "couponCode": "TAKE30",
        "couponTitle": "Get Extra 30% Off Your Entire Order",
        "couponDescription": "Use this The Children's Place promo code at checkout to get an extra 30% off your entire order."
    },
    {
        "couponCode": "BMSMPOLOS",
        "couponTitle": "Only $12",
        "couponDescription": "Shop and get 2-4 Polos for only $12-$20+ using this The Children's Place discount code on your cart."
    },
    {
        "couponCode": "GIMME30",
        "couponTitle": "The Children's Place Discount Code: Extra 30% Off Your Order",
        "couponDescription": "Get an extra 30% off your purchase when you use The Children's Place promo code."
    },
    {
        "couponCode": "Y56405BK55H5BL",
        "couponTitle": "Take $10 Off on Orders Over $40+",
        "couponDescription": "Grab a $10 discount on your order over $40. Use this promo code at checkout."
    },
    {
        "couponCode": "GIMME20",
        "couponTitle": "Up to 70% Off Entire Site with Extra 20% Off ",
        "couponDescription": "Save up to 70% off everything with this extra 20% discount, for the Early Black Friday Sale."
    },
    {
        "couponCode": "25PROMO6",
        "couponTitle": "Take 25% Off Your Order",
        "couponDescription": "Big savings at The Children's Place: Get 25% off your purchase by adding this code at the checkout stage."
    },
    {
        "couponCode": "ONEDAY60",
        "couponTitle": "The Children's Place Coupon: 60% Off Your Purchase ",
        "couponDescription": "The Children's Place is hosting a One Day Wow Event Sale with a whopping 60% off on their entire site. Stock up on adorable, high-quality kids' clothing without breaking the bank."
    },
    {
        "couponCode": "COZY20",
        "couponTitle": "Children's Place Promo Code: Extra 20% Off Your Order",
        "couponDescription": "Shop and get an additional 20% off using this discount code on your purchase at Children's Place."
    },
    {
        "couponCode": "PACKS",
        "couponTitle": "Extra 20% Off on Purchase of 3+ Multipacks",
        "couponDescription": "Save 50% off on multipacks items plus get an extra 20% off when you buy 3 or more."
    },
    {
        "couponCode": "HURRY20",
        "couponTitle": "Take 20% Off Your Order at The Children's Place",
        "couponDescription": "Apply this Children's Place coupon code at checkout to receive 20% off your order."
    },
    {
        "couponCode": "TAKE25",
        "couponTitle": "Children's Place Discount Code: Save 25% on Any Purchase ",
        "couponDescription": "Shop at Children's Place and enjoy a 25% discount on any purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "Y78905ZBLQK9CB",
        "couponTitle": "Take $20 Off w/ Promo Code",
        "couponDescription": "When entering this Children's Place discount code, you can save $20 on $50 or more total orders."
    },
    {
        "couponCode": "SAVE60",
        "couponTitle": "60% Off Any Order Sitewide",
        "couponDescription": "Attention all online shoppers: Save big on your shopping spree at The Children's Place. They are currently offering a massive 60% off on any purchase when you apply this promo code at checkout. Please note that there are limited exclusions to this offer."
    },
    {
        "couponCode": "50OFF",
        "couponTitle": "Save 50% on Any Purchase Sitewide",
        "couponDescription": "For a limited time, receive a 50% discount on your purchase. Apply this The Children's Place coupon code during the checkout process."
    },
    {
        "couponCode": "XTRA20",
        "couponTitle": "Save 20% Off",
        "couponDescription": "Save an extra 20% off on your purchase when you use this The Children's Place promo code at checkout."
    },
    {
        "couponCode": "25OFFER3",
        "couponTitle": "Save 25% Off Sitewide + Free Shipping",
        "couponDescription": "Use this The Children's Place coupon code to take an extra 25% off on your order and enjoy free shipping."
    },
    {
        "couponCode": "500FF",
        "couponTitle": "Enjoy 50% Off Your Order Sitewide",
        "couponDescription": "Get 50% off your sitewide purchase at The Children's Place with this coupon code. Enjoy big savings on children's clothing, shoes, and accessories. Shop and save now."
    },
    {
        "couponCode": "Y78705JY0679II",
        "couponTitle": "Save 20% Off Clearance w/ Promo Code",
        "couponDescription": "Take extra 20% off clearance items with this Childrens Place code."
    }
]