[
    {
        "couponCode": "XMAS",
        "couponTitle": "Pink Cherry Coupon: 80% Off Your Order",
        "couponDescription": "Take extra 80% off your purchase with this Pink Cherry code."
    },
    {
        "couponCode": "LD2023",
        "couponTitle": "Pink Cherry Discount Code: Save Extra 40% Off on Any Purchase",
        "couponDescription": "Shop at Pink Cherry and get extra 40% discount on any purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "BLACK",
        "couponTitle": "Pink Cherry Promo Code: Extra 40% Off Your Purchase",
        "couponDescription": "Shop and receive an additional 40% off with Pink Cherry's promo code for Sitewide Orders on your cart."
    },
    {
        "couponCode": "CYBER",
        "couponTitle": "Take 40% Off Your Purchase ",
        "couponDescription": "Enjoy shopping and get a 40% discount on your purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "HOLIDAY",
        "couponTitle": "Pink Cherry Promo Code: 50% Off Your Order",
        "couponDescription": "Shop and take 50% off your purchase using a coupon code on your cart."
    },
    {
        "couponCode": "FLASH",
        "couponTitle": "Get Free Discreet Shipping Orders Of $59+",
        "couponDescription": "Receive free discreet shipping when you spend $59 and more at Pink Cherry."
    },
    {
        "couponCode": "LOVE",
        "couponTitle": "Pink Cherry Coupon: 40% Off Your Order",
        "couponDescription": "Take 40% off sex and adult toys at Pink Cherry."
    },
    {
        "couponCode": "JULY",
        "couponTitle": "Take 30% Off Your Order",
        "couponDescription": "Save 30% on sex and adult toys at Pink Cherry."
    },
    {
        "couponCode": "BLOWOUT",
        "couponTitle": "Pink Cherry Discount Code: Extra 50% Off Your Order",
        "couponDescription": "Apply an additional 50% off sitewide orders using this coupon code on your purchase at Pink Cherry."
    },
    {
        "couponCode": "SPRING",
        "couponTitle": "Pink Cherry Coupon: Up to 35% Off Your Order",
        "couponDescription": "Take up to 35% off your sitewide purchase using Pink Cherry's promo code at checkout."
    },
    {
        "couponCode": "PINK40",
        "couponTitle": "Get 40% Discount On All Items",
        "couponDescription": "40% off Sitewide"
    },
    {
        "couponCode": "NYSALE",
        "couponTitle": "Pink Cherry Coupon: 40% Off",
        "couponDescription": "Shop and receive 40% off store-wide orders with Pink Cherry's promo code on your cart."
    },
    {
        "couponCode": "EXTRA",
        "couponTitle": "Extra 40% Off Your Order Store-Wide at Pink Cherry",
        "couponDescription": "Visit the Pink Cherry store and enjoy 40% off on your purchase using the promo code at checkout."
    },
    {
        "couponCode": "BLOOM",
        "couponTitle": "Pink Cherry Coupon: Up to 50% Off Your Purchase",
        "couponDescription": "Get up to 50% off sale items with Pink Cherry's promo code on your cart at checkout."
    },
    {
        "couponCode": "SAVE-NZDCQHK2",
        "couponTitle": "Pink Cherry Coupon: 50% Off Your Order",
        "couponDescription": "Take up to 50% off sitewide by adding this Pink Cherry code."
    },
    {
        "couponCode": "HI-M6NCM5NN",
        "couponTitle": "Get Up to 50% Off Your Purchase",
        "couponDescription": "Use this Pink Cherry coupon code at checkout to enjoy up to 50% off your order."
    },
    {
        "couponCode": "HI-NM9QZWF4",
        "couponTitle": "Save 50% on Your Purchase ",
        "couponDescription": "Shop at Pink Cherry and get a 50% discount on your purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "FALL",
        "couponTitle": "Pink Cherry Coupon Code: Take Extra 30% Off Your Purchase",
        "couponDescription": "Enter this coupon code at checkout and enjoy extra 30% discount on your purchase."
    },
    {
        "couponCode": "PRIME",
        "couponTitle": "Pink Cherry Coupon Code: 40% Off All Orders",
        "couponDescription": "Apply this coupon code from Pink Cherry to receive a 40% discount on your order."
    },
    {
        "couponCode": "BLACK40",
        "couponTitle": "Our online sex toy adult shop offers Free UPS Ground Shipping on orders over $49",
        "couponDescription": null
    }
]