[
    {
        "couponCode": "BW031",
        "couponTitle": "Dickies Discount Code: Up to 20% Off All Items",
        "couponDescription": "Get up to 20% off your purchase at Dickies. Use this code at checkout."
    },
    {
        "couponCode": "DKSBF20",
        "couponTitle": "Dickies Promo Code: Extra 20% Off Your Purchase",
        "couponDescription": "Order using this coupon code and receive an additional 20% off select items on your purchase at Dickies."
    },
    {
        "couponCode": "pants30",
        "couponTitle": "Get 30% Off Any Pants ",
        "couponDescription": "Paste this promo code at checkout and save 30% on any pants."
    },
    {
        "couponCode": "9CLUB",
        "couponTitle": "Up to 20% Off All Outerwear",
        "couponDescription": "Gear up for cooler weather with Dickies current sale of up to 20% off with the latest promo code."
    },
    {
        "couponCode": "S103",
        "couponTitle": "20% Off Any Dickies Order",
        "couponDescription": "Enjoy 20% off on Dickies purchases when you apply the current coupon code at checkout."
    },
    {
        "couponCode": "BW060",
        "couponTitle": "Up to 20% Off Your Order",
        "couponDescription": "Take up to 20% off your Dickies order when you apply this code at checkout."
    },
    {
        "couponCode": "wb15",
        "couponTitle": "Extra 15% Off New Styles ",
        "couponDescription": "Unlock extra 15% off on your online order at Dickies with a special code."
    },
    {
        "couponCode": "W10-RS9-UYD-2LI-FTZ",
        "couponTitle": "Dickies Discount Code: 15% Off Your Order",
        "couponDescription": "Score 15% off your select purchase using this coupon code during checkout."
    },
    {
        "couponCode": "10OFFCATERING",
        "couponTitle": "Dickies Promo Code: 10% Off Your Purchase",
        "couponDescription": "Take 10% off on your total purchase with Dickies coupon code."
    },
    {
        "couponCode": "BW081",
        "couponTitle": "Up to 20% Off Dickies Apparel",
        "couponDescription": "Take up to 20% off when you shop at Dickies using this code at checkout."
    },
    {
        "couponCode": "NORA",
        "couponTitle": "Dickie Coupon: 40% Off Your Order",
        "couponDescription": "Get up to 40% off sitewide by adding this Dickies code."
    },
    {
        "couponCode": "W2008-LWDQX9H3DBTR",
        "couponTitle": "Dickies Discount Code: Extra 20% Off Your Order",
        "couponDescription": "Enjoy an additional 20% off by utilizing this Dickies promo code at checkout."
    },
    {
        "couponCode": "22DCKCAMINOFR24",
        "couponTitle": "Dickies Coupon Code: Save Up to 22% Off Your Order Sitewide",
        "couponDescription": "Get up to 22% off your entire purchase at Dickies with this coupon code. Enjoy savings on all items across the site. Don't miss out on this limited-time offer."
    },
    {
        "couponCode": "EXTRA15",
        "couponTitle": "Dickies Coupon Code: Take 15% Off Any Purchase ",
        "couponDescription": "Enjoy a 15% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "WELCOME15",
        "couponTitle": "Dickies Coupon: 15% Off Your Order",
        "couponDescription": "Save 15% on workwear by using this Dickies code."
    },
    {
        "couponCode": "CMR15",
        "couponTitle": "Dickies Coupon Code: Up to 55% Off Your Order ",
        "couponDescription": "Save more, buy more with up to 55% off when you use this Dickies coupon code at checkout."
    },
    {
        "couponCode": "BW101",
        "couponTitle": "Dickies Coupon Code: Up to 20% Off Any Purchase",
        "couponDescription": "Take up to 20% off on your Dickies purchase when you use this code at checkout."
    },
    {
        "couponCode": "D1922",
        "couponTitle": "Dickies Promo Code: 50% Off Cargo Pants",
        "couponDescription": "Get 50% off your Dickies items from pants to work shirts with the current promo code."
    },
    {
        "couponCode": "save30",
        "couponTitle": "Dickies Discount Code: 30% Off Your Order",
        "couponDescription": "All shoppers can receive a 30% discount on their select purchase by simply applying this coupon at checkout."
    },
    {
        "couponCode": "SAVE20",
        "couponTitle": "Extra 20% Off Your Order",
        "couponDescription": "Receive an extra 20% off your purchase of discounted items on your cart."
    }
]