[
    {
        "couponCode": "PDOLWELCOME22",
        "couponTitle": "Grab 10% Off Your Order with Pet Drugs Online Code",
        "couponDescription": "Enter this Pet Drugs Online coupon code at checkout on your next order of dog food, pet meds, and more to get 10% off."
    },
    {
        "couponCode": "PURINAEXTRA10",
        "couponTitle": "10% Off Your Order of Purina",
        "couponDescription": "Shop for Purina products at Pet Drugs Online using this promo code and get an additional 10% off."
    },
    {
        "couponCode": "HILLSCIENCE50",
        "couponTitle": "Pet Drugs Online Coupon: Up to 50% Off",
        "couponDescription": "Enjoy up to 50% off your order when you enter this Pet Drugs Online coupon code at checkout."
    },
    {
        "couponCode": "NALA20",
        "couponTitle": "Get 20% Off Any Order ",
        "couponDescription": "Paste this promo code at checkout and save 20% on any order."
    },
    {
        "couponCode": "ADVANTAGE25",
        "couponTitle": "Take 25% Off Your Order",
        "couponDescription": "Save big at Pet Drugs by getting 25% on your purchase."
    },
    {
        "couponCode": "PDOLFN12",
        "couponTitle": "Pet Drugs Online Coupon: 12% Off Orders £60+ Sitewide",
        "couponDescription": "Save 12% on all orders over £60 at Pet Drugs Online with this coupon. Shop sitewide for your pet's medication and supplies while enjoying this exclusive discount. Don't miss out on great savings for your furry friends."
    },
    {
        "couponCode": "AFFILIATE10",
        "couponTitle": "Enjoy 10% Off Any Order",
        "couponDescription": "Redeem this Pet Drugs Online coupon code at checkout to get 10% off your order."
    },
    {
        "couponCode": "PDOLWELCOME10",
        "couponTitle": "10% Off with Pet Drugs Online Promo Code",
        "couponDescription": "Get 10% off your first order at Pet Drugs Online when you enter this promo code at checkout."
    },
    {
        "couponCode": "BLUESTORM10",
        "couponTitle": "Get Extra 10% Off Your Order ",
        "couponDescription": "Paste this promo code at checkout and save an extra 10% on your order."
    },
    {
        "couponCode": "PDOLWELCOME23",
        "couponTitle": "Up to 23% Off with Coupon Code",
        "couponDescription": "Shop for dog food, medication, and more using this Pet Drugs Online discount code and get up to 23% off."
    },
    {
        "couponCode": "PDOLJN12",
        "couponTitle": "Take Up to 10% Off Any Purchase ",
        "couponDescription": "Enjoy shopping and get up to a 10% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "DOTDOTPET20",
        "couponTitle": "Pet Drugs Online Promo Code: £4 Off",
        "couponDescription": "Shop using Pet Drugs Online's discount code and get up to £4 off selected Dotdotdog items on your purchase at checkout."
    }
]