[
    {
        "couponCode": "SMALL15",
        "couponTitle": "Save 15% on Everything",
        "couponDescription": "Shop small with 15% off your entire purchase when you spend at least £50."
    },
    {
        "couponCode": "HURRY10",
        "couponTitle": "Get 10% Off Your Order",
        "couponDescription": "Enjoy 10% off when you purchase £40 and more at Not On The High Street."
    },
    {
        "couponCode": "10NEW",
        "couponTitle": "Save 10% Off w/ Promo Code",
        "couponDescription": "Use this promo code to save 10% on your initial purchase."
    },
    {
        "couponCode": "HEY15",
        "couponTitle": "New Customers Savings- 15% Off with Code",
        "couponDescription": "All new shoppers can get an extra 15% discount on their order by applying this promo code at checkout."
    },
    {
        "couponCode": "SHOPAPP15",
        "couponTitle": "Get Extra 15% Off Store-Wide with Promo Code",
        "couponDescription": "Enter this coupon code at checkout and get an extra 15% discount on your order."
    },
    {
        "couponCode": "new_mummy_jess10",
        "couponTitle": "Not On The High Street Coupon: 10% Off Your Order",
        "couponDescription": "Take 10% off sitewide by adding this Not On The High Street code."
    },
    {
        "couponCode": "FERGUSON_AT_NO510",
        "couponTitle": "10% Off Your Order",
        "couponDescription": "Purchase at Not On The High Street and get 10% off storewide orders using this coupon code on your cart."
    },
    {
        "couponCode": "gisforgeorgina10",
        "couponTitle": "Not On The High Street Promo Code: 10% Off Your Order",
        "couponDescription": "Buy and save 10% with this discount code on your storewide purchase at Not On The High Street."
    },
    {
        "couponCode": "life_with_lenny_r10",
        "couponTitle": "Not On The High Street Discount Code: 10% Off Your Order",
        "couponDescription": "Shop and take 10% off your purchase using a coupon code on your cart."
    },
    {
        "couponCode": "naomivictorias10",
        "couponTitle": "Not On the High Street: 10% Off Your Order",
        "couponDescription": "Shop and get 10% off your purchase using a discount code on your cart."
    },
    {
        "couponCode": "junieandmama10",
        "couponTitle": "10% Off Your Order",
        "couponDescription": "Shop and get 10% off your purchase using a coupon code on your cart."
    },
    {
        "couponCode": "NICE15",
        "couponTitle": "Not On The High Street Promo Code: 15% Off",
        "couponDescription": "Buy and save 15% on your purchase with this promo code at Not On The High Street."
    },
    {
        "couponCode": "APPONLY15",
        "couponTitle": "Not On The High Street Discount Code: 15% Off In-app Orders ",
        "couponDescription": "Use this Not On The High Street coupon code at checkout to apply 15% off your orders through the App."
    },
    {
        "couponCode": "mothering_girls10",
        "couponTitle": "Take 10% Off Your Order",
        "couponDescription": "Enjoy 10% off sitewide by adding this Not On The High Street code."
    },
    {
        "couponCode": "STYLEANDTHEBOYS10",
        "couponTitle": "Not On The High Street Coupon: Up to 10% Off Your Purchase",
        "couponDescription": "Receive up to 10% off your sitewide orders with this promo code from Not On The High Street. Redeem at checkout."
    },
    {
        "couponCode": "APP15",
        "couponTitle": "Not On The High Street Coupon Code: 15% Off Your In-app Orders",
        "couponDescription": "Add this Not On The High Street promo code at checkout to take 15% off your orders through the App."
    },
    {
        "couponCode": "THE_TUNAYS10",
        "couponTitle": "Not On The High Street Coupon: 10% Off Your Order",
        "couponDescription": "Take 10% off your storewide purchase using this promo code at Not On The High Street."
    },
    {
        "couponCode": "JOY15",
        "couponTitle": "Save 15% on orders over £50",
        "couponDescription": "Save 15% on orders over £50"
    },
    {
        "couponCode": "thechoifamilyuk10",
        "couponTitle": "Not On The High Street Discount Code: Save 10% on Your Purchase ",
        "couponDescription": "Shop at Not On The High Street and enjoy a 10% discount on your purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "TEAMNOTHS-919",
        "couponTitle": "Save Up to 20% on Your Order Sitewide",
        "couponDescription": "Get up to 20% off sitewide at Not On The High Street. Use this discount code at checkout to save more. Shop now and enjoy exclusive deals."
    }
]