[
    {
        "couponCode": "EXTRA10",
        "couponTitle": "Save 10% Off w/ Coupon Code",
        "couponDescription": "Extra 10% off Superdry Sale"
    },
    {
        "couponCode": "VC5",
        "couponTitle": "The Hut Discount Code: 5% Off Your Order",
        "couponDescription": "Remember to apply this promotional code at checkout to save 5% on your select purchase."
    },
    {
        "couponCode": "NEW15",
        "couponTitle": "Get 15% Off First Order",
        "couponDescription": "New customers score up to 15% off first order at The Hut."
    },
    {
        "couponCode": "MMK35",
        "couponTitle": "The Hut Coupon: 35% Off Your Purchase",
        "couponDescription": "Unlock a world of savings with an exciting 35% off discount code for thehut.com, your one-stop shop for quality products. Delight in unbeatable prices on items ranging from cutting-edge electronics, stylish clothing to luxurious beauty products."
    },
    {
        "couponCode": "HUT25",
        "couponTitle": "Save 25% Off",
        "couponDescription": "Save 25% off on winter essentials orders at thehut.com."
    },
    {
        "couponCode": "V20HT",
        "couponTitle": "Save 15% Off Using Code",
        "couponDescription": "Score up to 15% off with code"
    },
    {
        "couponCode": "bf10",
        "couponTitle": "Take Extra 10% Off Any Purchase ",
        "couponDescription": "Enjoy shopping and get an extra 10% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "HUT-R9",
        "couponTitle": "50% Off Your Order",
        "couponDescription": "Shop and receive 50% off your purchase using a coupon code on your cart."
    },
    {
        "couponCode": "SALE",
        "couponTitle": "Save 30% Off using Coupon Code",
        "couponDescription": "Save 30% off with discount code"
    },
    {
        "couponCode": "MASTERTH15",
        "couponTitle": "Save 15% with Code",
        "couponDescription": "Apply the following code to receive an additional 15% off at The Hut."
    },
    {
        "couponCode": "APP20",
        "couponTitle": "Get A 20% Discount On Your Purchase",
        "couponDescription": "Save 20% on Your Order"
    },
    {
        "couponCode": "SAVE",
        "couponTitle": "The Hut Coupon: Get Up to 30% Off",
        "couponDescription": "Great savings await you at thehut.com. Bag a whopping 20% discount when you spend £75, increase your savings to 25% when your cart totals £125, and unlock an incredible 30% off when you shop for £250. So why wait? Fill up your cart and enjoy these amazing discounts today."
    },
    {
        "couponCode": "APP32",
        "couponTitle": "32% Off Your Order At The Hut App",
        "couponDescription": "Use this The Hut coupon code at checkout to enjoy 32% off your orders of selected styles in the app."
    },
    {
        "couponCode": "32OUTDOOR",
        "couponTitle": "The Hut Promo Code: 32% Off",
        "couponDescription": "Shop and receive 32% off Columbia, Dickies, Barbour, RAINS, and More using this discount code on your purchase at The Hut."
    },
    {
        "couponCode": "20EXTRA",
        "couponTitle": "The Hut Coupon: Extra 20% Off",
        "couponDescription": "Shop and receive an additional 20% off Clearance Items with The Hut's promo code on your cart."
    },
    {
        "couponCode": "STYLE30",
        "couponTitle": "The Hut Coupon Code: Get 30% Off Any Purchase",
        "couponDescription": "This coupon code can save you 30% on your order from famous brands like RAINS, Calvin Klein, UGG, and many more. Simply apply the code at checkout to redeem the discount. Visit The Hut today and save extra cash."
    },
    {
        "couponCode": "SHOE30",
        "couponTitle": "The Hut Discount Code: 30% Off Your Purchase",
        "couponDescription": "Shop online at TheHut.com today and save on your next purchase. Copy and paste this discount code at checkout to save 30% on products by Steve Madden, Dr. Martens, UGG, and more. Don't miss out on this fantastic offer."
    },
    {
        "couponCode": "EDIT30",
        "couponTitle": "The Hut Coupon: 30% Off Your Purchase",
        "couponDescription": "Shop and receive 30% off Moose Knuckles, Calvin Klein, Coach, and more with The Hut's promo code on your cart."
    },
    {
        "couponCode": "ACCS30",
        "couponTitle": "The Hut Coupon: 30% Off",
        "couponDescription": "Shop and receive 30% off Polo Ralph Lauren, MMK, and More with The Hut's promo code on your cart."
    },
    {
        "couponCode": "POLLY",
        "couponTitle": "The Hut Coupon: 20% Off Your Order",
        "couponDescription": "Take 20% off your purchase plus free UK delivery at The Hut."
    }
]