[
    {
        "couponCode": "GIFT15",
        "couponTitle": "Take 15% Off Your Order",
        "couponDescription": "Save at Muck Boot Company by getting 15% on select items."
    },
    {
        "couponCode": "MUCK25",
        "couponTitle": "Get $25 Off Your Order",
        "couponDescription": "Enjoy $25 off your Muck Boot Company purchase with this code."
    },
    {
        "couponCode": "CYBER",
        "couponTitle": "Take 20% Off Your Order",
        "couponDescription": "Enter this Muck Boot Company discount code at checkout to get 20% off your qualifying purchase."
    },
    {
        "couponCode": "SNOW25",
        "couponTitle": "Take 25% Off Sale Styles ",
        "couponDescription": "Shop now at Muck Boot Company and receive a 25% discount on sale styles. Redeem this discount code at checkout."
    },
    {
        "couponCode": "take25",
        "couponTitle": "Get Up To 15% Off Using Promo Code",
        "couponDescription": "Score up to 15% off with discount code"
    },
    {
        "couponCode": "DIAMOND",
        "couponTitle": "Get $100 Off Select Muck Outscape Lace Up and Slip on Shoes with Promo Code",
        "couponDescription": "Get a $100 discount on select muck outscape lace-up and slip-on shoes. Enter this coupon code at checkout."
    },
    {
        "couponCode": "MDAY20",
        "couponTitle": "Take 20% Off Your Order",
        "couponDescription": "Enjoy 20% off your purchase this memorial day sale at Muck Boot Company."
    },
    {
        "couponCode": "NEWYEAR20",
        "couponTitle": "Get 20% Off Sitewide",
        "couponDescription": "Save 20% off with promo code"
    },
    {
        "couponCode": "FALL20",
        "couponTitle": "Take 20% Off Your Purchase",
        "couponDescription": "Get 20% off your order this autumn sale event at Muck Boot Company."
    },
    {
        "couponCode": "FLASH",
        "couponTitle": "Muck Boot Company Promo Code: Save On Your Order",
        "couponDescription": "Purchase Sitewide for $39 at Muck Boot Company using the code at checkout."
    },
    {
        "couponCode": "AFF10",
        "couponTitle": "10% Savings Storewide",
        "couponDescription": "Buy at muckbootcompany.com and don't forget to use this code to get a 10% discount on all your order. Save now."
    },
    {
        "couponCode": "GROW20",
        "couponTitle": "Muck Boot Company Coupon: 20% Off Your Order ",
        "couponDescription": "Use this Muck Boot Company discount code to save 20% on your current purchase. Their popular waterproof boots can keep your feet dry in any weather condition. Also, you can enjoy a discounted price on their gardening shoes and work boots, known for their comfort and durability."
    },
    {
        "couponCode": "LAND",
        "couponTitle": "Muck Boot Company Promo Code: Extra 50% Off Your Order",
        "couponDescription": "Receive an additional 50% off sale items on your purchase with this discount code at Muck Boot Company."
    },
    {
        "couponCode": "40MDAY",
        "couponTitle": "Take 40% Off Your Order",
        "couponDescription": "Save big at Muck Boot Company by getting 40% on your purchase."
    },
    {
        "couponCode": "wirecutter",
        "couponTitle": "Save Up to 10% on Any Purchase ",
        "couponDescription": "Shop at Muck Boot Company and get up to a 10% discount on any purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "MUCKUBARSTOOL",
        "couponTitle": "Muck Boot Company Discount Code: Up to 20% Off Your Purchase",
        "couponDescription": "Enter this coupon code at checkout to save up to an extra 20% off your order."
    },
    {
        "couponCode": "AFF15",
        "couponTitle": "Muck Boot Company Coupon: 15% Off Your Order",
        "couponDescription": "Get ready to step into the world of savings with a 15% off promo code from Muck Boot Company. This exclusive offer is a fantastic opportunity for comfort and quality seekers to snag those dream boots at an unbeatable price. Muck Boot Company is renowned for its durable, waterproof footwear that's perfect for any outdoor adventure."
    },
    {
        "couponCode": "SAVE20",
        "couponTitle": "Muck Boot Company Coupon: Get $20 Off Your Order of $175+",
        "couponDescription": "Score a $20 discount on your current pair of hiking, gardening, hunting or outdoor boots when you spend $175 or more at muckbootcompany.com. Take advantage of this fantastic coupon code deal and save big on the top-notch products at Muck Boot Company."
    },
    {
        "couponCode": "WINTER20",
        "couponTitle": "Get 20% Off with Code",
        "couponDescription": "Use this promo code from Premium Waterproof Boots to receive 20% off on Sale Styles when you shop with code."
    },
    {
        "couponCode": "NHFDAY15",
        "couponTitle": "Save 15% Off w/ Promo Code",
        "couponDescription": "Score 15% off with code"
    }
]