[
    {
        "couponCode": "TEN4U",
        "couponTitle": "Take Up to 10% Off on Your Next Purchase",
        "couponDescription": "Use Big Lots promotional code at checkout to get up to 10% off on your online purchases."
    },
    {
        "couponCode": "app10doff",
        "couponTitle": "Big Lots Coupon Code: Up to 45% Off Your Order",
        "couponDescription": "Shop and take up to 45% off your purchase using a discount code on your cart."
    },
    {
        "couponCode": "savebig20",
        "couponTitle": "Big Lots Coupon: 20% Off Your Order",
        "couponDescription": "Take 20% off your Big Lots purchase with this code."
    },
    {
        "couponCode": "4REWARD",
        "couponTitle": "Big Lots Promo Code: 5% Off Your Purchase ",
        "couponDescription": "Add this promo code at checkout to receive 5% off your purchase at Big Lots."
    },
    {
        "couponCode": "WELCOME15",
        "couponTitle": "Big Lots Discount Code: 15% Off All Orders ",
        "couponDescription": "Receive 15% off your purchase when you enter this Big Lots coupon code at checkout."
    },
    {
        "couponCode": "BONUSFIVE",
        "couponTitle": "Big Lots Coupon Code: 12% Off Your Order",
        "couponDescription": "Shop and take 12% off your purchase using a discount code on your cart."
    },
    {
        "couponCode": "SAVEBIG15",
        "couponTitle": "Get 15% Off With Big Lots Coupon",
        "couponDescription": "Use this Big Lots code to save 15% on your purchase."
    },
    {
        "couponCode": "3REWARD",
        "couponTitle": "Up to 20% Off Your Purchase ",
        "couponDescription": "Take up to 20% off your purchase using this Big Lots coupon code at checkout."
    },
    {
        "couponCode": "50GIFT",
        "couponTitle": "Big Lots Promo Code: Up to 60% Off Any Order ",
        "couponDescription": "Save big using this promo code from Big Lots. Up to 60% off your purchase."
    },
    {
        "couponCode": "BLCC5",
        "couponTitle": "Extra 5% Off Your Order ",
        "couponDescription": "Enjoy an additional 5% off your purchase when this promo code is applied upon checkout."
    },
    {
        "couponCode": "BLCPD",
        "couponTitle": "Big Lots Coupon Code: Take Up to 10% Off Any Purchase ",
        "couponDescription": "Enjoy up to a 10% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "BIGDEAL1",
        "couponTitle": "5% Off Any Order Sitewide",
        "couponDescription": "Score 5% off all purchases with Big Lots promo code."
    },
    {
        "couponCode": "1REWARD",
        "couponTitle": "Extra 20% Off on House Essentials ",
        "couponDescription": "Take an extra 20% off your order at Big Lots; enter code when you checkout."
    },
    {
        "couponCode": "2REWARD",
        "couponTitle": "Big Lots Discount Code: Get 15% Off Any Purchase ",
        "couponDescription": "Enjoy 15% off your purchase at Big Lots. Use code during the checkout process."
    },
    {
        "couponCode": "BIRTHDAY1",
        "couponTitle": "Big Lots Promo Code: Up to 15% Off Any Items",
        "couponDescription": "Don't miss this exciting offer from Big Lots: Up to 15% off on any items using code at checkout."
    },
    {
        "couponCode": "EXTRA20",
        "couponTitle": "Extra 20% Off Sofas, Sectionals, Recliners, Mattresses & Bedroom At Big Lots",
        "couponDescription": "Apply this Big Lots coupon code at checkout to take extra 20% off your orders of Sofas, Sectionals, Recliners, Mattresses and Bedroom."
    },
    {
        "couponCode": "6REWARD",
        "couponTitle": "Big Lots Coupon Code: Up to 15% Off Your Order ",
        "couponDescription": "Shop at Big Lots and receive up to 15% off your order using this code at checkout."
    },
    {
        "couponCode": "SAVEBIG",
        "couponTitle": "Save $10 on Any Order",
        "couponDescription": "Apply this promo code at checkout for a $10 discount on your order."
    },
    {
        "couponCode": "MISSYOU",
        "couponTitle": "$10 Off on Orders Above $20 ",
        "couponDescription": "Get $10 off when you spend $20 or more at Big Lots. Use code upon checkout."
    },
    {
        "couponCode": "DEAL20",
        "couponTitle": "Big Lots Discount Code: Save Up to 20% on Any Item",
        "couponDescription": "Shop at Big Lots and enjoy up to a 20% discount on any item. Apply this discount code at checkout."
    }
]