[
    {
        "couponCode": "TAKE10",
        "couponTitle": "KORSVIP Private Access: Extra 10% Off Your Purchase ",
        "couponDescription": "Enjoy an additional 10% off your purchase with this Michael Kors promo code through KORSVIP Private Access."
    },
    {
        "couponCode": "MERRY",
        "couponTitle": "Michael Kors Coupon Code: Get 25% Off Full Priced Items",
        "couponDescription": "Apply this Michael Kors promo code at checkout to receive 25% off on all full priced items."
    },
    {
        "couponCode": "CAVIPGIFT",
        "couponTitle": "Get $50 Off Your Order",
        "couponDescription": "Take $50 off handbags, shoes and more purchase of $300."
    },
    {
        "couponCode": "USVIPGIFT",
        "couponTitle": "Michael Kors Coupon Code: Take Up to 10% Off Any Purchase ",
        "couponDescription": "Enjoy up to a 10% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "PRE-LOVED",
        "couponTitle": "Michael Kors Coupon: Plant a Tree and Earn Bonus Points on Pre-Loved Items",
        "couponDescription": "Join us at michaelkors.com for a fantastic offer. This Earth Month, we encourage you to plant a tree and show some love to their planet. Plus, use the online coupon code and earn special points on your purchase. Celebrate Earth Month in style with Michael Kors."
    },
    {
        "couponCode": "SETSALE",
        "couponTitle": "Michael Kors Coupon Code: Extra 25% Off Sale",
        "couponDescription": "Get more savings with this coupon code offering an additional 25% discount on sale items at Michael Kors. Upgrade your wardrobe without breaking the bank. Shop and save now."
    },
    {
        "couponCode": "20MORE",
        "couponTitle": "Michael Kors Coupon: Extra 20% Off",
        "couponDescription": "Shop and save an additional 20% with this promo code on your cart at Michael Kors."
    },
    {
        "couponCode": "VIP15",
        "couponTitle": "Michael Kors Coupon Code: Get 15% Off Your Order",
        "couponDescription": "KORSVIP members can use this coupon code at checkout to get an extra 15% off sale items or 15% off outlet items."
    },
    {
        "couponCode": "EMPLOYEE",
        "couponTitle": "Get 70% Off with Michael Kors Promo Code",
        "couponDescription": "Score up to 70% off at Michael Kors with this promo code."
    },
    {
        "couponCode": "HAPPYFALL",
        "couponTitle": "Michael Kors Coupon: 20% Off All Orders",
        "couponDescription": "Use this offer to save an extra 20% on a selection of styles."
    },
    {
        "couponCode": "SAVE50",
        "couponTitle": "Take $50 Off Your Order",
        "couponDescription": "Enjoy $50 off when you spend $200 and more at Michael Kors."
    },
    {
        "couponCode": "BONUS",
        "couponTitle": "Extra 15% Off Select Shoes",
        "couponDescription": "Michael Kors is having a KORSVIP flash sale event for an extra 15% off select shoes when you use this promo code."
    },
    {
        "couponCode": "LYLMASTER",
        "couponTitle": "Michael Kors Discount Code: $50 Off Your Purchase",
        "couponDescription": "Save $50 off with coupon"
    },
    {
        "couponCode": "EXTRAEXTRA",
        "couponTitle": "Michael Kors Coupon Code: Extra 20% Off Your Order",
        "couponDescription": "Redeem this Michael Kors promo code during their long weekend sale for an additional 20% off savings on sale items now!"
    },
    {
        "couponCode": "OUTLET15",
        "couponTitle": "Extra 15% at Michael Kors",
        "couponDescription": "Save an extra 15% off outlet styles at Michael Kors"
    },
    {
        "couponCode": "VIP25",
        "couponTitle": "Michael Kors Sale: Extra 25% Off Your Order",
        "couponDescription": "Extra 25% off Fall Styles at Michael Kors; use this discount code to redeem as a KORSVIP member."
    },
    {
        "couponCode": "EXTRA25",
        "couponTitle": "Save 25% at Michael Kors",
        "couponDescription": "Limited Time Only: Extra 25% Off Select Sale Styles With Code"
    },
    {
        "couponCode": "GETREADY",
        "couponTitle": "Save 30% Off",
        "couponDescription": "korsvip members: enjoy 30% off on select full price items with coupon code"
    },
    {
        "couponCode": "CYBER15",
        "couponTitle": "Cyber Monday Sale: Up to 70% Off Sale + Extra 15% Off Select Styles ",
        "couponDescription": "Michael Kors is having a Cyber Monday sale with discounts of up to 70% off and an additional 15% off on select styles."
    },
    {
        "couponCode": "TAKE20",
        "couponTitle": "Save 20% on Markdowns",
        "couponDescription": "Redeem this coupon code for Michael Kors and save 20% on select markdowns, on top of savings already shown on site."
    }
]