[
    {
        "couponCode": "VIR181YS",
        "couponTitle": "Get 40% off on Stellar Recovery for Virtual Machine ",
        "couponDescription": "Redeem this Stellar Data Recovery coupon code to get 40% off on Stellar Recovery for Virtual Machine."
    },
    {
        "couponCode": "VIDEO10",
        "couponTitle": "Save 10% off Stellar Repair for Video",
        "couponDescription": "Redeem this Stellar Data Recovery promo code at checkout for 10% off Stellar Repair for Video."
    },
    {
        "couponCode": "emailoff",
        "couponTitle": "Score 10% Off",
        "couponDescription": "Shop for data recovery using this Stellar Data Recovery discount code to get 10% off your next purchase."
    },
    {
        "couponCode": "EXCEL10",
        "couponTitle": "Take 10% Off Your Order",
        "couponDescription": "Enjoy 10% off on stellar repair for excel (windows) at Stellar."
    },
    {
        "couponCode": "OUTLOOK10",
        "couponTitle": "Take 10% Off Your Purchase",
        "couponDescription": "Enjoy 10% off on stellar repair for outlook - professional (windows). Just add this code in your cart."
    },
    {
        "couponCode": "GURU10",
        "couponTitle": "Grab 10% off Everything at Stellar Info.",
        "couponDescription": "Save up to 10% off your order when you use the coupon code at checkout."
    },
    {
        "couponCode": "WIN10",
        "couponTitle": "10% off Windows Data Recovery – Standard Edition",
        "couponDescription": "Enter this Stellar Data Recovery discount code to get 10% off Windows Data Recovery  Standard Edition."
    },
    {
        "couponCode": "MAC10",
        "couponTitle": "Save 10% off Mac Data Recovery – Standard Edition",
        "couponDescription": "Apply this Stellar Data Recovery coupon code at checkout to save 10% off Mac Data Recovery  Standard Edition."
    },
    {
        "couponCode": "STELLAR10",
        "couponTitle": "Get 10% Off Your Order",
        "couponDescription": "Take 10% off on B2C products with this Stellar code."
    },
    {
        "couponCode": "BTS10",
        "couponTitle": "Stellar Data Recovery Discount Code: Save Up to 33% on Any Purchase ",
        "couponDescription": "Apply this discount code at checkout and enjoy up to a 33% discount on any purchase."
    },
    {
        "couponCode": "PHOTO10",
        "couponTitle": "Save 10% on Stellar Photo Recovery",
        "couponDescription": "Enter this Stellar Data Recovery discount code to score 10% off Stellar Photo Recovery."
    },
    {
        "couponCode": "IRECOVER",
        "couponTitle": "10% off Stellar Data Recovery for iPhone – Standard Edition",
        "couponDescription": "Use this Stellar Data Recovery coupon code at checkout to receive 10% off Stellar Data Recovery for iPhone  Standard Edition."
    },
    {
        "couponCode": "AND20",
        "couponTitle": "Get 62% Off Stellar Data Recovery ",
        "couponDescription": "Redeem this promo code at checkout and save 62% on Stellar data recovery for android."
    },
    {
        "couponCode": "EXTRA10",
        "couponTitle": "Score 10% Savings Using Promo Code",
        "couponDescription": "Take 10% off with promo code"
    },
    {
        "couponCode": "QTPWMG7",
        "couponTitle": "Stellar Data Recovery Promo Code: Extra 10% Off Your Purchase",
        "couponDescription": "Save an additional 10% when you shop sitewide using Stellar Data Recovery's discount code on your cart."
    },
    {
        "couponCode": "G5M8X2N4",
        "couponTitle": "Get 17% Off Stellar Data Recovery Software",
        "couponDescription": "Unlock 17% off Stellar Data Recovery for Windows when this coupon code is applied."
    },
    {
        "couponCode": "M2Y7K4N9",
        "couponTitle": "Get 25% Off Stellar Repair for Photo",
        "couponDescription": "Save 25% on Stellar Repair for Photo, available for both Windows and Mac. Apply this coupon code for discount and easily restore your cherished photos."
    },
    {
        "couponCode": "BACKUP50",
        "couponTitle": "Get 50% Off Using Promo Code",
        "couponDescription": "Save 50% off with discount code"
    },
    {
        "couponCode": "MACKEEPER",
        "couponTitle": "Save 50% ",
        "couponDescription": "Shop and save 50% on your next order using this promo code on your cart."
    },
    {
        "couponCode": "Y3W6N1F9",
        "couponTitle": "Stellar Independence Day Offer: Get Up to 85% Off Any Order ",
        "couponDescription": "Redeem this Stellar Data Recovery coupon code at checkout and save up to 85% on any order."
    },
    {
        "couponCode": "Techradar20",
        "couponTitle": "Save 20% Using Coupon Code",
        "couponDescription": "Take up to 20% off with coupon code"
    },
    {
        "couponCode": "R6X1J5V8R6X1J5V8",
        "couponTitle": "Stellar Data Recovery Discount Code: Save 25% on Stellar Data Recovery for Iphone Windows ",
        "couponDescription": "Apply this discount code at checkout and enjoy a 25% discount on stellar data Recovery for iphone windows."
    },
    {
        "couponCode": "Z4R8P3L6",
        "couponTitle": "Save 14% on Stellar Data Recovery for Mac ",
        "couponDescription": "Retrieve your lost data with 14% off Stellar Data Recovery for Mac. Apply this promo code for discount."
    },
    {
        "couponCode": "T9Q4M3P7",
        "couponTitle": "Stellar Data Recovery Code: 33% Off for Android Recovery",
        "couponDescription": "Make sure your data is always retrievable. Get 33% off Stellar Data Recovery for Android when this promo code is applied."
    },
    {
        "couponCode": "PDF50",
        "couponTitle": "Save 50% on Ashampoo ",
        "couponDescription": "Stellar Data Recovery is offering a voucher for 50% off Ashampoo PDF PRO 3."
    },
    {
        "couponCode": "PROMO10",
        "couponTitle": "Receive 10% Off Using Coupon",
        "couponDescription": "All shoppers can get an extra 10% discount on their order at checkout when applying this Stellar Data Recovery coupon."
    },
    {
        "couponCode": "Tyr096e",
        "couponTitle": "5% Off Your Order",
        "couponDescription": "Shop and get 5% off your purchase using a coupon code on your cart."
    },
    {
        "couponCode": "ERASE10",
        "couponTitle": "Stellar Coupon: 10% Off Your Order",
        "couponDescription": "Take 10% off Stellar file erase (windows and mac). Just add this code in your cart."
    },
    {
        "couponCode": "BEANS20",
        "couponTitle": "Save Up to 20% with Code",
        "couponDescription": "Enjoy up to 20% off your shopping cart when you apply our discount code."
    },
    {
        "couponCode": "OSTPST10",
        "couponTitle": "Take 10% Off Your Purchase",
        "couponDescription": "Receive 10% off on converter for OST corporate (windows) at Stellar."
    }
]