[
    {
        "couponCode": "CHEERS",
        "couponTitle": "Rugs USA Discount Code: Up to 25% Off Your Purchase",
        "couponDescription": "Receive up to 25% off 2+ items on your shopping cart when you apply Rugs USA's coupon code at checkout."
    },
    {
        "couponCode": "HOLIDAY",
        "couponTitle": "Rugs USA Coupon: 30% Off Your Order + Extra 25% Off Sitewide",
        "couponDescription": "Use this coupon code to get 30% off on washable rugs during RugsUSA.com's fabulous Labor Day Sale. We're also giving an incredible 25% discount sitewide."
    },
    {
        "couponCode": "CHEERS20",
        "couponTitle": "Rugs Usa Discount Code: Extra 20% Off Everything",
        "couponDescription": "Apply this Rugs USA discount code at checkout to get an extra 20% off your entire order."
    },
    {
        "couponCode": "PREVIEW",
        "couponTitle": "Rugs Usa Coupon: 25% Off Your Order",
        "couponDescription": "Take 25% off everything with this Rugs Usa code."
    },
    {
        "couponCode": "CYBER30",
        "couponTitle": "Rugs USA Coupon: 30% Off Your Purchase",
        "couponDescription": "Shop and save 30% with this promo code for orders on your cart at Rugs USA."
    },
    {
        "couponCode": "GIFT20",
        "couponTitle": "Receive 20% Off Your Purchase",
        "couponDescription": "Apply this Rugs USA promotional code at checkout to get 20% off your eligible order."
    },
    {
        "couponCode": "FLASH30",
        "couponTitle": "Extra 30% Off Everything At Rugs Usa",
        "couponDescription": "Enter this Rugs USA discount code at checkout to apply an extra 30% off your entire order."
    },
    {
        "couponCode": "CYBERWEEK",
        "couponTitle": "Enjoy 30% Off Your Purchase",
        "couponDescription": "When entering this Rugs USA discount code, you can save 30% on your qualifying order."
    },
    {
        "couponCode": "THANKS",
        "couponTitle": "Rugs USA Discount Code: Up To 25% Off Your Purchase",
        "couponDescription": "Use this Rugs USA coupon code at checkout to apply extra 20% off collabs + 25% off everything else."
    },
    {
        "couponCode": "READY",
        "couponTitle": "Rugs USA Coupon: 20% Off Your Order",
        "couponDescription": "Get ready to refresh your home this season with the \"Ready, Set, Spring Sale\" at rugsusa.com. Use the online discount code and instantly save 20% off on everything sitewide. Don't miss out on a chance to snag top products at unbeatable prices only at Rugs USA."
    },
    {
        "couponCode": "SAVE30",
        "couponTitle": "Rugs USA Coupon: £30 Off All Orders",
        "couponDescription": "Use a promo code to receive £30 off at the Rugs USA when you spend over $250."
    },
    {
        "couponCode": "HOLIDAY20",
        "couponTitle": "Rugs USA Promo Code: Up to 20% Off Your Order",
        "couponDescription": "Use this discount code at checkout to save up to 20% on your qualifying purchase."
    },
    {
        "couponCode": "EXTRA",
        "couponTitle": "Rugs USA Coupon: 20% Off Your Order ",
        "couponDescription": "Enjoy a fantastic 20% off your purchase at rugsusa.com with this coupon code. Don't miss out on the opportunity to add some stylish and high-quality rugs to your home for less."
    },
    {
        "couponCode": "FIREWORKS",
        "couponTitle": "Up to 75% Off Sitewide + Extra 30% Off Clearance Items",
        "couponDescription": "Get ready for the ultimate shopping spree at rugsusa.com with the 4th of July Preview Sale. Enjoy up to a massive 75% off sitewide, and score an additional 30% off on clearance items with this coupon code. Don't miss out on these incredible savings and transform your home with the perfect rug today."
    },
    {
        "couponCode": "EXTRA20",
        "couponTitle": "Take 20% Off Your Order",
        "couponDescription": "Enjoy extra 20% off clearance items with this Rugs USA code."
    }
]