[
    {
        "couponCode": "SAVE10",
        "couponTitle": "Take 10% Off",
        "couponDescription": "Enter this Lk Bennett coupon code at checkout to get 10% off clothing, shoes, handbags, and more."
    },
    {
        "couponCode": "LAUNEDEN15",
        "couponTitle": "Enjoy 15% Off Your Order",
        "couponDescription": "Get 15% off your order at LK Bennett with this promo code. Save on stylish clothing, shoes, and accessories. Shop now to enjoy exclusive discounts at LK Bennett."
    },
    {
        "couponCode": "ADDED10",
        "couponTitle": "Lk Bennett Coupon Code: Take Up to 10% Off Your Purchase ",
        "couponDescription": "Enjoy up to a 10% discount on your purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "Consciouscurations_15",
        "couponTitle": "15% Off Your Purchase",
        "couponDescription": "Shop at LK Bennett and take 15% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "MAISONABBOTT15",
        "couponTitle": "Lk Bennett Coupon: 15% Off Your Order",
        "couponDescription": "Take up to 15% off women's clothing and more at Lk Bennett."
    },
    {
        "couponCode": "telegraphlkb20",
        "couponTitle": "Save 20% Off with Code",
        "couponDescription": "Apply this coupon code to receive a 20% discount on your order."
    },
    {
        "couponCode": "STYLELKB20",
        "couponTitle": "Save 20% Off",
        "couponDescription": "When you use this promo code, you will receive a 20% discount on the full price."
    },
    {
        "couponCode": "MillyElizabeth1315",
        "couponTitle": "Lk Bennett Discount Code: Save 15% on Your Purchase ",
        "couponDescription": "Shop at Lk Bennett and enjoy a 15% discount on your purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "COLOURMEINSTYLE15",
        "couponTitle": "Take 15% Off Your Order",
        "couponDescription": "Enjoy 15% off sitewide by adding this Lk Bennett code."
    },
    {
        "couponCode": "LUKESOVAVERA15",
        "couponTitle": "Up to 15% Off Your Order with Coupon",
        "couponDescription": "Take up to a 15% discount on your select purchase when you apply this Lk Bennett promo code during checkout."
    },
    {
        "couponCode": "HELLOMISSJORDAN15",
        "couponTitle": "Save Up to 15% on Your Order Sitewide",
        "couponDescription": "Maximize your savings today. Enjoy up to 15% off everything at LK Bennett using this promo code. Shop now for unbeatable deals."
    },
    {
        "couponCode": "VIPFRIDAY",
        "couponTitle": "Save 30% Off Sitewide w/ Promo Code",
        "couponDescription": "Use this promo code to save up to 30% off everything sitewide."
    },
    {
        "couponCode": "FESTIVE30",
        "couponTitle": "Take 30% Off Full Priced Items",
        "couponDescription": "Enter this Lk Bennett discount code and get 30% off full priced items in your cart."
    },
    {
        "couponCode": "GRAZIA30",
        "couponTitle": "Get 30% Off",
        "couponDescription": "Shop for handbags, clothing, and more using this Lk Bennett coupon code to get 30% off your order."
    },
    {
        "couponCode": "SALE10",
        "couponTitle": "Save 50% Off w/ Discount Code",
        "couponDescription": "You can receive up to 50% off and an extra 10% off with code by using this code at checkout."
    },
    {
        "couponCode": "EXTRA10",
        "couponTitle": "Take an Extra 10% Off",
        "couponDescription": "Shop for sale items using this Lk Bennett discount code and take an additional 10% off your order."
    },
    {
        "couponCode": "BLACK25",
        "couponTitle": "Take 25% Off Sitewide",
        "couponDescription": "Redeem this Lk Bennett promo code at checkout to get up to 25% off your entire order."
    },
    {
        "couponCode": "GRAZIA25",
        "couponTitle": "Enjoy 25% Off Grazia Products",
        "couponDescription": "Shop for Grazia products at Lk Bennett and get 25% off your purchase when you apply this discount code."
    },
    {
        "couponCode": "LKBFREENEXTDAY",
        "couponTitle": "Save with Free Shipping",
        "couponDescription": "Enter this Lk Bennett promo code at checkout and get free shipping on your next purchase."
    },
    {
        "couponCode": "10Extra",
        "couponTitle": "Save 10% Off using Coupon Code",
        "couponDescription": "Apply an additional 10% off at checkout when you purchase using this discount code on your cart."
    }
]