[
    {
        "couponCode": "DISHIN",
        "couponTitle": "CardCash Discount Code: Save 5% on Any Purchase ",
        "couponDescription": "Shop at CardCash and enjoy a 5% discount on any purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "SPEEDYSAVER5",
        "couponTitle": "Card Cash Coupon: 5% Off Your Order",
        "couponDescription": "Take 5% off your Card Cash purchase with this code."
    },
    {
        "couponCode": "CARMEN10",
        "couponTitle": "Card Cash Coupon: 5% Off Your Order",
        "couponDescription": "Receive extra 5% off your Card Cash purchase with this code."
    },
    {
        "couponCode": "DOUGH",
        "couponTitle": "Save Extra 5% on Restaurant Gift Cards ",
        "couponDescription": "Apply this discount code at checkout and get an extra 5% discount on restaurant gift cards."
    },
    {
        "couponCode": "SAUCY",
        "couponTitle": "Up to 5% Off Your Order",
        "couponDescription": "Shop at CardCash and take up to 5% off your purchase of select items using a promo code on your cart."
    },
    {
        "couponCode": "FEAST",
        "couponTitle": "CardCash Discount Code: Save Extra 5% on Restaurants ",
        "couponDescription": "Apply this discount code at checkout and enjoy an extra 5% discount on restaurants."
    },
    {
        "couponCode": "FOODLOVE",
        "couponTitle": "CardCash Coupon Code: Take Up to 5% Off All Restaurants",
        "couponDescription": "Enjoy up to 5% discount on all restaurants when you enter this coupon code at checkout."
    },
    {
        "couponCode": "CCLOVE20",
        "couponTitle": "Enjoy 20% Off Your Purchase Sitewide",
        "couponDescription": "Maximize savings with this CardCash coupon at 1800Flowers and get 20% off handpicked orders throughout the site. Don't miss out on this limited-time offer - elevate your gifting experience for less now."
    },
    {
        "couponCode": "CrazyFriday",
        "couponTitle": "Take 5% Off Your Order",
        "couponDescription": "Get gift cards for your favorite places and save 5% with this CardCash coupon code."
    },
    {
        "couponCode": "PIDAY",
        "couponTitle": "CardCash Discount Code: Save Up to 3% on Your Purchase ",
        "couponDescription": "Shop at CardCash and enjoy up to a 3% discount on your purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "EATSAVINGS",
        "couponTitle": "Get 5% Off Your Purchase",
        "couponDescription": "Save at Card Cash by enjoying 5% on your order."
    },
    {
        "couponCode": "HUNGRYDEAL",
        "couponTitle": "Card Cash Coupon: 5% Off Your Order",
        "couponDescription": "Get up to 5% off select products with this Card Cash code."
    },
    {
        "couponCode": "CyberMondaySix",
        "couponTitle": "CardCash Coupon: 6% Off Your Purchase",
        "couponDescription": "Get ready to save more on your favorite brands with the special 6% off promo code at CardCash. This is a fabulous opportunity to stretch your budget further while enjoying the freedom of shopping from a vast array of retailers."
    },
    {
        "couponCode": "BLITZ",
        "couponTitle": "CardCash Coupon: 5% Off Your Order",
        "couponDescription": "Enjoy the benefits of a 5% discount on your purchases at cardcash.com Simply use this coupon code at checkout to start saving."
    },
    {
        "couponCode": "GRILL",
        "couponTitle": "5% Off Your Order",
        "couponDescription": "Shop and get 5% off your purchase using a coupon code on your cart."
    },
    {
        "couponCode": "Hero",
        "couponTitle": "Take Extra 5% Off Your Purchase ",
        "couponDescription": "Enjoy shopping and get an extra 5% discount on your purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "GUAC",
        "couponTitle": "CardCash Promo Code: 5% Off Your Order",
        "couponDescription": "Shop using CardCash's coupon code and receive 5% off all restaurants on your purchase at checkout."
    },
    {
        "couponCode": "SPOONFUL",
        "couponTitle": "Enjoy Up to 5% Off All Purchase",
        "couponDescription": "Enjoy a 5% discount on all restaurants with CardCash. Savor savings on your favorite dining experiences with this limited-time offer. Simply use the coupon code at checkout."
    },
    {
        "couponCode": "MadFive",
        "couponTitle": "CardCash Discount Code: Save Extra 5% on Your Purchase ",
        "couponDescription": "Shop at CardCash and enjoy an extra 5% discount on your purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "Workin",
        "couponTitle": "CardCash Discount Code: Save Extra 5% on Your Purchase ",
        "couponDescription": "Shop at CardCash and enjoy an extra 5% discount on your purchase. Apply this discount code at checkout."
    }
]