[
    {
        "couponCode": "MEMBER40",
        "couponTitle": "Save 40% on Unlimited Learning Subscription",
        "couponDescription": "The Blockchain Council is offering a 40% discount on individual memberships and unlimited learning subscriptions."
    },
    {
        "couponCode": "BCC10",
        "couponTitle": "Apply Coupon Code For 10% Order Discount",
        "couponDescription": "Use this coupon code at checkout and get a 10% discount on your order."
    },
    {
        "couponCode": "ILT40",
        "couponTitle": "Receive 40% Off Your Purchase",
        "couponDescription": "Get 40% off our upcoming Interactive Live Training at Blockchain Council using this discount code. Don't miss out on this exclusive opportunity to enhance your skills."
    },
    {
        "couponCode": "ILT30",
        "couponTitle": "Take Up to 15% Off Membership ",
        "couponDescription": "Enjoy up to a 15% discount on membership when you enter this coupon code at checkout."
    },
    {
        "couponCode": "FORTY",
        "couponTitle": "Get 40% Off Your Order",
        "couponDescription": "Enjoy 40% off AR & VR certifications by adding this Blockchain Council code."
    },
    {
        "couponCode": "SAVE20",
        "couponTitle": "Take 20% Off Your Purchase",
        "couponDescription": "Enjoy up to 20% off any certification, membership, or instructor-led training at Blockchain Council."
    },
    {
        "couponCode": "COUNCIL30",
        "couponTitle": "Get 30% Off Two+ Certifications With Blockchain Council Code",
        "couponDescription": "Use this Blockchain Council promo code at checkout for 30% off two or more certification purchases."
    },
    {
        "couponCode": "SEVEN",
        "couponTitle": "Blockchain Council Coupon: 40% Off Your Order",
        "couponDescription": "Take extra 40% off selected web3 and metaverse certifications at Blockchain Council."
    },
    {
        "couponCode": "LEARN20",
        "couponTitle": "20% Discount on Your Certification",
        "couponDescription": "Shop and get 20% off with a discount code on your purchase at Blockchain Council's Sitewide Sale."
    },
    {
        "couponCode": "dec15",
        "couponTitle": "Blockchain Council Coupon: 15% Off Your Order",
        "couponDescription": "Remember to apply this promo code at checkout to save 15% on your select purchase."
    },
    {
        "couponCode": "DEC10",
        "couponTitle": "Blockchain Council Discount Code: Save Up to 10% on Your Purchase ",
        "couponDescription": "Shop at Blockchain Council and enjoy up to a 10% discount on your purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "CYBERMONDAY",
        "couponTitle": "Take 40% Off Web3 Metaverse Nft and Blockchain for Business Certifications",
        "couponDescription": "Enjoy shopping and get 40% discount on web3 metaverse nft and blockchain for business certifications."
    },
    {
        "couponCode": "TREAT40",
        "couponTitle": "Blockchain Council Coupon Code: Take 40% Off Your Purchase ",
        "couponDescription": "Enjoy shopping and get 40% discount on your purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "BLACKFRIDAY",
        "couponTitle": "Blockchain Council Coupon Code: Get 40% Off Any Order",
        "couponDescription": "Use this coupon code during checkout to receive a 40% discount on your order."
    },
    {
        "couponCode": "FIFTY",
        "couponTitle": "Save Up to 50% on Any Web3 and Metaverse Certifications",
        "couponDescription": "Shop at Blockchain Council and get up to a 50% discount on any web3 and metaverse certifications. Apply this discount code at checkout."
    },
    {
        "couponCode": "BEST",
        "couponTitle": "Blockchain Council Deals: 10% Off Your Order",
        "couponDescription": "Shop and save 10% off your cart using the coupon code at Blockchain Council checkout."
    },
    {
        "couponCode": "WISDOM15",
        "couponTitle": "15% Off Any Purchase",
        "couponDescription": "Get 15% off sitewide when you apply this coupon code at Blockchain Council."
    },
    {
        "couponCode": "TREAT",
        "couponTitle": "Get 20% Off Your Order",
        "couponDescription": "Enjoy 20% off sitewide when you add this Blockchain Council code."
    },
    {
        "couponCode": "HALLOWEEN",
        "couponTitle": "Blockchain Council Promo Code: Extra 40% Off Your Order",
        "couponDescription": "Get an extra 40% off your purchase using a coupon code on your cart."
    },
    {
        "couponCode": "DEV30",
        "couponTitle": "Blockchain Council Promo Code: Extra 30% Off Your Order",
        "couponDescription": "Shop and take an extra 30% off your purchase using a discount code at checkout."
    }
]