[
    {
        "couponCode": "slick15",
        "couponTitle": "adidas Coupon Code: Extra 25% Off Your Order ",
        "couponDescription": "Receive an additional 25% off your adidas order when this coupon code is applied to your cart at checkout."
    },
    {
        "couponCode": "SAVE",
        "couponTitle": "adidas Promo Code: Get Up to 60% Off",
        "couponDescription": "Apply this adidas promo code at checkout and save up to 60% on qualifying purchases."
    },
    {
        "couponCode": "MFHSADP19",
        "couponTitle": "adidas Coupon: Get 20% Off Your Purchase ",
        "couponDescription": "Enjoy a 20% discount on your purchase at adidas when you apply this coupon code at checkout."
    },
    {
        "couponCode": "ADP22GCHS",
        "couponTitle": "Up to 15% Off Your Purchase at adidas",
        "couponDescription": "Apply this adidas promo code at checkout and enjoy savings of up to 15% on select items."
    },
    {
        "couponCode": "ADP18NHS",
        "couponTitle": "Adidas Discount: Get 15% Off Your Order",
        "couponDescription": "Save big at Adidas by getting 15% on shoes when this discount code is applied to your cart."
    },
    {
        "couponCode": "OFF15",
        "couponTitle": "adidas Discount Code: Extra 15% Off Your Order",
        "couponDescription": "Take an additional 15% off on thousands of items at adidas when this promo code is applied at checkout."
    },
    {
        "couponCode": "WORKOUT",
        "couponTitle": "adidas Coupon Code: Get 20% Off Your Order",
        "couponDescription": "Enjoy a 20% discount on workout styles when this adidas promo code is applied at checkout."
    },
    {
        "couponCode": "CYBER",
        "couponTitle": "adidas Cyber Monday Sale: Get an Extra 40% Off ",
        "couponDescription": "Apply this adidas coupon code to get an additional 40% off full-price and sale styles during Cyber Monday, excluding select items."
    },
    {
        "couponCode": "BIGDEAL",
        "couponTitle": "adidas Promo Code: Up to 60% Off Your Order",
        "couponDescription": "Take up to 60% off a ton of styles when you use this adidas promo code at checkout."
    },
    {
        "couponCode": "SAVINGS",
        "couponTitle": "adidas Promo Code: Get 60% Off + Extra 30% Off",
        "couponDescription": "Enjoy up to 60% off thousands of items, plus, get an extra 30% off on full-priced and sale items when you use this code at checkout."
    },
    {
        "couponCode": "BIGSALE",
        "couponTitle": "adidas Coupon: AdiClub Members Get Up to 65% Off",
        "couponDescription": "Heads up, online discount shoppers. Adidas.com is offering up to 65% off to AdiClub members in their Early President's Day Sale. This is the perfect chance to snatch your favorite items at unbeatable prices."
    },
    {
        "couponCode": "FALLDEAL",
        "couponTitle": "adidas Promo Code: Save 30% on Your Order",
        "couponDescription": "Apply this adidas coupon code to receive 30% off on full price and sale items."
    },
    {
        "couponCode": "COUPONSCOM15",
        "couponTitle": "adidas Promo Code: Get $15 Off Your Order",
        "couponDescription": "Receive $15 off on qualifying purchases at adidas when this discount code is applied at checkout."
    },
    {
        "couponCode": "SAVE30",
        "couponTitle": "adidas Coupon: $30 Off Your Order",
        "couponDescription": "Score big with their dazzling $30 off promo code for adidas. Don't miss out on this golden opportunity to save on top-notch products at adidas, from high-performance workout gear to trendy streetwear styles."
    },
    {
        "couponCode": "DECEMBER",
        "couponTitle": "Get Up to 40% Off with adidas Coupon ",
        "couponDescription": "Shop for athletic clothing, footwear, and more with this adidas promo code and get up to  40% off sitewide."
    },
    {
        "couponCode": "KIDS",
        "couponTitle": "Extra 30% Off Select Kids Styles ",
        "couponDescription": "Upgrade your kids wardrobe for the next school year and score an additional 30% off eligible kids styles at adidas."
    },
    {
        "couponCode": "SEELINK",
        "couponTitle": "adidas Coupon: Up to 60% Off Your Purchase",
        "couponDescription": "Save up to 60% at adidas and find the perfect gifts with styles that are sure to impress! No code required for discounts on popular 3-Stripes styles."
    },
    {
        "couponCode": "DNEWS15",
        "couponTitle": "15% Off Your Order",
        "couponDescription": "Shop and get 15% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "HOTDEAL",
        "couponTitle": "adidas Promo Code: Get 25% Off Sale",
        "couponDescription": "Redeem this adidas promo code at checkout and save 25% off of sale items."
    }
]