[
    {
        "couponCode": "UK12ALL",
        "couponTitle": "Up to 99% Off Sitewide + Additional 12% Discount",
        "couponDescription": "Get ready to revamp your wardrobe with PrettyLittleThing.com's sensational sale. Enjoy a massive discount of up to 99% off across the entire site, and as an added bonus, grab an extra 12% off on your purchases. It's time to shop till you drop without breaking the bank."
    },
    {
        "couponCode": "UK22ALL",
        "couponTitle": "PrettyLittleThing Coupon: 22% Off Your Purchase",
        "couponDescription": "Enjoy a remarkable 22% discount on all your purchases at prettylittlething.com with their sitewide coupon code. This incredible offer allows you to shop for your favorite fashion items at a fraction of the cost. Simply enter the coupon code at checkout and relish in the savings."
    },
    {
        "couponCode": "NEW20",
        "couponTitle": "Pretty Little Thing Coupon: 20% Off Your Order",
        "couponDescription": "Take 20% off your Pretty Little Thing purchase with this code."
    },
    {
        "couponCode": "Royal20",
        "couponTitle": "Save 20% on Any Purchase ",
        "couponDescription": "Shop at PLT and get a 20% discount on any purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "GET40",
        "couponTitle": "PLT Coupon: 40% Off Your Order",
        "couponDescription": "Save big at PLT by getting 40% on women's clothing."
    },
    {
        "couponCode": "VC15ALL",
        "couponTitle": "Take 15% Off at PrettyLittleThing",
        "couponDescription": "Apply this coupon to receive a 15% discount on your first purchase."
    },
    {
        "couponCode": "BF10",
        "couponTitle": "Enjoy Up to 10% Off Your Order",
        "couponDescription": "Save up to 10% on your order with this promo code at PrettyLittleThing. Shop now and enjoy discounts on the latest styles. Don't miss out on this limited-time offer."
    },
    {
        "couponCode": "BF40",
        "couponTitle": "PLT Coupon: 40% Off Your Order",
        "couponDescription": "Take 40% off women's clothing, shoes and accessories with this PLT code."
    },
    {
        "couponCode": "NEW10",
        "couponTitle": "PLT Discount Code: Extra 10% Off Your Order",
        "couponDescription": "Enjoy an additional 10% discount on your first purchase when you apply this coupon code at checkout."
    },
    {
        "couponCode": "UK18ALL",
        "couponTitle": "Save 40% Off",
        "couponDescription": "Receive 40% to 90% off and extra 18% Discount"
    },
    {
        "couponCode": "royv24",
        "couponTitle": "PLT Discount Code: Up to 12% Off Your Purchase",
        "couponDescription": "Receive up to 12% off sitewide orders on your shopping cart when you apply PLT's coupon code at checkout."
    },
    {
        "couponCode": "EXTRA10",
        "couponTitle": "Get 10% Off New Arrivals",
        "couponDescription": "Receive extra 10% off your Pretty Little Thing purchase with this code."
    },
    {
        "couponCode": "NEW15",
        "couponTitle": "PrettyLittleThing Promo Code: Extra 15% Off Your Order",
        "couponDescription": "Shop and receive an additional 15% off orders with PrettyLittleThing's promo code on your cart."
    },
    {
        "couponCode": "UK10ALL",
        "couponTitle": "Additional 10% Off at PrettyLittleThing",
        "couponDescription": "Save an extra 10% on your order by applying this promo code at checkout."
    },
    {
        "couponCode": "BFSURPRISE",
        "couponTitle": "PrettyLittleThing Coupon: Claim Your Mystery Black Friday Discount",
        "couponDescription": "Use this coupon code this Black Friday at prettylittlething.com and claim your Mystery Black Friday discount."
    },
    {
        "couponCode": "VCSURPRISE",
        "couponTitle": "PrettyLittleThing Coupon: Up to 40% Off Your Order, Plus an Extra 12% Off ",
        "couponDescription": "This Black Friday, get up to 40% off sitewide, plus an extra 12% off on almost everything when you use this coupon code at prettylittlething.com."
    },
    {
        "couponCode": "VC12ALL",
        "couponTitle": "PrettyLittleThing Promo Code: 12% Off All Orders",
        "couponDescription": "Get ready to save big at PrettyLittleThing with this promo code. Enjoy a generous 12% discount on all your orders. From trendy dresses to chic accessories, shop now and score amazing deals. Don't miss outupgrade your wardrobe today."
    },
    {
        "couponCode": "UK42ALL",
        "couponTitle": "Early Black Friday Sale - 42% Off Everything",
        "couponDescription": "*Excl Beauty and Sale"
    },
    {
        "couponCode": "UK8ALL",
        "couponTitle": "Up To 10% Off Orders At PrettyLittleThing",
        "couponDescription": "Enter this PrettyLittleThing promo code at checkout to enjoy up to 10% off your orders."
    }
]