[
    {
        "couponCode": "NYE",
        "couponTitle": "Daniel Wellington Coupon: $1,000 Off Your Order",
        "couponDescription": "Take $1,000 off when you add this Daniel Wellington code."
    },
    {
        "couponCode": "XMAS3",
        "couponTitle": "Daniel Wellington Discount Code: Save 90% on Your Purchase ",
        "couponDescription": "Shop at Daniel Wellington and enjoy a 90% discount on your purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "TOLD",
        "couponTitle": "Daniel Wellington Discount Code: Save 16% on Your Purchase ",
        "couponDescription": "Shop at Daniel Wellington and enjoy a 16% discount on your purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "XMAS2025",
        "couponTitle": "Receive Up to 25% Off Your Order Sitewide",
        "couponDescription": "Get up to 25% off your order sitewide at Daniel Wellington with this coupon code. Shop now and save on your favorite items. This is a limited-time offer, so don't miss out."
    },
    {
        "couponCode": "GIORGIA30",
        "couponTitle": "Take 30% Off Your Order",
        "couponDescription": "Enjoy an extra 30% off sitewide by adding this Daniel Wellington code."
    },
    {
        "couponCode": "DEC25DISCOUNT",
        "couponTitle": "Save 25% on Any Purchase ",
        "couponDescription": "Shop at Daniel Wellington and get a 25% discount on any purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "XMAS1",
        "couponTitle": "Get 99% Off Your Order",
        "couponDescription": "Enjoy 99% off sitewide and free xmas gift and more at Daniel Wellington."
    },
    {
        "couponCode": "EMBER",
        "couponTitle": "Get 16% Off Your Order",
        "couponDescription": "Take up to 16% off sitewide by adding this Daniel Wellington code."
    },
    {
        "couponCode": "DWW",
        "couponTitle": "Get 65% Off Your Purchase",
        "couponDescription": "Enjoy 65% off sitewide and free shipping with this Daniel Wellington code."
    },
    {
        "couponCode": "EXTRA15",
        "couponTitle": "Take 15% Off Your Order",
        "couponDescription": "Enjoy extra 15% off your Daniel Wellington purchase with this code."
    },
    {
        "couponCode": "FLIP",
        "couponTitle": "Take 99% Off Your Purchase",
        "couponDescription": "Enjoy 99% off sitewide and free gift and free shipping with this Daniel Wellington code."
    },
    {
        "couponCode": "BOLD",
        "couponTitle": "Daniel Wellington Promo Code: Get 75% Off Your Order ",
        "couponDescription": "Redeem this promo code at checkout and save 75% on your order."
    },
    {
        "couponCode": "NERVR",
        "couponTitle": "Get $500 Off + Free Gift Set + Free Shipping",
        "couponDescription": "Save $500 and get a free Women's Jewellery Gift Set with your purchase at Daniel Wellington. Enjoy free shipping on all orders when you use this coupon code. Shop now and make the most of this limited-time offer."
    },
    {
        "couponCode": "DWONE",
        "couponTitle": "Take $200 Off Your Order",
        "couponDescription": "Get $200 off sitewide by adding this Daniel Wellington code."
    },
    {
        "couponCode": "SHIPP",
        "couponTitle": "Take  $200 Off Your Order",
        "couponDescription": "Enjoy $200 off your Daniel Wellington purchase with this code."
    },
    {
        "couponCode": "TUCK",
        "couponTitle": "Save Up to 99% on Any Purchase ",
        "couponDescription": "Shop at Daniel Wellington and get up to a 99% discount on any purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "500OFF",
        "couponTitle": "Receive $500 Off Your Order Sitewide",
        "couponDescription": "Save $500 on your entire order at Daniel Wellington using this coupon code. Shop stylish watches and accessories for less. Hurry, this deal won't last long."
    },
    {
        "couponCode": "WELCOMEDW",
        "couponTitle": "Score 10% Off",
        "couponDescription": "Apply this Daniel Wellington discount code to your cart and receive 10% off your entire purchase."
    },
    {
        "couponCode": "HELLO",
        "couponTitle": "Daniel Wellington Promo Code: 99% Off + Free Shipping & Gift",
        "couponDescription": "Shop and take 99% off your purchase plus free shipping and a free gift using a coupon code at checkout."
    },
    {
        "couponCode": "NOVEMBER500",
        "couponTitle": "Daniel Wellington Promo Code: $500 Off Your Order",
        "couponDescription": "Take $500 off your purchase using a discount code on your cart."
    }
]