[
    {
        "couponCode": "EXTRA20",
        "couponTitle": "Kate Spade Outlet Coupon Code: 20% Off",
        "couponDescription": "Redeem this Kate Spade Outlet discount code at checkout to get 20% off your purchase."
    },
    {
        "couponCode": "CLEARANCE25",
        "couponTitle": "Save 25% Off w/ Promo Code",
        "couponDescription": "When you use this Kate Spade Outlet promotional code at checkout, you will receive an additional 25% off your eligible order."
    },
    {
        "couponCode": "SAVE25",
        "couponTitle": "Take $25 Off",
        "couponDescription": "Save $25 off on Orders $150 or more"
    },
    {
        "couponCode": "SITEWIDE",
        "couponTitle": "Kate Spade Outlet Coupon: 25% Off Your Order",
        "couponDescription": "Use this Kate Spade Outlet discount code to enjoy 25% off your entire purchase. Explore chic handbags, trendy accessories, and delightful apparel."
    },
    {
        "couponCode": "MAKEITTWO",
        "couponTitle": "Save 70% Off Sitewide Using Code",
        "couponDescription": "Use this promo code to get up to 70% off everything+an extra 20% off select styles sitewide."
    },
    {
        "couponCode": "WEEKEND20",
        "couponTitle": "Save 70% Off",
        "couponDescription": "a reason to celebrate! get up to 70% off and an extra 20% off almost everything, including clearance with coupon code"
    },
    {
        "couponCode": "vip10",
        "couponTitle": "Take 55% Off Your Purchase",
        "couponDescription": "Shop for jewelry, shoes, clothing, and more using this Kate Spade Outlet promo code and get 55% off."
    },
    {
        "couponCode": "SUMMER20",
        "couponTitle": "Take Up to 70% Off Your Order",
        "couponDescription": "Enjoy up to 70% off your purchase plus an extra 20% off almost everything when you redeem this Kate Spade Outlet coupon."
    },
    {
        "couponCode": "SAVE15",
        "couponTitle": "15% Off Using Kate Spade Outlet Discount Code",
        "couponDescription": "Shop for bags, accessories, wallets, and more using this Kate Spade Outlet discount code for 15% off."
    },
    {
        "couponCode": "CLEARANCE20",
        "couponTitle": "Kate Spade Outlet Promo Code: Extra 20% Off",
        "couponDescription": "Get an additional 20% off sale items when you enter this Kate Spade Outlet coupon code at checkout."
    },
    {
        "couponCode": "SELECT20",
        "couponTitle": "Enjoy 20% Off Your Order at Kate Spade Outlet",
        "couponDescription": "Shop for bags, shoes, jewelry, and more with this Kate Spade Outlet coupon code and save 20% off."
    },
    {
        "couponCode": "TAKEYOURPICK",
        "couponTitle": "20% Off with Kate Spade Outlet Coupon Code",
        "couponDescription": "Score 20% off your order of bags, jewelry, and more with this Kate Spade Outlet promo code."
    },
    {
        "couponCode": "EXTRA25",
        "couponTitle": "Up to 70% Off Sitewide with Code",
        "couponDescription": "Save up to 70% off your order plus an extra 25% off 1000+ styles when you enter this Kate Spade Outlet coupon code at checkout."
    },
    {
        "couponCode": "CYBER",
        "couponTitle": "Save 70% Off Sitewide",
        "couponDescription": "Use this promo code to save up to 70% off + an extra 25% off everything sitewide."
    },
    {
        "couponCode": "EXTRA",
        "couponTitle": "Take $25 Off with Code",
        "couponDescription": "get $25 off your $150+ orders using the promo code25 at checkout."
    },
    {
        "couponCode": "BLACKFRIDAY",
        "couponTitle": "Kate Spade Outlet Coupon: Up to 70% Off Your Order, Plus an Extra 25% Off Everything ",
        "couponDescription": "Use this coupon code to enjoy up to 70% off sitewide, plus an extra 25% off everything. Shop at Kate Spade Outlet for chic, affordable fashion."
    },
    {
        "couponCode": "SINGLE11",
        "couponTitle": "Kate Spade Outlet Coupon: Up to 70% Off Your Order + Extra 25% Off + 11% Off Sitewide",
        "couponDescription": "Use this coupon code to enjoy up to 70% off your order, plus an additional 25% off on select items. Also, grab an extra 11% off sitewide at katespadeoutlet.com."
    },
    {
        "couponCode": "EXTRA15",
        "couponTitle": "Kate Spade Outlet Coupon: 15% Off Your Order + 20% Off ",
        "couponDescription": "Shop the Kate Spade Outlet with this coupon code and enjoy an extra 15% off sitewide, plus a fabulous 20% off select styles."
    },
    {
        "couponCode": "EARLYBIRD",
        "couponTitle": "Kate Spade Outlet Coupon: Up to 70% Off Your Order + Extra 25% Off Almost Everything ",
        "couponDescription": "Get up to 70% off plus an extra 25% off almost everything at katespadeoutlet.com. Just use this coupon code to refresh your wardrobe and accessories with stylish finds at unbeatable prices."
    },
    {
        "couponCode": "EXTRA125",
        "couponTitle": "Take $125 Off",
        "couponDescription": "Save $125 off with code"
    }
]