[
    {
        "couponCode": "HM12",
        "couponTitle": "up to 70% + Free Shipping At Botanic Choice",
        "couponDescription": "Use this Botanic Choice coupon code at checkout to take up to 70% off your orders plus Free Shipping."
    },
    {
        "couponCode": "SSL24",
        "couponTitle": "Botanic Choice Coupon: Up to 55% Off Your Order",
        "couponDescription": "Take up to 55% off orders when you purchase with a promo code on your cart at Botanic Choice."
    },
    {
        "couponCode": "TS24",
        "couponTitle": "Botanic Choice Promo Code: Up to $20 Off Your Purchase",
        "couponDescription": "Save up to $20 on your next purchase at Botanic Choice with this promo code. Enjoy great discounts on high-quality health and wellness products. Dont miss out on this chance to shop smart and save big today."
    },
    {
        "couponCode": "DEMAND15",
        "couponTitle": "Score 15% Off Your Order",
        "couponDescription": "Place a total order of $50 or more to receive 15% off your select purchase. To qualify, enter this Botanic Choice coupon at checkout."
    },
    {
        "couponCode": "AFFILIATEEG",
        "couponTitle": "Get 15% Off Orders Over $50+ ",
        "couponDescription": "Get a 15% discount on your order of botanic choice and botanic spa items when you spend over $50. Paste this promo code at checkout."
    },
    {
        "couponCode": "GY24",
        "couponTitle": "Botanic Choice Coupon: Free Gift on Your Purchase",
        "couponDescription": "Receive 3 free samples on your storewide orders with Botanic Choice's promo code. Redeem at checkout."
    },
    {
        "couponCode": "MBC151X",
        "couponTitle": "Botanic Choice Coupon: Take 15% Off Any Order",
        "couponDescription": "Enjoy 15% off your purchase when you spend $35 at Botanic Choice."
    },
    {
        "couponCode": "15secret",
        "couponTitle": "Botanic Choice Coupon Code: 15% Off Your Order Sitewide",
        "couponDescription": "Save 15% on your entire order at Botanic Choice with this exclusive coupon code. Enjoy discounts on a wide range of products sitewide. Shop now and take advantage of this limited-time offer."
    },
    {
        "couponCode": "ES24",
        "couponTitle": "Botanic Choice Coupon: 65% Off Your Order",
        "couponDescription": "Get up to 65% off essential oils with this Botanic Choice code."
    },
    {
        "couponCode": "FLASH3X",
        "couponTitle": "Earn A Triple Points On Your Order",
        "couponDescription": "Earn an triple points on your purchase with this Botanic Choice code."
    },
    {
        "couponCode": "LIQUID24",
        "couponTitle": "Botanic Choice Promo Code: $5 Off + Free Shipping",
        "couponDescription": "Apply $5 off + free shipping at checkout when you purchase sitewide orders over $50+ using Botanic Choice's discount code on your cart."
    },
    {
        "couponCode": "CD24",
        "couponTitle": "Botanic Choice Coupon Code: Take 24% Off Your Order ",
        "couponDescription": "Apply this coupon code at checkout and enjoy a 24% discount on your order."
    },
    {
        "couponCode": "HE24",
        "couponTitle": "Botanic Choice Promo Code: Take 15% Off Your Order ",
        "couponDescription": "Apply this promo code at checkout and receive a 15% discount on your order."
    },
    {
        "couponCode": "IMH24",
        "couponTitle": "Botanic Choice Discount Code: Up to 53% Off Your Purchase",
        "couponDescription": "Visit Botanic Choice and get up to 53% off orders with this coupon code on your cart at checkout."
    },
    {
        "couponCode": "CB24",
        "couponTitle": "Take 36% Off Your Order",
        "couponDescription": "Save at Botanic Choice by getting up to 36% on your purchase."
    },
    {
        "couponCode": "SHIP23",
        "couponTitle": "Get Free Shipping on Any Purchase",
        "couponDescription": "Get ready to blossom with wellness as Botanic Choice brings you an irresistible deal. Unlock the natural goodness of premium-quality vitamins, herbs, and nutritional supplements with the promo code for free shipping on any purchase. It's time to sprout new vitality and radiate health from within as you explore the wide range of products crafted for your unique wellness journey. Embrace the botanical power that has been trusted for generations and let Botanic Choice be your partner in achieving optimal health."
    },
    {
        "couponCode": "FALL70",
        "couponTitle": "Botanic Choice Promo Code: Up to 70% Off Your Order",
        "couponDescription": "Use this discount code at checkout to save up to 70% on your qualifying purchase."
    },
    {
        "couponCode": "VETS",
        "couponTitle": "Get 70% Off Your Purchase",
        "couponDescription": "Take 70% off your order on veterans day sale at Botanic Choice."
    },
    {
        "couponCode": "BX2410",
        "couponTitle": "Get Up to 10% Off BXGX",
        "couponDescription": "Paste this promo code at checkout and save up to 10% on BXGX."
    },
    {
        "couponCode": "HBD24",
        "couponTitle": "Botanic Choice Coupon: $10 Off Your Order of $50+",
        "couponDescription": "This Botanic Choice discount code gets you $10 off on your current purchase. It's an excellent opportunity to save on a vast range of natural remedies, herbal supplements, and vitamins available at botanicchoice.com."
    }
]