[
    {
        "couponCode": "LAK23",
        "couponTitle": "Wingstop Discount Code: Free Gift on Your Order",
        "couponDescription": "Shop at Wingstop and receive a free gift using this coupon code on your cart."
    },
    {
        "couponCode": "DELIVER5BW",
        "couponTitle": "Get 5 Free Boneless Wings On Delivery Orders",
        "couponDescription": "Score 5-pc free boneless wings with any wing purchase on delivery orders at Wingstop."
    },
    {
        "couponCode": "BOGOSAMMY",
        "couponTitle": "WingStop Promo Code:  Buy 1 Get 1 Free",
        "couponDescription": "Enjoy buy 1 get 1 free chicken sandwich at WingStop with this promo code."
    },
    {
        "couponCode": "SALE10",
        "couponTitle": "Wing Stop Coupon: 10% Off Your Order",
        "couponDescription": "Take 10% off sitewide when you use this Wing Stop code."
    },
    {
        "couponCode": "FREESAMMY",
        "couponTitle": "Get Free Chicken Sandwich on Any Chicken ",
        "couponDescription": "Paste this promo code at checkout and get a free chicken sandwich on any chicken."
    },
    {
        "couponCode": "5FREEDLV",
        "couponTitle": "Receive 5% Off Your Order",
        "couponDescription": "Use this Wingstop promotional code during checkout to get 5% off your qualifying purchase."
    },
    {
        "couponCode": "FREEWINGS",
        "couponTitle": "WingStop Coupon Code: Free Wings with Purchase",
        "couponDescription": "Enjoy free wings on national wing day when you use this Wing Stop coupon code. Savor the mouthwatering flavors of their delicious wings and other delectable menu items."
    },
    {
        "couponCode": "5CREDIT",
        "couponTitle": "WingStop Discount Code: $5 Off First 5 Orders",
        "couponDescription": "Satisfy your cravings while saving big on your first five orders at Wing Stop. Enjoy $5 off your first 5 orders with this promo code."
    },
    {
        "couponCode": "49JF9",
        "couponTitle": "30% Off Any Catering Orders $300",
        "couponDescription": "Score up to 30% off any catering orders over $300 at Wingstop."
    },
    {
        "couponCode": "49JF9JWW",
        "couponTitle": "$3 Off Any $300+ Order On Chicken Wings, Drinks, Desserts and More",
        "couponDescription": "Score up to $3 off any $300 or more orders on chicken wings, drinks, desserts, and more at Wingstop."
    },
    {
        "couponCode": "LAK22",
        "couponTitle": "5 Free Boneless Wings with WingStop Promo Code",
        "couponDescription": "Score 5 free boneless wings with any wing purchase at participating Southern California Wingstop locations when the Lakers win on the road or play Sunday home games with sign-up, only at Wingstop."
    },
    {
        "couponCode": "DELIVERY100",
        "couponTitle": "Get Extra $100 Off Fast Food Orders",
        "couponDescription": "Score up to an extra $100 off fast food orders such as chicken wings, sides, dips & flavours, drinks and desserts at Wingstop."
    },
    {
        "couponCode": "RMN100",
        "couponTitle": "Get $100 Delivery Fee Credits For New Postmates Customers",
        "couponDescription": "Get Wingstop delivered by Postmates and score $100 in delivery fee credits for new Postmates customers at Wingstop."
    },
    {
        "couponCode": "Nashville residents",
        "couponTitle": "Nashville Residents: Get Free delivery On Orders $100+",
        "couponDescription": "score free delivery on orders over $100 for  at wingstop."
    }
]