[
    {
        "couponCode": "Welcome7",
        "couponTitle": "Take 7% Off with Clothing Shop Online Coupon",
        "couponDescription": "Paste this code before finalizing your purchase to receive a 7% discount at clothingshoponline.com."
    },
    {
        "couponCode": "CYBERMON15",
        "couponTitle": "Clothing Shop Online Discount Code: 15% Off Your Order",
        "couponDescription": "Shop and take 15% off your purchase using a promo code at checkout"
    },
    {
        "couponCode": "CYBERMON12",
        "couponTitle": "Save 12% Off Sitewide",
        "couponDescription": "Use this promo code to save up to 12% off $80 sitewide."
    },
    {
        "couponCode": "EOY10",
        "couponTitle": "Save 10% Off",
        "couponDescription": "Redeem this promo code at checkout and save an extra 10% on closeouts."
    },
    {
        "couponCode": "5OFF4ME",
        "couponTitle": "Up to 10% Off Your Purchase",
        "couponDescription": "Take up to a 10% discount on your order when you apply this promo code at clothingshoponline.com."
    },
    {
        "couponCode": "EMAILCLOSEOUTS",
        "couponTitle": "Save 10% Off with Code",
        "couponDescription": "Save an additional 10% on your qualifying order when using this Clothing Shop Online promotional code at checkout."
    },
    {
        "couponCode": "LABORYAYTEN",
        "couponTitle": "Save 10% Off",
        "couponDescription": "Enjoy shopping and get a 10% discount on orders of $80 or more when you enter this coupon code at checkout."
    },
    {
        "couponCode": "wknd070824",
        "couponTitle": "Get 5% Off on Any Order Sitewide",
        "couponDescription": "Paste this code during the checkout procedure and save 5% on any order at clothingshoponline.com."
    },
    {
        "couponCode": "OOPS5OFF",
        "couponTitle": "Extra 5% Off Your Order",
        "couponDescription": "Enjoy an additional 5% when you enter this promo code at checkout."
    },
    {
        "couponCode": "EXTRA10",
        "couponTitle": "Save 10% Off with Code",
        "couponDescription": "Enjoy an extra 10% off your qualifying order at checkout when this Clothing Shop Online promotional code is applied."
    },
    {
        "couponCode": "LABORTWELVE",
        "couponTitle": "Save 12% Off",
        "couponDescription": "Shop at Clothing Shop Online and enjoy a 12% discount on orders of $200 or more. Apply this discount code at checkout."
    },
    {
        "couponCode": "HY10",
        "couponTitle": "Clothing Shop Online Promo Code: Up to 10% Off Your Order",
        "couponDescription": "Save up to 10% on select items with this promo code at Clothing Shop Online. Discover stylish outfits at great prices with this limited-time offer. Shop now and enjoy big savings on trendy fashion pieces."
    },
    {
        "couponCode": "MAKEITYOURS",
        "couponTitle": "Save Up to 25% Off Your Purchase",
        "couponDescription": "Add this promo code when you checkout to get up to 25% off your purchase at Clothing Shop Online."
    },
    {
        "couponCode": "MELTDOWN",
        "couponTitle": "Clothing Shop Online Coupon: 10% Off Your Purchase",
        "couponDescription": "Save 10% on t-shirts, sweatshirts and more at Clothing Shop Online."
    },
    {
        "couponCode": "TAKE12",
        "couponTitle": "Clothing Shop Online Promo Code: Extra 12% Off Your Order",
        "couponDescription": "For a limited time, Clothing Shop Online is offering an extra 12% discount when you redeem this code at checkout."
    },
    {
        "couponCode": "CYBERMON20",
        "couponTitle": "Save 20% Off Sitewide",
        "couponDescription": "Use this promo code to save up to 20% off $450 sitewide."
    },
    {
        "couponCode": "12DAYS",
        "couponTitle": "Clothing Shop Online Promo Code: 20% Off",
        "couponDescription": "Shop and receive 20% off using this discount code on your storewide purchase at Clothing Shop Online."
    },
    {
        "couponCode": "BLACKFRIDAY20",
        "couponTitle": "Save 20% Off",
        "couponDescription": "Receive 20% off on your $450 purchase at clothingshoponline.com."
    },
    {
        "couponCode": "CSOAFF7OFF",
        "couponTitle": "7% Off Your First Purchase",
        "couponDescription": "Save big on your first purchase at Clothing Shop Online with this 7% off discount code. Whether you're looking for trendy t-shirts or cozy sweatpants, this promotion applies to all your fashion needs."
    },
    {
        "couponCode": "CAPITALCSO",
        "couponTitle": "Get 7% Off Your Order with Discount Code",
        "couponDescription": "Enjoy 7% off your Clothing Shop Online purchase with this code."
    }
]