[
    {
        "couponCode": "GISELLE10",
        "couponTitle": "Braun Coupon: Extra 10% Off Your Order",
        "couponDescription": "Take an additional 10% off epilators when you purchase with a promo code on your cart at Braun."
    },
    {
        "couponCode": "ENJOY15",
        "couponTitle": "Take 15% Off Electric Shavers, Razors and More at Braun",
        "couponDescription": "Get 15% off your next order of shaving supplies with this sitewide Braun offer."
    },
    {
        "couponCode": "SMOOTH100",
        "couponTitle": "Take $100 Off Your Purchase",
        "couponDescription": "Save $100 on skin iexpert smart IPL with this Braun code."
    },
    {
        "couponCode": "SMOOTH15",
        "couponTitle": "Take 15% Off Any Order",
        "couponDescription": "Save 15% on your first purchase at Braun."
    },
    {
        "couponCode": "first10",
        "couponTitle": "Get 10% Off Your First Online Order with Braun Promo Code",
        "couponDescription": "Sign up for Braun's email list, the retailer will thank you with a 10% discount code. Redeem this code to save on IPL devices, trimmers and other shaving necessities."
    },
    {
        "couponCode": "HELLO10",
        "couponTitle": "Save 10% Sitewide with Braun Email Signup",
        "couponDescription": "Join the Braun email newsletter to receive a 10% discount code. Apply this offer during checkout to unlock savings."
    },
    {
        "couponCode": "BRA836R81G",
        "couponTitle": "Get Up to 23% Off Any Order",
        "couponDescription": "Enjoy up to a 23% discount on your order when you enter this promo code during checkout."
    },
    {
        "couponCode": "SAVE10NOW",
        "couponTitle": "Save up to 10% on Electric Shavers, IPL Devices, Parts ",
        "couponDescription": "Use this Braun coupon at checkout and take up to 10% off your next order of shaving supplies."
    },
    {
        "couponCode": "SILKEXPERT10",
        "couponTitle": "Get up to 10% Off Your Next Braun Trimmer Purchase",
        "couponDescription": "Redeem this Braun coupon code to save up to 10% on electric shavers, trimmers and more."
    },
    {
        "couponCode": "GOPRO",
        "couponTitle": "Up to 10% Off Sitewide Braun Shaver Discount ",
        "couponDescription": "Braun is offering sitewide discounts up to 10%, all you need to do is enter this coupon code before checking out."
    },
    {
        "couponCode": "KurtKnows10",
        "couponTitle": "Receive 10% Off Your Order",
        "couponDescription": "Enter this promo code at braun.com to get an extra 10% discount on your online purchases."
    },
    {
        "couponCode": "FLASH60",
        "couponTitle": "Get up to 20% Off Top-Selling Braun Electric Shavers",
        "couponDescription": "Receive up to 20% off electric shavers and trimmers when you apply this coupon code at checkout."
    },
    {
        "couponCode": "ami",
        "couponTitle": "Take 10% Off Eligible Braun Orders with Coupon Code",
        "couponDescription": "You can't put a price on a clean shave  but you can snag a sweet 10% discount on a Braun electric shaver with this coupon."
    }
]