[
    {
        "couponCode": "ERICA15",
        "couponTitle": "Harper Wilde Promo Code: 15% Off Your Order",
        "couponDescription": "When this coupon code is applied during checkout, you can receive 15% off your eligible purchase."
    },
    {
        "couponCode": "Jen15",
        "couponTitle": "Harper Wilde Promo Code: Save 15% on Your Order",
        "couponDescription": "Use this discount code at checkout for 15% off on your Harper Wilde purchase."
    },
    {
        "couponCode": "SNAILMAIL",
        "couponTitle": "Harper Wilde Promo Code: Get 20% Off Any Order ",
        "couponDescription": "Redeem this promo code at checkout and save 20% on any order."
    },
    {
        "couponCode": "SIMPLYCODES10",
        "couponTitle": "Harper Wilde Coupon: Get 10% Off Your Order",
        "couponDescription": "Stock up on affordable underwear at Harper Wilde and save 10% on your order when this code is applied."
    },
    {
        "couponCode": "WELCOME5",
        "couponTitle": "Get 10% Off at Harper Wilde ",
        "couponDescription": "Use this Harper Wilde coupon code to score up to 10% off at checkout."
    },
    {
        "couponCode": "RECYCLEREFRESH",
        "couponTitle": "Save 25% Off",
        "couponDescription": "Save up to 25% off with discount code"
    },
    {
        "couponCode": "WESUPPORTU",
        "couponTitle": "Save 15% on Any Purchase ",
        "couponDescription": "Shop at Harper Wilde and get a 15% discount on any purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "KATIE15",
        "couponTitle": "Score 15% Off Your Order w/ Promo Code",
        "couponDescription": "Take 15% off your qualifying purchase when you apply this Harper Wilde coupon code at checkout."
    },
    {
        "couponCode": "SUMMER15",
        "couponTitle": "Harper Wilde Coupon: 15% Off Your Purchase",
        "couponDescription": "When this discount code is applied at checkout, you can save 15% on your select order."
    },
    {
        "couponCode": "10FORU",
        "couponTitle": "Take 10% Off with Harper Wilde Coupon",
        "couponDescription": "Add this promo code to your cart and receive 10% off on your Harper Wilde purchase."
    },
    {
        "couponCode": "15OFF",
        "couponTitle": "Save 15% at Checkout with Harper Wilde Coupon",
        "couponDescription": "Score up to 15% off at Harper Wilde when this code is applied to your cart."
    },
    {
        "couponCode": "GoWildeSWR",
        "couponTitle": "Harper Wilde Coupon: Save 20% on Order Sitewide + Free Shipping",
        "couponDescription": "Save 20% on your entire order at Harper Wilde. Enjoy free shipping on all purchases. Shop now and take advantage of this limited-time offer."
    },
    {
        "couponCode": "TAKETEN",
        "couponTitle": "Save Up to 25% at Harper Wilde ",
        "couponDescription": "Receive up to 25% off with this Harper Wilde coupon code applied to your cart."
    },
    {
        "couponCode": "GAMEON",
        "couponTitle": "Harper Wilde Coupon: Get 15% Off ",
        "couponDescription": "Get 15% off your purchase at Harper Wilde when this promo code is applied."
    },
    {
        "couponCode": "ALEXANDRA15",
        "couponTitle": "Save 15% with Harper Wilde Discount Code",
        "couponDescription": "Enjoy up to 15% off your Harper Wilde order when this promo code is applied to your cart."
    },
    {
        "couponCode": "20OFF",
        "couponTitle": "Harper Wilde Discount: Save 20% on Your Purchase",
        "couponDescription": "Add this promo code at checkout to receive up to 20% off your Harper Wilde order."
    },
    {
        "couponCode": "ashleyl15",
        "couponTitle": "Save 15% on Your Purchase",
        "couponDescription": "Take 15% off your purchase with this Harper Wilde discount code."
    },
    {
        "couponCode": "EMILYL",
        "couponTitle": "Get 15% Off with Harper Wilde Coupon",
        "couponDescription": "Take 15% off at Harper Wilde when you apply this discount code to your cart."
    },
    {
        "couponCode": "ALEXARAYE15",
        "couponTitle": "Take 15% Off at Checkout",
        "couponDescription": "Save 15% on your Harper Wilde order when using this promo code at checkout."
    },
    {
        "couponCode": "SLEEP30",
        "couponTitle": "Harper Wilde Promo Code: 30% Off Your Purchase",
        "couponDescription": "Get 30% off your order using a coupon code on your cart."
    }
]