[
    {
        "couponCode": "PARJOY15",
        "couponTitle": "Save 60% Off",
        "couponDescription": "Boxing Day Event: Up to 60% off and extra 15% Discount"
    },
    {
        "couponCode": "PAR23EID",
        "couponTitle": "Score 20% Off Your Purchase Sitewide",
        "couponDescription": "Get ready to jump for joy, because Foot Locker Canada is offering an amazing 20% off promo code. This is the best time to save at Foot Locker Canada as we're celebrating the season with a fantastic discount on the wide range of athletic shoes, clothing, and accessories from top brands. Grab this opportunity to upgrade your wardrobe and step up your style game without breaking the bank."
    },
    {
        "couponCode": "PARGET20",
        "couponTitle": "Foot Locker Canada Coupon: 20% Off Your Order",
        "couponDescription": "This Foot Locker Canada coupon code gets you 20% off on your online purchases. Whether you're in need of new running shoes, gym gear or fresh casual wear, this deal can help you save."
    },
    {
        "couponCode": "10PARBF",
        "couponTitle": "Foot Locker Coupon: 50% Off Your Order Sitewide",
        "couponDescription": "Elevate your sneaker game with 50% off at Foot Locker Canada. Use their coupon code and save on your favorite footwear and athletic gear."
    },
    {
        "couponCode": "PARHYPER1",
        "couponTitle": "Foot Locker Canada Promo Code: 25% Off",
        "couponDescription": "Shop using Foot Locker Canada's discount code and get 25% off your purchase at checkout."
    },
    {
        "couponCode": "VENNGO20",
        "couponTitle": "Grab 20% Discount On $200+ Shopping Spree",
        "couponDescription": "Take 20% Off on Purchase Worth $200 or More"
    },
    {
        "couponCode": "PAR20FIR",
        "couponTitle": "Free Shipping",
        "couponDescription": "Free shipping with coupon"
    },
    {
        "couponCode": "PAR10EXT",
        "couponTitle": "Foot Locker Canada Discount Code: Extra 10% Off",
        "couponDescription": "Save an extra 10% off your order using a promo code on your cart."
    },
    {
        "couponCode": "PARTENMR",
        "couponTitle": "Take 30% Off Your Order",
        "couponDescription": "Get up to 30% off your purchase this father's day sale at Foot Locker."
    },
    {
        "couponCode": "PAR15FSH",
        "couponTitle": "Foot Locker Coupon: 15% Off Your Order",
        "couponDescription": "Take advantage of this Foot Locker coupon code and enjoy a 15% discount on your purchase at footlocker.ca. It's time to save on a wide range of high-quality athletic footwear and apparel."
    },
    {
        "couponCode": "PARVIC20",
        "couponTitle": "20% Off Your Purchase of $125+",
        "couponDescription": "This promo code offers you an amazing opportunity to save 20% off your current purchase of $125 or more at footlocker.ca. Shop for the latest sneakers, activewear, and accessories from top brands and elevate your style game while keeping your wallet happy. Don't miss out on this limited-time offer  use this coupon at checkout and enjoy the savings."
    },
    {
        "couponCode": "PAR20CYB",
        "couponTitle": "Get 20% Discount On $49+ Purchases",
        "couponDescription": "Enjoy 20% Off When You Spend $49 or More"
    },
    {
        "couponCode": "PARCM25",
        "couponTitle": "Enjoy 25% off Sitewide at Foot Locker.",
        "couponDescription": "Grab 25% off your order over $125 + free shipping on orders over $50 with coupon code at checkout."
    },
    {
        "couponCode": "PARVDAY",
        "couponTitle": "Foot Locker Canada Promo Code: Get 10% Off $199+",
        "couponDescription": "Redeem this promo code at checkout and save 10% on orders over $99."
    },
    {
        "couponCode": "PAR20HOL",
        "couponTitle": "20% Off on Orders Over $125 + Free Shipping on Orders $50+",
        "couponDescription": "This Footlocker promo code gives you a 20% discount when you spend $125 or more. This also comes with free shipping on orders over $50. Visit Footlocker.ca now to enjoy this deal."
    },
    {
        "couponCode": "PARDEAL2",
        "couponTitle": "Get 20% Off on Orders $99+",
        "couponDescription": "Receive 20% off orders of $99 or more and get Free Shipping discount on orders of $50 or more."
    },
    {
        "couponCode": "VENNGO15",
        "couponTitle": "Save 15% On Purchases Over $99",
        "couponDescription": "Get 15% Off When You Spend $99 or More"
    },
    {
        "couponCode": "PARMOM25",
        "couponTitle": "Save 25% Off Orders $199+",
        "couponDescription": "Get ready to upgrade your sneaker game with Foot Locker Canada. Enjoy a 25% discount on your current purchase of $199 or more sitewide at footlocker.ca when you apply this promo code. Don't miss this amazing opportunity to score your favorite kicks and athletic gear at unbeatable prices."
    },
    {
        "couponCode": "PARTHANK",
        "couponTitle": "Foot Locker Canada Promo Code: Get Extra 15% Off Any Order ",
        "couponDescription": "Redeem this promo code at checkout and save an extra 15% on any order."
    },
    {
        "couponCode": "PARFALL2",
        "couponTitle": "Foot Locker Canada Coupon: Take 2% Off Your Order",
        "couponDescription": "Save 2% on your order at Foot Locker Canada with this coupon. Enjoy great deals on shoes and sportswear. Shop now and get more for less."
    }
]