[
    {
        "couponCode": "SAVEMORE",
        "couponTitle": "Diet Direct Coupon: Up to $75 Off Your Purchase",
        "couponDescription": "Shop and receive up to $75 off sitewide orders with Diet Direct's promo code on your cart."
    },
    {
        "couponCode": "BARDEAL",
        "couponTitle": "Take 20% Off Your Order",
        "couponDescription": "Save big at Diet Direct by getting 20% on bars."
    },
    {
        "couponCode": "SAVE50",
        "couponTitle": "BOGO- 50% Off Your Order",
        "couponDescription": "Buy one, get one 50% off when you enter this Diet Direct promo code at checkout."
    },
    {
        "couponCode": "WB1YRDX",
        "couponTitle": "Diet Direct Coupon: Take 35% Off Any Order",
        "couponDescription": "Save big at Diet Direct by getting 35% on your purchase."
    },
    {
        "couponCode": "NEW20X05",
        "couponTitle": "20% Off Your Order",
        "couponDescription": "Shop and take 20% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "30SITEWIDE",
        "couponTitle": "Save 30% Off Sitewide*",
        "couponDescription": "Save 30% on our top and your favorite products. Expires soon."
    },
    {
        "couponCode": "YOUCHOOSE",
        "couponTitle": "Diet Direct Coupon: Up to 25% Off Your Order + Free Delivery",
        "couponDescription": "Enjoy up to 25% off your qualifying purchase plus free shipping using this promotional code at checkout."
    },
    {
        "couponCode": "DEC30",
        "couponTitle": "Diet Direct Discount Code: Get 30% Off Your Order Sitewide",
        "couponDescription": "Save 30% on your order at Diet Direct with this discount code. Shop now and enjoy great deals on health products. Dont miss this sitewide offer."
    },
    {
        "couponCode": "NEWSAVE2",
        "couponTitle": "Diet Direct Coupon: $2 Off Your Order",
        "couponDescription": "Save $2 on your purchase at Diet Direct with this coupon code. This offer applies to new products sitewide."
    },
    {
        "couponCode": "MEALSHAKE",
        "couponTitle": "Get Meal Shakes for $12",
        "couponDescription": "Paste this promo code at checkout and get meal shakes for $12."
    },
    {
        "couponCode": "SNACKS20",
        "couponTitle": "Diet Direct Promo Code: 20% Off",
        "couponDescription": "Apply 20% off at checkout when you purchase desserts & snacks using Diet Direct's discount code on your cart."
    },
    {
        "couponCode": "HOTSAVE3",
        "couponTitle": "Diet Direct Coupon: $3 Off Your Purchase",
        "couponDescription": "Get $3 off hot drink orders with Diet Direct's promo code on your cart at checkout."
    },
    {
        "couponCode": "25BARSAVE",
        "couponTitle": "Diet Direct Coupon: 25% Off Your Order",
        "couponDescription": "Save 25% on protein bars by adding this Diet Direct code."
    },
    {
        "couponCode": "SAVEDOG15",
        "couponTitle": "Enjoy 15% Off Sitewide",
        "couponDescription": "Save 15% on your entire order with this Diet Direct discount code."
    },
    {
        "couponCode": "BA20X05",
        "couponTitle": "Take 20% Off Your Order",
        "couponDescription": "Save extra 20% on basic 1 week diet plan at Diet Direct."
    },
    {
        "couponCode": "SAVEDOG",
        "couponTitle": "Save 20% on Pet Treats",
        "couponDescription": "Use this coupon code at Diet Direct to save 20% off dog snacks and vitamins."
    },
    {
        "couponCode": "CA30X05",
        "couponTitle": "Enjoy 30% Discount on All Purchase",
        "couponDescription": "Enter a code to receive an additional 30% off everything at Diet Direct."
    },
    {
        "couponCode": "CA15X05",
        "couponTitle": "Diet Direct Coupon Code: 15% Off Your Order",
        "couponDescription": "Shop and take 15% off your purchase using a discount code on your cart."
    },
    {
        "couponCode": "CA20X05",
        "couponTitle": "Save Up to 20% on Your Order Sitewide",
        "couponDescription": "Save up to 20% on your entire purchase at Diet Direct by using this promo code at checkout. Don't miss out on this limited-time opportunity to optimize your savings while shopping for your favorite products. Shop now for the best deals on nutritional supplements and more."
    },
    {
        "couponCode": "BOGO",
        "couponTitle": "Buy One, Get One 50% Off",
        "couponDescription": "Get ready to save big with this promo code at dietdirect.com. Grab yourself a fantastic buy one get one 50% deal on your order of various products sitewide. Don't miss this exciting offer to stock up on your favorite diet products and kickstart your healthy lifestyle."
    }
]