[
    {
        "couponCode": "SAVE15AFF",
        "couponTitle": "Pharmacy2u Coupon Code: Take 15% Off Orders £40+ ",
        "couponDescription": "Enjoy a 15% discount on orders over £40 when you enter this coupon code at checkout."
    },
    {
        "couponCode": "XMAS15",
        "couponTitle": "Pharmacy2u Coupon: 15% Off Your Orders Over £40",
        "couponDescription": "Take 15% off on your purchase at Pharmacy2U.co.uk. Use this promo code and stock up on essential medications, health supplements, and personal care products."
    },
    {
        "couponCode": "10ELEC",
        "couponTitle": "Pharmacy2u Coupon Code: Extra 10% Off Your Order",
        "couponDescription": "Shop and take an extra 10% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "FEBDEALS15",
        "couponTitle": "Pharmacy2u Coupon: 15% Off Your Order of £40+",
        "couponDescription": "Score an amazing deal of 15% off your current purchase at Pharmacy2u.co.uk when you use this coupon code. It's the perfect opportunity to stock up on all your healthcare needs, from vitamins to skin care products, all at discounted prices."
    },
    {
        "couponCode": "QUIT10",
        "couponTitle": "Score 10% Off Your Purchase",
        "couponDescription": "Apply this Pharmacy2u promo code to get 10% off your order at checkout."
    },
    {
        "couponCode": "AFFEXC15",
        "couponTitle": "Pharmacy2u Coupon: 15% Off Your Order of £50+",
        "couponDescription": "Get 15% off your order at Pharmacy2u.co.uk. Use this code to save on your health essentials."
    },
    {
        "couponCode": "NP2B6H",
        "couponTitle": "Pharmacy2u Coupon: £40 Off Your First 4 Weeks of Weight Loss Treatments ",
        "couponDescription": "Enjoy £40 off your first 4 weeks of weight loss treatments at pharmacy2u.co.uk. Don't forget to apply this coupon code at checkout to unlock this deal."
    },
    {
        "couponCode": "SAVE15NOW",
        "couponTitle": "Pharmacy2u Coupon: 15% Off Your Order of £40+",
        "couponDescription": "Use this Pharmacy2u discount code to enjoy 15% off your purchase. Simply enter this code at checkout to unlock savings on a wide range of products, including prescription medications, over-the-counter remedies, health supplements, and personal care items."
    },
    {
        "couponCode": "SAVE15SEPT",
        "couponTitle": "Pharmacy2u Coupon: 15% Off Your Purchase ",
        "couponDescription": "Use this coupon code to enjoy a 15% discount when you purchase $40 or more at Pharmacy2u, the UK's leading online pharmacy."
    },
    {
        "couponCode": "BANKHOL15",
        "couponTitle": "Pharmacy2u Coupon: 15% Off Your Order",
        "couponDescription": "Take 15% off when you purchase £40 with this Pharmacy2u code."
    },
    {
        "couponCode": "GIFTING10",
        "couponTitle": "Get Extra 10% Off Christmas Gifting",
        "couponDescription": "Paste this promo code at checkout and save an extra 10% on Christmas gifting."
    },
    {
        "couponCode": "AFFDEC15",
        "couponTitle": "Pharmacy2u Coupon: 15% Off Your Order of £40+",
        "couponDescription": "Use this promo code to enjoy 15% off your purchase at pharmacy2u.co.uk \nwhen you spend £40 or more on their wide range of products."
    },
    {
        "couponCode": "OCTOBER15",
        "couponTitle": "Take 15% Off Your Order",
        "couponDescription": "Receive a 15% discount when you spend over £40 using this Pharmacy2u voucher code at checkout."
    },
    {
        "couponCode": "STOPOBER10",
        "couponTitle": "Take 10% Off Your Order",
        "couponDescription": "Save extra 10% on smoking and vaping cessation at Pharmacy2u."
    },
    {
        "couponCode": "Q1J6DV",
        "couponTitle": "Pharmacy2u Coupon: £40 Off Your First 4 Weeks of Weight Loss Treatment",
        "couponDescription": "Kickstart your weight loss journey with Pharmacy2u.co.uk. Use this promo code to enjoy £40 off on your first 4 weeks of weight loss treatment. It's the perfect opportunity to get fit and save big."
    },
    {
        "couponCode": "F3X4KT",
        "couponTitle": "Pharmacy2u Coupon: 20% Off Your Purchase",
        "couponDescription": "Use this Pharmacy2u promo code to get 20% off on your purchase. Save on a variety of prescription medications, over-the-counter drugs, health and wellness supplements, skincare items, and more."
    },
    {
        "couponCode": "SMOKEFREE",
        "couponTitle": "Pharmacy2u Coupon: Free Delivery on Your Order",
        "couponDescription": "Enjoy absolutely free delivery on all your Smoking Cessation orders at Pharmacy2u when you use this coupon code."
    },
    {
        "couponCode": "V7B9RW",
        "couponTitle": "Pharmacy2u Coupon: 20% Off Your Order",
        "couponDescription": "Boost your confidence and love life with this coupon code. Enjoy a 20% discount on erectile dysfunction treatments at pharmacy2u.co.uk."
    },
    {
        "couponCode": "AUGPAY15",
        "couponTitle": "Pharmacy2u Coupon: 15% Off Your Order",
        "couponDescription": "Use this coupon code to enjoy a healthy 15% off at Pharmacy2u. It's time to stock up on wellness essentials."
    },
    {
        "couponCode": "AUGSAVE15",
        "couponTitle": "Pharmacy2u Coupon: 15% Off Your Order of $40+",
        "couponDescription": "Unlock 15% off on your healthcare needs with Pharmacy2u. Use this coupon code to save on a wide range of products, from prescription medication and over-the-counter drugs to health and wellness supplements, skincare products, and more."
    }
]