[
    {
        "couponCode": "HOLIDAY24",
        "couponTitle": "Get 20% Off Your Minted Order With Code",
        "couponDescription": "Save 20% off your Minted order when you enter this code during the checkout process."
    },
    {
        "couponCode": "BABYMM30",
        "couponTitle": "Minted Promo Code: Enjoy 30% Off Your Purchase",
        "couponDescription": "Save 30% off on birth announcements when you join Minted More and enter this code at checkout."
    },
    {
        "couponCode": "ENGAGED25",
        "couponTitle": "Enjoy 25% Off Save The Dates at Minted",
        "couponDescription": "Take 25% off your purchase of Save The Dates at Minted when you use this discount code at checkout."
    },
    {
        "couponCode": "GRADMM30",
        "couponTitle": "Take 30% Off Graduation Cards",
        "couponDescription": "Enjoy 30% Discount on Graduation Cards when you use this Minted promo code."
    },
    {
        "couponCode": "PARTYMINTED20",
        "couponTitle": "Get 20% Off Your First Birthday Party Invitation Purchase",
        "couponDescription": "Are you ready to score some serious savings today? Don't miss out on an amazing deal from Minted.com. Enjoy a whopping 20% discount on your first purchase of birthday party invitations. It's the perfect opportunity to add a touch of style and personalization to your special day, without breaking the bank."
    },
    {
        "couponCode": "PHOTOGIFTS20",
        "couponTitle": "20% Off Your Order at Minted",
        "couponDescription": "Get ready to save big on your first photo gift order with this incredible Minted promo code. You can get a whopping 20% off your purchase, making it the perfect time to create a unique and personalized gift for someone special. Use this code today and start saving."
    },
    {
        "couponCode": "VALERIAMINTED",
        "couponTitle": "Minted Coupon: 20% Off Your Order",
        "couponDescription": "Take 20% off your purchase plus free shipping at Minted."
    },
    {
        "couponCode": "10FREE",
        "couponTitle": "$10 Credit On Wedding Samples ",
        "couponDescription": "Redeem this code for $10 credit towards wedding stationery samples at Minted."
    },
    {
        "couponCode": "WEDDINGJOURNAL",
        "couponTitle": "Minted Promo Code: Free Wedding Planning Journal",
        "couponDescription": "Get ready to plan your dream wedding in style with this promo code. Unlock access to a fabulous Free Wedding Planning Journal, beautifully crafted by talented artists on premium design goods. Head over to minted.com and make your wedding planning journey a joyous and memorable experience. Don't miss out on this fantastic offer that's just perfect for all you lovebirds out there."
    },
    {
        "couponCode": "HAPPYNY25",
        "couponTitle": "Minted Coupon: 15% Off Your Order",
        "couponDescription": "Take 15% off your purchase with this Minted code."
    },
    {
        "couponCode": "RIEHOLIDAY2024",
        "couponTitle": "Minted Coupon: 20% Off Your Order",
        "couponDescription": "Save 20% on holiday cards by adding this Minted code."
    },
    {
        "couponCode": "WUND20KWW3W82H",
        "couponTitle": "Minted Promo Code: Get 20% Off Any Order ",
        "couponDescription": "Redeem this promo code at checkout and save 20% on any order."
    },
    {
        "couponCode": "CAPITALBABY20",
        "couponTitle": "Take 20% Off Your Purchase",
        "couponDescription": "Save 20% on your first baby items with this Minted code."
    },
    {
        "couponCode": "CELESTAWED24",
        "couponTitle": "Take 25% Off Your Order",
        "couponDescription": "Take up to 25% off wedding stationery and free shipping at Minted."
    },
    {
        "couponCode": "HOLIDAYJOY24",
        "couponTitle": "Get 20% Off Your Order",
        "couponDescription": "Save 20% on holiday cards with recycled paper with this Minted code."
    },
    {
        "couponCode": "CAPITAL25",
        "couponTitle": "Minted Promo Code: 25% Off Your Order",
        "couponDescription": "Shop and take 25% off your purchase using a promo code at checkout."
    },
    {
        "couponCode": "LAINEYHOLIDAY2024",
        "couponTitle": "Minted Promo Code: 20% Off Your Order",
        "couponDescription": "Don't forget to enter this coupon code at checkout to receive 20% off your select purchase."
    },
    {
        "couponCode": "EMHOLIDAY2024",
        "couponTitle": "Minted Coupon: 20% Off Your Order",
        "couponDescription": "Take 20% off stationery and gifts + free shipping with this Minted code."
    },
    {
        "couponCode": "MM20",
        "couponTitle": "Minted Coupon: 20% Off Your Purchase",
        "couponDescription": "Take 20% off your entire order with this Minted code."
    },
    {
        "couponCode": "HOLLY24",
        "couponTitle": "Get 15% Off Holiday Cards ",
        "couponDescription": "Paste this promo code at checkout and save 15% on holiday cards."
    },
    {
        "couponCode": "JOY24",
        "couponTitle": "Minted Coupon: 15% off Your Order",
        "couponDescription": "Save 15% on holiday cards, invitations and more at Minted."
    },
    {
        "couponCode": "WEDTEN",
        "couponTitle": "Minted Coupon: Receive 10% Off + 25% Off",
        "couponDescription": "Save on your wedding stationery with Minted's special offer. Get 10% off wedding invitations and 25% off save the dates. This is perfect for planning your big day. Don't miss these wedding discounts."
    },
    {
        "couponCode": "SLEIGH24",
        "couponTitle": "20% Off All Holiday Gifts",
        "couponDescription": "Enter this code at checkout to save 20% off all Minted holiday gifts."
    },
    {
        "couponCode": "Appear",
        "couponTitle": "20% Off + 15% Off + Free Shipping",
        "couponDescription": "Shop and take 20% off your order of Foil-Pressed Designs, 15% off your order of Holiday Cards and Gifts, and Free Shipping using a promo code at minted.com."
    },
    {
        "couponCode": "10WKART0422ZJES9K",
        "couponTitle": "Minted Coupon: 10% Off Designer Printed Items",
        "couponDescription": "Unleash your creativity with their designer printed items on minted.com. Use the discount code to enjoy a 10% discount. Don't miss out on this fabulous deal."
    }
]