[
    {
        "couponCode": "HAPPYNEWYEAR",
        "couponTitle": "Save 20% Off w/ Discount Code",
        "couponDescription": "Get a 20% discount on full price items when you enter this promo code at checkout."
    },
    {
        "couponCode": "EXTRABUCKS",
        "couponTitle": "Get Extra $25 Reward Over $75 with Promo Code",
        "couponDescription": "Get extra $25 rewards on your purchase over $75. Enter this coupon code at checkout."
    },
    {
        "couponCode": "CARROTCAKE",
        "couponTitle": "Save 30% Off using Coupon Code",
        "couponDescription": "Enjoy up to 30% discount on top brands items and save 20% on a full priced item. Enter this coupon code at checkout."
    },
    {
        "couponCode": "GRAVY",
        "couponTitle": "Save 25% Off Clearance with Code",
        "couponDescription": "you must use coupon code for this to work. for moosejaw rewards members only. new members enroll free at checkout. the 25% off one full-price item or 25% off clearance offer cannot be combined with other codes or promotions and it can't be applied to prior purchases. the 25% off is only on one full priced item as well as 25% off clearance items ending in .99."
    },
    {
        "couponCode": "GIMMEDAT",
        "couponTitle": "Moosejaw Promo Code: Get Free Shipping",
        "couponDescription": "With a coupon, get free delivery on all orders with no minimum purchase required at Moosejaw."
    },
    {
        "couponCode": "ACTIVE5",
        "couponTitle": "Save 5% Off",
        "couponDescription": "Save an extra 5% off on Clearance"
    },
    {
        "couponCode": "COLESLAW",
        "couponTitle": "Grab 30% Back in Reward Dollars",
        "couponDescription": "Use this Moosejaw promo code to get 30% back in Moosejaw Rewards Dollars. Take advantage of this great discount and save big on a wide range of items such as high-quality outdoor gear, clothing, footwear, and much more. Don't miss out on the chance to equip your outdoor adventures with top-notch gear from renowned brands at lower prices. Hurry up before the offer expires."
    },
    {
        "couponCode": "DWAYNE",
        "couponTitle": "Moosejaw Coupon: 30% Back in Rewards for Members",
        "couponDescription": "Score big on your current shopping spree at Moosejaw.com. As a rewards member, you can rake in a whopping 30% back in reward dollars. Don't miss the opportunity to shop your favorite brands like North Face, Fjallraven, Prana and more. It's savings made fun and easy."
    },
    {
        "couponCode": "GRAB20",
        "couponTitle": "Moosejaw Coupon: Take 20% Off Your Order",
        "couponDescription": "Save 20% on climbing sale by adding this Moosejaw code."
    },
    {
        "couponCode": "EGGBAG",
        "couponTitle": "Moosejaw Coupon: Get 20% Off Your Order",
        "couponDescription": "Save on your order at Moosejaw.com today. Use this Moosejaw promo code during checkout to receive 20% off your purchase. Take advantage of this deal now."
    },
    {
        "couponCode": "EGGNOG",
        "couponTitle": "Save 25% Off Sitewide with Code",
        "couponDescription": "Enjoy shopping and get a 25% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "KAZOO",
        "couponTitle": "Save 25% Off",
        "couponDescription": "Apply this discount code at checkout and get 25% discount on Moosejaw products."
    },
    {
        "couponCode": "FRENCHFRY",
        "couponTitle": "Save 20% Off Clearance with Code",
        "couponDescription": "Get extra 20% off clearance items with this Moose Jaw code."
    },
    {
        "couponCode": "EXTRA20",
        "couponTitle": "Save 20% Off with Code",
        "couponDescription": "Add this moosejaw.com coupon code at checkout to enjoy 20% off your orders of clearance items."
    },
    {
        "couponCode": "ICECREAM",
        "couponTitle": "30% Off Back in Reward Dollars",
        "couponDescription": "Use this Moosejaw coupon code to enjoy a whopping 30% off your current purchase at moosejaw.com. Take advantage of this sweet deal and save on outdoor essentials like jackets, hiking boots, camping gear, backpacks, and more. Don't miss the chance to stock up on all your favorite adventure-ready items at unbeatable prices. Hurry and grab your scoop of savings now on moosejaw.com using the code."
    },
    {
        "couponCode": "CLIMBERS20",
        "couponTitle": "Take 20% Off Your Order",
        "couponDescription": "Enjoy 20% on climbing gear. Just add this coupon code in your cart."
    },
    {
        "couponCode": "BONUSCARD",
        "couponTitle": "Moosejaw Coupon: Shop & Receive a Free Bonus Card",
        "couponDescription": "Shop at Moosejaw and receive a complimentary bonus card, with 10% of all bonus card sales donated to the Conservation Alliance. Shop at Moosejaw while supporting the crucial work of this environmental organization."
    },
    {
        "couponCode": "SLEIGH",
        "couponTitle": "Save 25% Off Sitewide w/ Promo Code",
        "couponDescription": "Redeem this promo code at checkout and save an extra 25% on any order."
    },
    {
        "couponCode": "SAVE20",
        "couponTitle": "Take 20% Off Your Order",
        "couponDescription": "Receive extra 20% off cold-weather gear at Moosejaw."
    },
    {
        "couponCode": "MJBOGO",
        "couponTitle": "Buy One, Get On 50% Off",
        "couponDescription": "Be ready to jump for joy with their fantastic buy one, get one 50% off promo code at Moosejaw. This is an unbeatable deal to stuff your carts with top-of-the-line outdoor gear, chic apparel, and much more. With the summer season on the horizon, this sale comes just in time for you to prep for all your wild adventures or simply upgrade your wardrobe without breaking the bank. Don't miss out on these massive savings at Moosejaw."
    }
]