[
    {
        "couponCode": "UOYWSHHQ5P",
        "couponTitle": "Take 20% Off Your Purchase ",
        "couponDescription": "Enjoy shopping and get a 20% discount on your purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "MERINO15",
        "couponTitle": "Save 15% Off Your Smartwool Order",
        "couponDescription": "Take 15% off your Smartwool order and save big on wool socks and more for the whole family."
    },
    {
        "couponCode": "15OFF",
        "couponTitle": "Enjoy 15% Discount On Your Purchase",
        "couponDescription": "Save 15% on Your Order"
    },
    {
        "couponCode": "6PXY53",
        "couponTitle": "Enjoy A 30% Savings Off Of Smartwool",
        "couponDescription": "Get 30% off of Smartwool and get the best durable wool and comfortable socks for the whole family."
    },
    {
        "couponCode": "SWLETM5",
        "couponTitle": "Get An Extra 15% Off Of Smartwool",
        "couponDescription": "Save at Smartwool and order 15% off with a promo code at checkout. Save big on wool socks for the whole family."
    },
    {
        "couponCode": "BMZAFRXYLZ",
        "couponTitle": "Smartwool Coupon Code: Enjoy 25% Off Your Order Sitewide",
        "couponDescription": "Use this coupon code to receive 25% off your order at Smartwool. Shop sitewide and get discounts on all your favorite products. This offer is for a limited time only."
    },
    {
        "couponCode": "CNN25",
        "couponTitle": "Get 25% Off Your Order At Smartwool",
        "couponDescription": "Redeem this promo code at checkout and save 25% on your Smartwool order. Save big on boxers for men and wool socks for women."
    },
    {
        "couponCode": "WOOL15",
        "couponTitle": "Get 15% Off Of Smartwool",
        "couponDescription": "Score 15% off of Smartwool with promo code and stock up on wool socks for the whole family."
    },
    {
        "couponCode": "SW6BXKY",
        "couponTitle": "Get Up to 15% Off At Smartwool",
        "couponDescription": "Get up to a 15% discount on your order. Enter this coupon code at checkout. Save big on wool socks for the whole family and outdoor apparel."
    },
    {
        "couponCode": "PCG5TCDEP7",
        "couponTitle": "Score 7% Off Your Order",
        "couponDescription": "Apply this Smartwool promotional code to get 7% off your qualifying purchase at checkout."
    },
    {
        "couponCode": "D9F452AIGX",
        "couponTitle": "Smartwool Promo Code: 10% Off Your Order",
        "couponDescription": "Shop and get 10% off your purchase using a coupon code on your cart."
    },
    {
        "couponCode": "37VFOTWULI",
        "couponTitle": "Take Up to 10% Off Your Order",
        "couponDescription": "Save up to 10% on your order at Smartwool with this discount code. Shop quality gear and enjoy great savings today. Dont miss this limited-time offer."
    },
    {
        "couponCode": "U6R0",
        "couponTitle": "Get Up To 10% Off Your Order",
        "couponDescription": "Save at Smartwool by getting up to 10% on your purchase."
    },
    {
        "couponCode": "UCD0K",
        "couponTitle": "Save 20% Off With Smartwool Code",
        "couponDescription": "Save 20% off your order when you use this code during checkout. Shop Smartwool socks, base layers and more."
    },
    {
        "couponCode": "GLOVE45",
        "couponTitle": "Up To 45% Off Your Smartwool Order With Code",
        "couponDescription": "Get up to 45% off your order when you apply this promo code at checkout at Smartwool."
    },
    {
        "couponCode": "ST5498ZW",
        "couponTitle": "Take 25% Off Your Smartwool Order",
        "couponDescription": "Use this promo code from Smartwool to receive 25% off on your shopping cart. Stock up and save big on outdoor apparel for the whole family."
    },
    {
        "couponCode": "JOY20",
        "couponTitle": "Extra 20% Off on Your Next Order",
        "couponDescription": "Apply this promo code during checkout to get a 20% off on your entire online purchases. Visit and shop smartwool.com today."
    },
    {
        "couponCode": "20SW",
        "couponTitle": "Enjoy 20% Off Of Smartwool",
        "couponDescription": "Get up to 20% off of Smartwool with coupon. Shop the latest outdoor clothing for the whole family for your latest adventure this summer."
    },
    {
        "couponCode": "ARIELLESHIPE25",
        "couponTitle": "Get  25% Off Your Order At Smartwool",
        "couponDescription": "Apply 25% off using this coupon code on your purchase at Smartwool and save big on outdoor apparel for the whole family."
    },
    {
        "couponCode": "JOYRVIE",
        "couponTitle": "Get 20% Off Of Smartwool With Code",
        "couponDescription": "Shop using Smartwool's discount code and get 20% off your purchase at checkout. Get the latest outdoor apparel for women for the summer."
    }
]