[
    {
        "couponCode": "CLEAN10",
        "couponTitle": "Get 10% Off Credo Beauty With Coupon Code",
        "couponDescription": "Use this coupon code at checkout to get 10% off your Credo Beauty purchase."
    },
    {
        "couponCode": "SASCHA20",
        "couponTitle": "Credo Beauty Promo Code: 20% Off Your Order",
        "couponDescription": "Shop and get 20% off using this discount code on your sitewide purchase at Credo Beauty."
    },
    {
        "couponCode": "CREDOFRIEND",
        "couponTitle": "Receive Up to 10% Off Your Order",
        "couponDescription": "Get up to 10% off your order at Credo Beauty with this promo code. Shop a wide range of clean beauty products and enjoy this limited-time offer. Don't miss out on saving while you indulge in your favorite beauty essentials."
    },
    {
        "couponCode": "CREDOLIVE",
        "couponTitle": "Enjoy No-Cost Delivery Using Promotional Code",
        "couponDescription": "Get Free Shipping with Promo Code"
    },
    {
        "couponCode": "rio20",
        "couponTitle": "20% Off Your Order",
        "couponDescription": "Shop and get 20% off your purchase using a coupon code on your cart."
    },
    {
        "couponCode": "TRISH20",
        "couponTitle": "Credo Beauty Discount Code: 20% Off Your Order",
        "couponDescription": "All shoppers can receive a 20% discount on their select purchase by simply applying this coupon at checkout."
    },
    {
        "couponCode": "OliviaW20",
        "couponTitle": "Credo Beauty Promo Code: Take 20% Off Your Order",
        "couponDescription": "Save 20% on your next order at Credo Beauty with this promo code. Enjoy natural and clean beauty products at a great price. Shop now to refresh your beauty routine and discover your new favorites."
    },
    {
        "couponCode": "GOCLEAN23",
        "couponTitle": "Get Up to 15% Off",
        "couponDescription": "Use this Credo Beauty discount code during checkout to enjoy up to 15% off your total purchase. Don't miss out on this great deal."
    },
    {
        "couponCode": "FRIENDS23",
        "couponTitle": "Enjoy 20% Off Your Purchase",
        "couponDescription": "Score 20% off your order for VIPs with this Credo Beauty coupon code."
    },
    {
        "couponCode": "N4D8J8",
        "couponTitle": "Take 8% Off Your Order",
        "couponDescription": "Get 8% off your entire purchase in the store at Credo Beauty."
    },
    {
        "couponCode": "CLEANREP",
        "couponTitle": "Credo Beauty Promo Code: Extra 10% Off Your Order",
        "couponDescription": "Shop and receive an additional 10% off using this discount code on your sitewide purchase at Credo Beauty."
    },
    {
        "couponCode": "powers",
        "couponTitle": "Get Additional 10% Discount On Entire Purchase",
        "couponDescription": "Receive an Extra 10% Off on Your Total Purchase"
    },
    {
        "couponCode": "NEW2CREDO",
        "couponTitle": "New Customers Save 10%",
        "couponDescription": "Make your first purchase at Credo Beauty and get 10% off with this code."
    },
    {
        "couponCode": "BEAUTY10",
        "couponTitle": "Get 10% Off Anything",
        "couponDescription": "Credo Beauty is offering a 10% sitewide discount. Just use this code at checkout when you shop their selection of beauty products."
    },
    {
        "couponCode": "missyou10",
        "couponTitle": "Credo Beauty Coupon: 10% Off Your Purchase",
        "couponDescription": "Get 10% off orders with Credo Beauty's promo code on your cart at checkout."
    },
    {
        "couponCode": "10WHOORL",
        "couponTitle": "Credo Beauty Coupon Code: Save Up to 10% on Your Order",
        "couponDescription": "Save up to 10% on your order with this coupon code. Shop now for exclusive savings on premium skincare and beauty products. Don't miss out on this deal."
    },
    {
        "couponCode": "ABW6SS5F",
        "couponTitle": "Credo Beauty Coupon: 10% Off Your Order",
        "couponDescription": "Enjoy up to 10% off sitewide by adding this Credo Beauty code."
    },
    {
        "couponCode": "AB258HSB",
        "couponTitle": "Get 10% Off Your Order",
        "couponDescription": "Take up to 10% off sitewide with this Credo Beauty code."
    },
    {
        "couponCode": "STEPHANIE",
        "couponTitle": "Credo Beauty Coupon: 25% Off Your Purchase",
        "couponDescription": "Apply this promotional code at checkout to get 25% off your select order."
    },
    {
        "couponCode": "THETRUESPOON",
        "couponTitle": "10% Discount at Credo Beauty",
        "couponDescription": "Save 10% on popular beauty brands when you use this Credo discount code at checkout."
    }
]