[
    {
        "couponCode": "JOY40",
        "couponTitle": "Save Extra 40% on Sale",
        "couponDescription": "Save an extra 40% on sale items at Natori with this exclusive discount code. Shop now for great deals on premium products. Don't miss out on this limited-time offer."
    },
    {
        "couponCode": "10OFF",
        "couponTitle": "Take $10 Off w/ Coupon Code",
        "couponDescription": "Enjoy $10 Off on Your Next purchase"
    },
    {
        "couponCode": "RESORT24",
        "couponTitle": "Natori Promo Code: Take 40% Off",
        "couponDescription": "Experience a 40% discount on the exquisite Resort Collection at Natori with this promo code. Elevate your style game with luxurious pieces at unbeatable prices. Shop now and save big."
    },
    {
        "couponCode": "RUG",
        "couponTitle": "Take 20% Off Your Purchase",
        "couponDescription": "Save at Natori by getting 20% on all rugs."
    },
    {
        "couponCode": "BEACHWEAR",
        "couponTitle": "Get 30% Off Caftans, Cover Ups, and Pareos",
        "couponDescription": "Paste this promo code at checkout and save 30% on caftans, cover ups, and pareos."
    },
    {
        "couponCode": "BIGSALE",
        "couponTitle": "Natori Promo Code: Get Extra 50% Off Any Styles ",
        "couponDescription": "Redeem this promo code at checkout and save an extra 50% on any styles."
    },
    {
        "couponCode": "WCSLEEP",
        "couponTitle": "Natori Promo Code: Get Select Item for Just $12",
        "couponDescription": "Save big with this Natori promo code. Get the Bliss French Cut Brief for just $12. Hurry to enjoy this limited-time offer."
    },
    {
        "couponCode": "BIGSALE50OFF",
        "couponTitle": "Natori Promo Code: Up to 50% Off Your Purchase",
        "couponDescription": "Order using Natori's coupon code and receive up to 50% off sale items on your purchase at checkout."
    },
    {
        "couponCode": "DRESS40",
        "couponTitle": "Take Extra 40% Off Sale",
        "couponDescription": "Get an extra 40% off sale dresses at Natori with this discount code. Shop now to save on elegant styles for every occasion. Don't miss this chance to upgrade your wardrobe at a lower price."
    },
    {
        "couponCode": "BLISS",
        "couponTitle": "Natori Coupon: Buy 2 Bliss Perfection Bras, Get a Bestselling V-kini Free",
        "couponDescription": "Hey there, savvy shopper. Get ready to pamper yourself with the bestselling Bliss Perfection One-size V-kini. Unwrap this offer just for you. Buy two of the luxurious bras and get one V-kini absolutely free. Don't miss out, because there's never been a better time to save at Natori.com."
    },
    {
        "couponCode": "FALL2024",
        "couponTitle": "Natori Discount Code: Up to $600 Off Your Order",
        "couponDescription": "Score up to $600 off when you spend $250 or more using this promo code during checkout."
    },
    {
        "couponCode": "DRESS40NOW",
        "couponTitle": "Natori Promo Code: Take 40% Off Select Products",
        "couponDescription": "Save 40% on beautiful dresses at Natori with this promo code. Discover stylish options for every occasion at a great price. Shop now and update your wardrobe with this amazing offer."
    },
    {
        "couponCode": "SALE30",
        "couponTitle": "Natori Coupon: 30% Off Your Order",
        "couponDescription": "Save extra 30% on clothing, jewelry and more at Natori."
    },
    {
        "couponCode": "SILK",
        "couponTitle": "Score Up to 50% Off Your Order",
        "couponDescription": "When this Natori discount code is used, you can save up to 50% on your eligible purchase."
    },
    {
        "couponCode": "JOY50",
        "couponTitle": "Up to 50% Off Your Order",
        "couponDescription": "Get up to 50% off your purchase using a coupon code on your cart."
    },
    {
        "couponCode": "EGIFT",
        "couponTitle": "Take 15% Off E-Gift Cards",
        "couponDescription": "Shop now at Natori and receive a 15% discount on e-gift cards. Redeem this discount code at checkout."
    },
    {
        "couponCode": "ROBES50",
        "couponTitle": "Natori Special Offer: Extra 50% Off Sale Items",
        "couponDescription": "Apply 50% off on your purchase of Sale items in your shopping cart using the coupon code at Natori."
    },
    {
        "couponCode": "STILLTIME",
        "couponTitle": "Natori Promo Code: Get 15% Off Your Order",
        "couponDescription": "Apply this coupon code at checkout and enjoy a 15% discount on your order."
    },
    {
        "couponCode": "GUNMETAL",
        "couponTitle": "Natori Discount Code: Score $12 Off Your Order",
        "couponDescription": "Get $12 off Bliss Perfection Underwear when you use this Natori promo code."
    },
    {
        "couponCode": "EXTRA",
        "couponTitle": "Take 40% off Styles at Natori.",
        "couponDescription": "Save 40% on sale styles + free shipping + free returns on orders over $300 with coupon code at checkout."
    }
]