[
    {
        "couponCode": "DRVCMEMBER",
        "couponTitle": "10% Member Discount",
        "couponDescription": "Disney Store Members can use this code to save up to 10% on their next purchase."
    },
    {
        "couponCode": "CA24241-K42LBXF3TD",
        "couponTitle": "Disney Store Discount Code: up to 15% Off Your Order",
        "couponDescription": "Use this Disney Store promo code at checkout to save up to 15% off your orders."
    },
    {
        "couponCode": "SHIPMAGIC",
        "couponTitle": "Disney Store Promo Code: Free Shipping on Orders $75+",
        "couponDescription": "Redeem free shipping with this coupon when you spend $75 or more at Disney Store."
    },
    {
        "couponCode": "NATASHA",
        "couponTitle": "Receive Complimentary Black Widow Coin With $25+ Buy",
        "couponDescription": "Get a Free Black Widow Coin on $25+ Purchase"
    },
    {
        "couponCode": "DVCCMANDO",
        "couponTitle": "Disney Store Coupon: Get a Free The Mandalorian Lithograph Set with Your Order",
        "couponDescription": "Snag an exclusive The Mandalorian Lithograph Set for free with most items on shopdisney.com. This is the ultimate deal for all you Star Wars enthusiasts out there."
    },
    {
        "couponCode": "SAVEMORE",
        "couponTitle": "20% Off Orders of $100+",
        "couponDescription": "When you spend $100 or more at shopDisney, use this code on your cart to take 20% off the total."
    },
    {
        "couponCode": "CA24241-HWM6CKBC35",
        "couponTitle": "35% Off Your Order",
        "couponDescription": "Shop and take 35% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "APPMAGIC",
        "couponTitle": "Take Up to 10% Off Any Purchase ",
        "couponDescription": "Enjoy shopping and get up to a 10% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "DREAM",
        "couponTitle": "Save Up to 40% on Sleepwear, Plush, and Magical Rush Toys",
        "couponDescription": "Shop at Disney Store and get up to a 40% discount on sleepwear, plush, and magical rush toys. Apply this discount code at checkout."
    },
    {
        "couponCode": "DVCCSNOW",
        "couponTitle": "Save 20% on Any Purchase ",
        "couponDescription": "Shop at Disney Store and get a 20% discount on any purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "CYBER",
        "couponTitle": "shopDisney Coupon: 30% Off Your Purchase",
        "couponDescription": "Get ready to experience the magic of Disney at a discounted price. With the shopDisney code, you can now enjoy a whopping 30% off on your favorite Disney merchandise at shopdisney.com. Don't miss out on this amazing opportunity to bring home the enchantment of Disney for less."
    },
    {
        "couponCode": "DVCCJOLLY",
        "couponTitle": "Get 20% Off Your Order",
        "couponDescription": "Save at Disney Store by getting 20% on your purchase."
    },
    {
        "couponCode": "DVCCJOY",
        "couponTitle": "Disney Store Promo Code: 20% Off",
        "couponDescription": "Buy and save 20% with this discount code on your purchase at Disney Store."
    },
    {
        "couponCode": "fifty",
        "couponTitle": "Get 50% Off Your Purchase",
        "couponDescription": "Take 50% off your purchase this holiday sale at Disney Store."
    },
    {
        "couponCode": "FREESHIP",
        "couponTitle": "Free Shipping on All Orders",
        "couponDescription": "Shop for clothing, toys, and more of your favorite Disney movies and shows, and apply this code to your checkout to redeem free shipping on the order."
    },
    {
        "couponCode": "PARTEE",
        "couponTitle": "Disney Store Promo Code: Get 25% Off Adult & Kids' Tees",
        "couponDescription": "Redeem this promo code at checkout and save 25% on adult and kids' tees."
    },
    {
        "couponCode": "ENCHANT",
        "couponTitle": "Disney Store Coupon: $30 Off When You Buy 2+ Ear Headbands",
        "couponDescription": "Use the promo code at shopdisney.com and receive a $30 discount when you purchase 2 or more ear headbands."
    },
    {
        "couponCode": "DISNEY25",
        "couponTitle": "Disney Store Coupon: 25% Off Your Order of $100+",
        "couponDescription": "Unleash the magic with a 25% off promo code at Disney Store. Just spend $100 or more to qualify for this deal."
    },
    {
        "couponCode": "SURPRISE",
        "couponTitle": "Save 40% Off w/ Promo Code",
        "couponDescription": "Get 40% off with this Disney Store discount code when used at checkout."
    },
    {
        "couponCode": "TRIO",
        "couponTitle": "Disney Store Coupon Code: Buy 2 Get 1 Free ",
        "couponDescription": "Purchase two items and get another free when you enter this coupon code at checkout."
    }
]