[
    {
        "couponCode": "WELCOME10",
        "couponTitle": "BH Cosmetics Coupon Code: Take Extra 10% Off Full Price Items ",
        "couponDescription": "Enjoy an extra 10% discount on full priced items full priced items when you enter this coupon code at checkout."
    },
    {
        "couponCode": "XMAS10",
        "couponTitle": "Extra 10% Off Your Order w/ Coupon",
        "couponDescription": "Take an additional 10% off your qualifying purchase when this BH Cosmetics discount code is applied at checkout."
    },
    {
        "couponCode": "REVB25",
        "couponTitle": "BH Cosmetics Coupon: Up to 25% Off Your Purchase",
        "couponDescription": "Enjoy up to 25% off store-wide orders on your cart using this promo code at BH Cosmetics."
    },
    {
        "couponCode": "SAVE20",
        "couponTitle": "20% Off $70+ Orders At BH Cosmetics",
        "couponDescription": "Add this BH Cosmetics promo code at checkout to enjoy 20% off everything when you spend $70."
    },
    {
        "couponCode": "WITCH15",
        "couponTitle": "Get Up to 15% Off Any Purchase ",
        "couponDescription": "Redeem this promo code at checkout and save up to 15% on any purchase."
    },
    {
        "couponCode": "5OFF",
        "couponTitle": "Get 5% Discount On All Purchases",
        "couponDescription": "Save 5% off Any Order"
    },
    {
        "couponCode": "MELISSA-R4",
        "couponTitle": "BH Cosmetics Coupon: $10 Off Your Order",
        "couponDescription": "Take $10 off when you spend $30 and more at BH Cosmetics."
    },
    {
        "couponCode": "SPOOKY50",
        "couponTitle": "BH Cosmetics Discount Code: Save Up to 50% on Halloween Shop Items ",
        "couponDescription": "Shop at BH Cosmetics and enjoy up to 50% discount on Halloween shop items.  Apply this discount code at checkout."
    },
    {
        "couponCode": "SINGLES30",
        "couponTitle": "30% Off Your Order",
        "couponDescription": "Shop and receive 30% off your order using a discount code on your cart."
    },
    {
        "couponCode": "FLASH25",
        "couponTitle": "BH Cosmetics Promo Code: Get Extra 25% Off Any Order",
        "couponDescription": "Paste this promo code at checkout and save extra 25% on any order."
    },
    {
        "couponCode": "SATURDAY25",
        "couponTitle": "BH Cosmetics’ Coupon Code: Enjoy Extra 25% Off Any Purchase",
        "couponDescription": "Enter this BH Cosmetics coupon code at checkout to get extra 25% off your entire orders."
    },
    {
        "couponCode": "HOLIDAY20",
        "couponTitle": "Get 20% Off Select Items",
        "couponDescription": "Apply this coupon code to save 20% off select BH Cosmetics."
    },
    {
        "couponCode": "JULY4",
        "couponTitle": "Get 30% Off Select Items with Promo Code",
        "couponDescription": "Apply this coupon code at checkout and enjoy a 30% discount on your order."
    },
    {
        "couponCode": "SUNSET10",
        "couponTitle": "BH Cosmetics Discount Code: 10% Off Your Purchase",
        "couponDescription": "Shop and take 10% off your purchase using a promo code at bhcosmetics.com."
    },
    {
        "couponCode": "LABOR20",
        "couponTitle": "BH Cosmetics Discount Code: Save Extra 20% Off Any Purchase",
        "couponDescription": "Apply this discount code at checkout and get extra 20% discount on any purchase."
    },
    {
        "couponCode": "TREAT",
        "couponTitle": "Free Gift Orders Of $25",
        "couponDescription": null
    },
    {
        "couponCode": "SAVE25",
        "couponTitle": "Get 25% off selected items With Code",
        "couponDescription": "Enter this BH Cosmetics coupon code to enjoy 25% off selected items."
    },
    {
        "couponCode": "WELCOME20",
        "couponTitle": "Get 20% Off With Code",
        "couponDescription": "Spend 20% off your purchase using a promo code at BH Cosmetics."
    },
    {
        "couponCode": "SAVE15",
        "couponTitle": " BH Cosmetics's Promo Code: Get Up to 15% Off Your Order",
        "couponDescription": "Redeem this promo code at checkout and enjoy up to a 15% off on your order."
    },
    {
        "couponCode": "SAVE30",
        "couponTitle": "Get Up to 30% Off Select Beauty Items with Promo Code",
        "couponDescription": "Enjoy up to a 30% discount on select beauty items. Enter this coupon code at checkout."
    }
]