[
    {
        "couponCode": "CIARASELF",
        "couponTitle": "Up to 15% Off Your Purchase with Promo Code",
        "couponDescription": "Receive up to a 15% discount on your eligible order by simply applying this Pura coupon code at checkout."
    },
    {
        "couponCode": "VICTORIA15",
        "couponTitle": "Pura Coupon: 15% Off Your Order",
        "couponDescription": "Take 15% off sitewide by adding this Pura code."
    },
    {
        "couponCode": "CAPITAL15",
        "couponTitle": "Receive 15% Off with Pura Coupon",
        "couponDescription": "Apply this coupon to your Pura purchase to take 15% off diffusers, car fragrance, home scents, and more."
    },
    {
        "couponCode": "FREE15",
        "couponTitle": "Get 15% Off Your Entire Purchase",
        "couponDescription": "Shop Pura and receive 15% off all your orders. Don't forget to use this coupon code at checkout."
    },
    {
        "couponCode": "LATIMES15",
        "couponTitle": "Pura Coupon: Up to 15% Off Your Purchase",
        "couponDescription": "Get up to 15% off sitewide orders with Pura's promo code on your cart at checkout."
    },
    {
        "couponCode": "BF30",
        "couponTitle": "Take 30% Off Your Order",
        "couponDescription": "Grab a 30% discount on your order. Apply the Pura coupon code at checkout."
    },
    {
        "couponCode": "WETRIEDIT15",
        "couponTitle": "15% Off Your Pura Purchase Now",
        "couponDescription": "Use this Pura promo code to score 15% off your entire order of car fragrances, car scents, and more."
    },
    {
        "couponCode": "SCORE15",
        "couponTitle": "Take 15% Off Any Purchase ",
        "couponDescription": "Enjoy shopping and get a 15% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "angie15",
        "couponTitle": "Pura Promo Code: Take 15% Off Now",
        "couponDescription": "Use this coupon code during checkout to receive 15% off your entire Pura order of diffusers, home fragrances, and more."
    },
    {
        "couponCode": "DANIAUSTIN",
        "couponTitle": "Pura Coupon: 30% Off Your Order",
        "couponDescription": "Save 30% on home and car fragrances with this Pura code."
    },
    {
        "couponCode": "BRITT20",
        "couponTitle": "Get 5% Off Your Purchase",
        "couponDescription": "Save 5% on your purchase at Pura with this exclusive discount code. Use the code during checkout to enjoy the savings. Don't miss out on this limited-time offer."
    },
    {
        "couponCode": "savings15",
        "couponTitle": "Save 15% Off with Pura Promo Code",
        "couponDescription": "Freshen up your home or car with Pura fragrance diffuser and save 15% off your order now."
    },
    {
        "couponCode": "HELLOSUB",
        "couponTitle": "Take 15% Off Your Order with Pura Discount Code",
        "couponDescription": "Apply this code during checkout to score 15% off your Pura order of diffusers, home fragrances, car scents, and more."
    },
    {
        "couponCode": "UB15OFF",
        "couponTitle": "Pura Coupon Code: Take 15% Off Any Purchase ",
        "couponDescription": "Enjoy a 15% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "MARY30",
        "couponTitle": "Pura Promo Code: Up to 5% Off Your Order",
        "couponDescription": "Shop and get up to 5% off using this discount code on your purchase at Pura."
    },
    {
        "couponCode": "LAURA30",
        "couponTitle": "Save 30% on Any Purchase ",
        "couponDescription": "Shop at Pura and get a 30% discount on any purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "AVERY30",
        "couponTitle": "Pura Coupon Code: Take 30% Off Any Purchase ",
        "couponDescription": "Enjoy a 30% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "TRIEDANDTRUEMOMS",
        "couponTitle": "Pura Coupon: 30% Off Your Order",
        "couponDescription": "Take 30% off sitewide by adding this Pura code."
    },
    {
        "couponCode": "TIA30",
        "couponTitle": "Get 30% Off Your Order",
        "couponDescription": "Save big at Pura by getting 30% on your purchase."
    },
    {
        "couponCode": "HOLLEY30",
        "couponTitle": "Pura Coupon: 30% Off Your Order",
        "couponDescription": "Get 30% off sitewide by using this Pura code."
    }
]