[
    {
        "couponCode": "FREESHIP",
        "couponTitle": "Free Shipping with Saks Coupon Code",
        "couponDescription": "Get free shipping when you spend over $300 at Saks Fifth Avenue. Enjoy the ease and affordability of having your purchases shipped for free."
    },
    {
        "couponCode": "ACCOUNTSF",
        "couponTitle": "Saks Fifth Avenue Coupon: Save 10% on Your Order",
        "couponDescription": "Create an account with Saks Fifth Avenue and get 10% off your next online purchase over $100. You can shop for luxury fashion and designer clothing."
    },
    {
        "couponCode": "SHOPDECSF",
        "couponTitle": "Saks Fifth Avenue Discount Code: Save 25% on Orders $250+ ",
        "couponDescription": "Shop at Saks Fifth Avenue and enjoy a 25% discount on orders over $250. Apply this doiscount code at checkout."
    },
    {
        "couponCode": "MAYGETSF",
        "couponTitle": "Saks Fifth Avenue Discount Code: Save Up to $300 on Your Purchase ",
        "couponDescription": "Shop at Saks Fifth Avenue and enjoy up to a $300 discount on your purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "AUGGETSF",
        "couponTitle": "Saks Promo Code: $300 Off Your Purchase ",
        "couponDescription": "This Saks Fifth Avenue coupon code gets you $300 off when you spend $1,200."
    },
    {
        "couponCode": "WACOAL3",
        "couponTitle": "Saks Fifth Avenue Coupon Code: 2 Wacoal Smooth Series Briefs for $48",
        "couponDescription": "Get 2 Wacoal Smooth Series shaping high-cut briefs for $48 at Saks Fifth Avenue."
    },
    {
        "couponCode": "DECGETSF",
        "couponTitle": "Get $50 Off Your Order",
        "couponDescription": "Take $50 off with minimum spend of $200 at Saks Fifth Avenue."
    },
    {
        "couponCode": "NPSEP24SF",
        "couponTitle": "Up to 15% Off Your Order",
        "couponDescription": "Shop and get up to 15% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "TYNOV24SF",
        "couponTitle": "Get 15% Off Your Order",
        "couponDescription": "Save 15% on clothing, jewelry and more on cyber week deals at Saks Fifth Avenue."
    },
    {
        "couponCode": "WACOAL2",
        "couponTitle": "Saks Code: 10% Off on Wacoal Lingerie",
        "couponDescription": "Elevate your lingerie collection. Get an extra 10% off when you use this Saks Fifth Avenue promo code."
    },
    {
        "couponCode": "GETDECSF",
        "couponTitle": "Saks Fifth Avenue Coupon: $50 Off Your Purchase",
        "couponDescription": "Enjoy $50 off orders over $200+ on your cart using Saks Fifth Avenue's promo code at checkout."
    },
    {
        "couponCode": "GETGIFTSF",
        "couponTitle": "Get Up to $500 Gift Card on Orders $2,000+",
        "couponDescription": "Take up to $500 promotional gift card when you spend $2000 or more. Paste this promo code at checkout."
    },
    {
        "couponCode": "WNTRGCSF",
        "couponTitle": "Saks Fifth Avenue Coupon: Get a $500 Saks Gift Card with Your $2,000 Purchase ",
        "couponDescription": "For a limited time, when you make a Saks Fifth Avenue purchase of $2,000 or more, you can earn an exclusive $500 Saks Gift Card. Simply use the code at checkout to take advantage of this offer. This promotion is valid from December 11th to December 14th."
    },
    {
        "couponCode": "JULAPPSF",
        "couponTitle": "Saks Coupon: 15% Off Your Saks App Purchase",
        "couponDescription": "Score a fabulous 15% off on your purchase using the Saks app. Whether you're eyeing full-price fashion or hunting for sale steals, this discount applies to both. Simply use this coupon at checkout. Hurry though, this fantastic deal is only valid from July 6th to July 9th."
    },
    {
        "couponCode": "EARNGCSF",
        "couponTitle": "Saks Fifth Avenue Coupon: Earn a $50 Gift Card With Purchase",
        "couponDescription": "Receive a $50 Saks Gift Card when you make a purchase of $250 or more at Saks Fifth Avenue."
    },
    {
        "couponCode": "EXPSHIP",
        "couponTitle": "Saks Fifth Avenue Coupon Code: Get Free Shipping on Orders $100+",
        "couponDescription": "Shop at Saks Fifth Avenue and get free shipping on orders over $100. Enter this coupon code at checkout."
    },
    {
        "couponCode": "ENJOY24SF",
        "couponTitle": "Get $300 Off Your Order",
        "couponDescription": "Enjoy up to $300 off when you use this Saks Fifth Avenue code."
    },
    {
        "couponCode": "STYLE25SF",
        "couponTitle": "Saks Fifth Avenue Promo Code: Get Up to 15% Off Your Order",
        "couponDescription": "Redeem this promo code at checkout and receive up to a 15% discount on your order."
    },
    {
        "couponCode": "APP24SF",
        "couponTitle": "Saks Fifth Avenue Coupon: 15% Off Your App Purchase ",
        "couponDescription": "Get a fantastic deal on your current Saks Fifth Avenue shopping spree by using the Saks App. Enjoy a delightful discount of 15% off on your current purchase when you use this coupon code, valid for both full-price and sale items. This exclusive deal is available from January 29th to February 8th, so make sure you don't miss out."
    },
    {
        "couponCode": "NPDEC24SF",
        "couponTitle": "Saks Fifth Avenue Coupon: 10% Off Your Order",
        "couponDescription": "Save 10% on clothing, shoes and more at Saks Fifth Avenue."
    }
]