[
    {
        "couponCode": "CFOLLOW15",
        "couponTitle": "15% Off with CouponFollow Exclusive Code",
        "couponDescription": "Save 15% on orders of $150 or more with this exclusive CouponFollow promo code at checkout. Excludes sale items and collaborations."
    },
    {
        "couponCode": "CFOLLOW10",
        "couponTitle": "Save 10% on Your Order | CouponFollow Exclusive",
        "couponDescription": "Enjoy 10% off your order at White Fox Boutique when this CouponFollow exclusive promo code is applied to your cart. Not valid on sale items and collaborations."
    },
    {
        "couponCode": "GIFT30",
        "couponTitle": "30% Off at White Fox Boutique with Coupon",
        "couponDescription": "Enjoy 30% off everything at White Fox Boutique with this promo code. Discount not valid on gift cards and collaborations. Only for AU customers."
    },
    {
        "couponCode": "APP15",
        "couponTitle": "White Fox Promo Code: 15% Off Your Order",
        "couponDescription": "Get 15% off your purchase when you shop via the White Fox Boutique app and enter this discount code at checkout."
    },
    {
        "couponCode": "SHOP30",
        "couponTitle": "White Fox End of the Year Sale: Get 30% Off Sitewide",
        "couponDescription": "Get 30% off your entire purchase at White Fox Boutique by applying this coupon code at checkout. This discount applies to already reduced items but excludes gift cards and collaborations. Cannot be combined with other promotions."
    },
    {
        "couponCode": "SAVE40",
        "couponTitle": "Score 40% Off Sitewide - 6 hours only",
        "couponDescription": "Get 40% off sitewide excluding gift cards and Sarah's Day collaborations. Starts 11 AM PDT Monday 12th August 2024 and ends 4:59 PM PDT Monday 12th August 2024"
    },
    {
        "couponCode": "APP25",
        "couponTitle": "Save 25% with Code",
        "couponDescription": "Shop apparel with the White Fox app and get 25% off your purchase with this discount code."
    },
    {
        "couponCode": "SALE40",
        "couponTitle": "40% Off with White Fox Coupon Code",
        "couponDescription": "Get the latest styles from White Fox and use this coupon code to save 40% on your order."
    },
    {
        "couponCode": "SALE25",
        "couponTitle": "White Fox Pre Black Friday Sale: Get 25% Off Sitewide",
        "couponDescription": "Get a head start on your Black Friday shopping with White Fox Boutique's Pre-Black Friday Frenzy. Use this promo code to score 25% off sitewide."
    },
    {
        "couponCode": "JULIASTT",
        "couponTitle": "White Fox Promo Code: Get Up to 10% Off Any Order ",
        "couponDescription": "Redeem this promo code at checkout and save up to 10% on any order."
    },
    {
        "couponCode": "TAKE30",
        "couponTitle": "White Fox Coupon Code: 30% Off Your Order",
        "couponDescription": "Enjoy 30% off your entire purchase at White Fox, including sale items, when you apply this coupon code at checkout."
    },
    {
        "couponCode": "LIANA",
        "couponTitle": "Save 15% on Any Purchase ",
        "couponDescription": "Shop at White Fox and get an 15% discount on any purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "WALKERTWINS",
        "couponTitle": "Get Up to 10% Off Any Order ",
        "couponDescription": "Paste this promo code at checkout and save up to 10% on any order."
    },
    {
        "couponCode": "FARROWTWINS",
        "couponTitle": "Receive 15% Off Your Order",
        "couponDescription": "Use this White Fox promotional code during checkout to get 15% off your qualifying purchase."
    },
    {
        "couponCode": "TAKE20",
        "couponTitle": "Take 20% Off Your Order",
        "couponDescription": "Enter this code at checkout to save 20% at White Fox when you shop for clothing, shoes, and accessories."
    },
    {
        "couponCode": "HARPERTT",
        "couponTitle": "White Fox Coupon Code: Take 15% Off Any Purchase ",
        "couponDescription": "Enjoy a 15% discount on any purchase when you enter this coupon code at checkout."
    }
]