[
    {
        "couponCode": "TOOMUCH",
        "couponTitle": "Burt's Bees Coupon Code: Extra 20% Off Your Order",
        "couponDescription": "Shop and get an extra 20% off your purchase sitewide using a discount code at checkout."
    },
    {
        "couponCode": "20OFF",
        "couponTitle": "Get 20% Discount Using Promo Code",
        "couponDescription": "Score up to 20% off with promo code"
    },
    {
        "couponCode": "15OFF",
        "couponTitle": "Burt's Bees Coupon: Take 15% Off Your Order",
        "couponDescription": "Use this Burt's Bees discount code to save 15% on any purchase."
    },
    {
        "couponCode": "GIFT20",
        "couponTitle": "Take 20% Off Your Order",
        "couponDescription": "Apply the promo code to receive 20% off your complete next order across the board."
    },
    {
        "couponCode": "BEEMINE",
        "couponTitle": "Burt's Bees Coupon: $5 Off Your Order",
        "couponDescription": "Enjoy a sweet deal with $5 off your current purchase at Burt's Bees, your trusted source for all-natural beauty and skincare products. The discount applies to their popular lip care and baby essentials categories, so you can pamper yourself and the little ones."
    },
    {
        "couponCode": "FAMILY20",
        "couponTitle": "Burt's Bees Coupon: 20% Off All Orders",
        "couponDescription": "Apply this promo code to receive a 20% discount on our best-selling items."
    },
    {
        "couponCode": "SAVE10",
        "couponTitle": "Burt's Bees Coupon: 10% Off Your Order",
        "couponDescription": "Get up to 10% off sitewide by using this Burt's Bees code."
    },
    {
        "couponCode": "SELFCARE",
        "couponTitle": "Get Free Gift Orders Of $40+",
        "couponDescription": "Enjoy free gift when you spend $40 and more at Burt's Bees."
    },
    {
        "couponCode": "HOLIDAYBALM",
        "couponTitle": "Burt's Bees Coupon: 20% Off Your Order",
        "couponDescription": "Don't forget to enter this promotional code at checkout to receive 20% off personalized lip balms."
    },
    {
        "couponCode": "TOWELETTE",
        "couponTitle": "Burt's Bees Coupon: 20% Off Your Order + Free Sensitive Facial Cleansing Towelettes on Orders Over $35",
        "couponDescription": "Enjoy 20% off on your Burt's Bees order with this coupon code. Plus, receive a complimentary gift when you spend $35 or more."
    },
    {
        "couponCode": "TWITCH20",
        "couponTitle": "Burt's Bees Coupon: Take 20% Off Any Purchase",
        "couponDescription": "Add this Burt's Bees promo code to receive 20% off the entire site."
    },
    {
        "couponCode": "FREESHIPNOW",
        "couponTitle": "Free Shipping Available With Your Purchase",
        "couponDescription": "Enjoy Free Shipping on Your Order"
    },
    {
        "couponCode": "COMEBACK20",
        "couponTitle": "Get 20% Discount With Promo Code Use",
        "couponDescription": "Take 20% Off When You Use Promo Code"
    },
    {
        "couponCode": "LASTCHANCE20",
        "couponTitle": "Enjoy Up To 40% Discount With The Coupon",
        "couponDescription": "Get up to 40% off with coupon"
    },
    {
        "couponCode": "SWAG",
        "couponTitle": "Save 30% on Any Purchase ",
        "couponDescription": "Shop at Burt's Bees and get a 30% discount on any purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "TRIO",
        "couponTitle": "Burt's Bees Coupon: 20% Off Your Order + Free Gift on Orders Over $40",
        "couponDescription": "This Black Friday, enjoy 20% off sitewide with this coupon code. When you spend $40 or more, you'll also receive a delightful free gift from burtsbees.com."
    },
    {
        "couponCode": "SAVE15",
        "couponTitle": "Burt's Bees Coupon Code: Get 15% Off Your Order",
        "couponDescription": "Use this promo code at checkout to receive an extra 15% off select items."
    },
    {
        "couponCode": "SHIPFREE",
        "couponTitle": "Burt's Bees Coupon: Take Free Shipping On Your Order",
        "couponDescription": "Receive free shipping when you add this Burt's Bees code."
    },
    {
        "couponCode": "SHIPIT",
        "couponTitle": "Burt's Bees Coupon: Get Free Shipping on Your Order",
        "couponDescription": "Get ready to pucker up this Valentine's Day with the perfect personalized lip balm from Burt's Bees. Use the coupon code and enjoy free shipping on your order. Not only does Burt's Bees offer high quality, natural skincare products, but they're also committed to sustainable practices and nurturing the environment."
    },
    {
        "couponCode": "15OFFNOW",
        "couponTitle": "Burt's Bees Coupon: 15% Off Your Order",
        "couponDescription": "Get ready to nourish your skin and save some cash with 15% off at burtsbees.com. This sweet coupon code applies to a wide range of categories, including lip care, skincare, makeup, body & hair care, and baby products."
    }
]