[
    {
        "couponCode": "BCANEWS10",
        "couponTitle": "Bear Creek Arsenal Coupon: Extra 10% Off Your Order",
        "couponDescription": "Use this promotional code at checkout to score an additional 10% off your qualifying purchase."
    },
    {
        "couponCode": "Buck",
        "couponTitle": "Bear Creek Arsenal Discount Code: Extra 10% Off Your Order",
        "couponDescription": "Save an additional 10% using this coupon code on your sitewide purchase at Bear Creek Arsenal."
    },
    {
        "couponCode": "BCAMISS",
        "couponTitle": "Take 10% Off Your Order",
        "couponDescription": "Save up to 10% on select items with this Bear Creek Arsenal code."
    },
    {
        "couponCode": "bcatext10",
        "couponTitle": "Bear Creek Arsenal Coupon: Extra 10% Off Your Order",
        "couponDescription": "Enjoy an additional 10% off your qualifying purchase using this promotional code at checkout."
    },
    {
        "couponCode": "BCACB10",
        "couponTitle": "Bear Creek Arsenal Coupon Code: 10% Off",
        "couponDescription": "Enter this Bear Creek Arsenal discount code at checkout on your next order and get 10% off."
    },
    {
        "couponCode": "BRANDYNBAKER",
        "couponTitle": "Bear Creek Arsenal Coupon: Get Up to 70% Off",
        "couponDescription": "Apply this Bear Creek Arsenal promo code to receive up to 70% off on your purchases."
    },
    {
        "couponCode": "ck10",
        "couponTitle": "Take $290 Off on Your Purchases at Bear Creek Arsenal",
        "couponDescription": "Score $290 off at Bear Creek Arsenal when you apply this coupon code at checkout."
    },
    {
        "couponCode": "DANGERSHOW",
        "couponTitle": "Bear Creek Arsenal Promo Code: Save 5% on Your Order",
        "couponDescription": "Receive 5% off on your purchases at Bear Creek Arsenal when this promo code is applied."
    },
    {
        "couponCode": "SPRING1075",
        "couponTitle": "Get $10 Off Your Order of $75+",
        "couponDescription": "Get an extra $10 off your order of $75 or more with this Bear Creek Arsenal coupon code. Plus get free shipping on any barrel purchase."
    }
]