[
    {
        "couponCode": "APPMVP15",
        "couponTitle": "True Religion Promo Code: Get 15% Off Your Order ",
        "couponDescription": "Redeem this promo code at checkout and save 15% on your order."
    },
    {
        "couponCode": "CYBER",
        "couponTitle": "True Religion Promo Code: Extra 20% Off Your Order",
        "couponDescription": "Receive an additional 20% off your $150+ purchase with this discount code at True Religion."
    },
    {
        "couponCode": "TRUEAPP",
        "couponTitle": "Take 15% Off Sitewide",
        "couponDescription": "Enter this True Religion coupon code at checkout to get 15% off your next purchase of denim, shorts, shirts, and more."
    },
    {
        "couponCode": "TR20",
        "couponTitle": "True Religion Discount Code: Extra 20% Off Your Order",
        "couponDescription": "Save an additional 20% using this coupon code on your sitewide purchase at True Religion."
    },
    {
        "couponCode": "BFSAVE",
        "couponTitle": "Get 20% Off Any Order $150+ ",
        "couponDescription": "Paste this promo code at checkout and save 20% on any order of $150 or more."
    },
    {
        "couponCode": "TR15",
        "couponTitle": "True Religion Coupon: 15% Off Your Purchase",
        "couponDescription": "When this promotional code is applied at checkout, you can take 15% off your qualifying order."
    },
    {
        "couponCode": "GIFT",
        "couponTitle": "Save 20% Off using Coupon Code",
        "couponDescription": "Get 20% off with promo code on $150+ orders"
    },
    {
        "couponCode": "save20",
        "couponTitle": "True Religion Coupon: 20% Off All Orders",
        "couponDescription": "Use this coupon to get an additional 20% off orders over $150 at True Religion."
    },
    {
        "couponCode": "TRFRIEND",
        "couponTitle": "True Religion Coupon: 50% Off Plus Extra 20% Off Purchases Over $150",
        "couponDescription": "Get ready to revamp your wardrobe with truereligion.com's Friends and Family Sale. Enjoy a whopping 50% off on everything you love sitewide. Plus, when you make a purchase of $150 or more, we're treating you to an extra 20% off. It's the perfect opportunity to snag all those trendy pieces you've been eyeing."
    },
    {
        "couponCode": "DENIM20",
        "couponTitle": "True Religion Discount Code: Extra 20% Off Your Order",
        "couponDescription": "Shop at True Religion and take an additional 20% off when you shop for 2 pairs of jeans using this coupon code on your cart."
    }
]