[
    {
        "couponCode": "GOBONELESS",
        "couponTitle": "Buffalo Wild Wings Coupon: Get Free on Orders $15+ Sitewide",
        "couponDescription": "Enjoy 10 free boneless wings when you spend $15 or more at Buffalo Wild Wings sitewide with this coupon. Get tasty wings and save big with this limited-time offer. Order now and satisfy your cravings without breaking the bank."
    },
    {
        "couponCode": "GOWINGS",
        "couponTitle": "Free Wings on Your Order",
        "couponDescription": "Take 6 free wings on your purchase worth $10 using a coupon code on your cart."
    },
    {
        "couponCode": "GH30",
        "couponTitle": "Buffalo Wild Wings Coupon: Take 30% Off Your First Order",
        "couponDescription": "Save 30% on your first order at Buffalo Wild Wings with this coupon. Enjoy bold flavors and crispy wings at a lower price. Don't miss this limited-time deal for new customers."
    },
    {
        "couponCode": "STARRYDUBS",
        "couponTitle": "Buffalo Wild Wings Discount Code: Buy 1 Get 1 Starry Drink Free ",
        "couponDescription": "Purchase one starry drink and get another free. Apply this discount code at checkout."
    },
    {
        "couponCode": "WINGDAY",
        "couponTitle": "Take 6 Free Wings Purchase Of $10",
        "couponDescription": "Enjoy 6 free wings when you spend $10 with this Buffalo Wild Wings code."
    },
    {
        "couponCode": "HTA-TEAMA",
        "couponTitle": "Save 10% off Total Carry Out Order",
        "couponDescription": "Save 10% off your carry out order when you apply this promo code at checkout."
    },
    {
        "couponCode": "TRAVISHUNTER",
        "couponTitle": "Buffalo Wild Wings Coupon Code: Get 6 Free Wings on Orders $10 or More",
        "couponDescription": "Shop at Buffalo Wild Wings and get free six free wings on orders of $10 or more. Enter this coupon code at checkout."
    },
    {
        "couponCode": "AUTO-APPLIED",
        "couponTitle": "Get 40 Wings + Fries For $39.99",
        "couponDescription": "Get 20 traditional & 20 boneless wings + fries for $39.99 when you order online and use this promo code at checkout."
    },
    {
        "couponCode": "autoAppIndex",
        "couponTitle": "Get Big Flavor Bundles Starting $8.99",
        "couponDescription": "Enjoy big flavor for less with bundles starting at just $8.99 at Buffalo Wild Wings."
    },
    {
        "couponCode": "SAUCE",
        "couponTitle": "Buffalo Wild Wings Code: 20% Off BWW Web/App Orders",
        "couponDescription": "Use this Buffalo Wild Wings coupon code at checkout to enjoy 20% off your orders up to $5 off BWW web/App purchases."
    }
]