[
    {
        "couponCode": "V1KGKVWZ",
        "couponTitle": "Up to 40% Off Your Purchase",
        "couponDescription": "Score up to 40% off your purchase at Canvas Discount. Use code at checkout."
    },
    {
        "couponCode": "AFF10",
        "couponTitle": "Canvas Discount Offer: 10% Off Any Order Sitewide",
        "couponDescription": "Enhance your space with 10% off personalized decor at CanvasDiscount.com. From custom canvases to prints and cushion covers. Use this code at checkout."
    },
    {
        "couponCode": "HUG15",
        "couponTitle": "Take 15% Off Photo Blankets ",
        "couponDescription": "Enjoy shopping and get a 15% discount on photo blankets when you enter this coupon code at checkout."
    },
    {
        "couponCode": "20PIXEL",
        "couponTitle": "Save Up to 20% on Your Purchase ",
        "couponDescription": "Shop at Canvas Discount and get up to a 20% discount on your purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "GIFT24",
        "couponTitle": "Get 20% Off Your Order ",
        "couponDescription": "Shop now at Canvas Discount and receive a 20% discount on your order. Paste this discount code at checkout."
    },
    {
        "couponCode": "SAVINGS25",
        "couponTitle": "Canvas Discount Promo Code: Get Extra 25% Off Any Order ",
        "couponDescription": "Redeem this promo code at checkout and save an extra 25% on any order."
    },
    {
        "couponCode": "FOMO30",
        "couponTitle": "CanvasDiscount Promo Code: Take Up to 30% Off Your Purchase",
        "couponDescription": "Use this CanvasDiscount promo code to save up to 30% on your purchase. Shop a wide range of canvas prints and custom products at discounted prices. Dont miss out on this limited-time offer."
    },
    {
        "couponCode": "UP82",
        "couponTitle": "Up to 82% Off Your Purchase",
        "couponDescription": "Shop at Canvas Discount for canvas prints and more; use this code to take up to 82% off on sale prices."
    },
    {
        "couponCode": "PRINTS50",
        "couponTitle": "Save 50% on Wall Art Order",
        "couponDescription": "Shop at Canvas Discount and enjoy a 50% discount on wall art order. Apply this discount code at checkout."
    },
    {
        "couponCode": "SIPANDSAVE",
        "couponTitle": "Canvas Discount Promo Code: Get 10% Off Photo Mugs ",
        "couponDescription": "Redeem this promo code at checkout and save 10% on photo mugs."
    },
    {
        "couponCode": "BOOKOFJOY",
        "couponTitle": "Enjoy 10% Off Select Items",
        "couponDescription": "Apply this coupon code at checkout to get 10% off custom photo books at CanvasDiscount.com today. Capture memories in high-quality prints. Take advantage of this limited-time offer now."
    },
    {
        "couponCode": "GRANDSALE",
        "couponTitle": "Take Up To 5% Off Your Order",
        "couponDescription": "Save at Canvas Discount by getting up to 5% on your purchase."
    },
    {
        "couponCode": "83T2OQGH",
        "couponTitle": "Canvas Discount Offer: Up to 15% Off Your Order",
        "couponDescription": "Shop at Canvas Discount and redeem this promo code at checkout to save up to 15% on your order."
    },
    {
        "couponCode": "UP80",
        "couponTitle": "Up to 15% Off Any Order",
        "couponDescription": "Get custom photo calendars, mugs, blankets, and more. Use code for up to 15% off your entire order at Canvas Discount."
    },
    {
        "couponCode": "FURBABY20",
        "couponTitle": "Canvas Discount Promo Code: 20% Off Any Pet Portraits and Gifts",
        "couponDescription": "Redeem this promo code at checkout and save 20% on any pet portraits and gifts."
    },
    {
        "couponCode": "VIEWBUG",
        "couponTitle": "Canvas Discount Coupon: Up to 25% Off Any Purchase",
        "couponDescription": "Embrace creativity and save big at Canvas Discount. Enjoy up to 25% off your purchase when you enter this code checkout."
    },
    {
        "couponCode": "plushdeal",
        "couponTitle": "Buy 3, Get 30% Off on Cushions ",
        "couponDescription": "Enjoy shopping and get a 30% discount when you purchase three or more cushions. Enter this coupon code at checkout."
    },
    {
        "couponCode": "ALESPROULE25",
        "couponTitle": "Score 25% Off Your Purchase",
        "couponDescription": "Input this code before finalizing your purchase to get 25% off on your Canvas Discount order."
    },
    {
        "couponCode": "FALL25OFF",
        "couponTitle": "Save 25% Off Using Code",
        "couponDescription": "Score 25% off with coupon code"
    },
    {
        "couponCode": "FDAY25OFF",
        "couponTitle": "Canvas Discount Coupon: 25% Off Your Purchase",
        "couponDescription": "Unleash your inner artist with a generous 25% off discount at canvasdiscount.com, where your creativity meets affordability. Save on their custom photo canvases, personalized wall decals, and unique photo gifts."
    }
]