[
    {
        "couponCode": "FLASH20",
        "couponTitle": "20% Off Your Purchase",
        "couponDescription": "Enjoy 20% off on your purchase when you use this Shoe Palace discount code upon checkout."
    },
    {
        "couponCode": "INFRARED60",
        "couponTitle": "Extra $60 Off Your Purchase of $200 and Above",
        "couponDescription": "Use this Shoe Palace coupon code at checkout to get an extra $60 off on $200 or more orders."
    },
    {
        "couponCode": "DEATHROW25",
        "couponTitle": "Get Up to 25% Off on Death Row Items",
        "couponDescription": "Score up to 25% off on Death Row items when you add this Shoe Palace promo code at checkout."
    },
    {
        "couponCode": "MABOGO",
        "couponTitle": "Buy One, Get One Free Maison Article ",
        "couponDescription": "If you have two or more qualifying Maison Article items in your cart, you'll receive a BOGO deal with this Shoe Palace coupon code."
    },
    {
        "couponCode": "GOLD70",
        "couponTitle": "Shoe Palace Promo Code: $70 Off",
        "couponDescription": "Shop and get $10 off storewide favorites using this discount code on your purchase at Shoe Palace."
    },
    {
        "couponCode": "REEBOK",
        "couponTitle": "Shoe Palace Coupon Code: Take 40% Off Your Purchase ",
        "couponDescription": "Enjoy a 40% discount on your purchase when you enter this Shoe Palace coupon code at checkout."
    },
    {
        "couponCode": "RETRO",
        "couponTitle": "Shoe Palace Discount Code: $50 Off Any Order Sitewide",
        "couponDescription": "Enjoy a $50 discount on any purchase when you enter this Shoe Palace coupon code at checkout."
    },
    {
        "couponCode": "SALE25",
        "couponTitle": "Shoe Palace Coupon: Extra 25% Off Sale Items",
        "couponDescription": "Score up to an extra 25% off on items from the sale section of the website. Input the code before finalizing your purchase."
    },
    {
        "couponCode": "APP_15",
        "couponTitle": "Get 15% Off on Full-Price Apparel",
        "couponDescription": "Score 15% off on full-price apparel at Shoe Palace. Enter the code when checking out."
    },
    {
        "couponCode": "aj70",
        "couponTitle": "Shoe Palace Coupon: $70 Off Your Order",
        "couponDescription": "Take $70 off select men's air jordan 1 retro high OG at Shoe Palace."
    },
    {
        "couponCode": "COWBOYS30",
        "couponTitle": "Save Up to 30% on Your Purchase ",
        "couponDescription": "Shop at Shoe Palace and enjoy up to a 30% discount on your purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "FLASH40",
        "couponTitle": "Shoe Palace Coupon Code: 40% Off Your Purchase",
        "couponDescription": "Enjoy 40% off select styles at shoepalace.com when you use this coupon code at checkout."
    },
    {
        "couponCode": "TIMBERLAND",
        "couponTitle": "Get 40% Off Your Order",
        "couponDescription": "Paste this Shoe Palace promo code at checkout and save 40% on your order."
    },
    {
        "couponCode": "SKY75",
        "couponTitle": "Shoe Palace Coupon: Take $75 Off Any Purchase",
        "couponDescription": "Use this Shoe Palace coupon code to save $75 on the Air Jordan 1 High OG Skyline Lifestyle shoes."
    },
    {
        "couponCode": "VARSITY",
        "couponTitle": "Shoe Palace Coupon Code: 30% Off Your Order",
        "couponDescription": "Use this coupon code when you buy a varsity jacket at shoepalace.com and enjoy 30% off."
    },
    {
        "couponCode": "FLASH25",
        "couponTitle": "Up to 25% Off Your Order With Shoe Palace Code",
        "couponDescription": "Redeem this Shoe Palace promo code at checkout and save up to 25% on your order."
    },
    {
        "couponCode": "LILAC40",
        "couponTitle": "Shoe Palace Coupon Code: 40% Off Your Purchase ",
        "couponDescription": "Enter this Shoe Palace coupon code at checkout and enjoy 40% off on your purchase."
    },
    {
        "couponCode": "APP10",
        "couponTitle": "Shoe Palace Discount Code: Up to 10% Off Apparel",
        "couponDescription": "Explore Shoe Palace for apparel and enjoy up to 10% off by adding this code during the checkout process."
    },
    {
        "couponCode": "APP_25",
        "couponTitle": "Get Up to 25% Off on Shoe Palace Apparel",
        "couponDescription": "Score up to 25% off on select apparel when you apply this Shoe Palace coupon code at checkout."
    },
    {
        "couponCode": "Dickies",
        "couponTitle": "Take 30% Off Any Purchase ",
        "couponDescription": "Enjoy shopping and get a 30% discount on any purchase when you enter this Shoe Palace coupon code at checkout."
    }
]