[
    {
        "couponCode": "SWATCHES",
        "couponTitle": "Up To 20% Off Your Order At Minerva Crafts",
        "couponDescription": "Add this Minerva Crafts coupon code at checkout to apply 10% off your orders and Minerva Craft Club members save 20%."
    },
    {
        "couponCode": "VELVETY",
        "couponTitle": "Get 30% Off All End-of-Line Velvet Fabrics",
        "couponDescription": "Enjoy shopping at Minerva Crafts and receive a 30% discount on all end-of-line velvet fabrics. Redeem this coupon code at checkout."
    },
    {
        "couponCode": "FLEECE30",
        "couponTitle": "Minerva Crafts Coupon: 30% Off Your Order",
        "couponDescription": "Take 30% off end-of-line fleece fabric this weekend by adding this Minerva Crafts code."
    },
    {
        "couponCode": "LOUDENLOW",
        "couponTitle": "Take Up to 40% Off Your Order w/ Coupon",
        "couponDescription": "Receive a 30% discount on all fabrics or 40% off for all Craft Club members using this Minerva Crafts promo code at checkout."
    },
    {
        "couponCode": "AUTUMNFEELS",
        "couponTitle": "Minerva Crafts Coupon: 30% Off Your Purchase",
        "couponDescription": "Don't forget to enter this promotional code at checkout to receive 30% off select fabrics."
    },
    {
        "couponCode": "THANKYOU",
        "couponTitle": "Minerva Crafts Coupon: 10% Off All Orders",
        "couponDescription": "Use this coupon code from Minerva Crafts to save 10% on your order."
    },
    {
        "couponCode": "FABRICBEE",
        "couponTitle": "Take 10% Off Your Order",
        "couponDescription": "Save 10% on selected fabric purchase at Minerva Crafts."
    },
    {
        "couponCode": "LOVEKNITS",
        "couponTitle": "Take 30% Off Your Order",
        "couponDescription": "Save 30% on all knit fabrics for craft club members at Minerva Crafts."
    },
    {
        "couponCode": "CRAFTYCHICK",
        "couponTitle": "Get 30% Off Your Purchase",
        "couponDescription": "Receive 30% off selected bird print fabrics by adding this Minerva Crafts code."
    },
    {
        "couponCode": "HOTCROSS",
        "couponTitle": "Take 30% Off Ex Designer Deadstock Fabrics ",
        "couponDescription": "Enjoy shopping and get a 30% discount on ex designer deadstock fabrics when you enter this coupon code at checkout."
    },
    {
        "couponCode": "DOTSNSPOTS",
        "couponTitle": "35% Off on All Orders",
        "couponDescription": "At Minerva, use the code to save 25% on a selection of spotty fabric. Craft Club members receive a 35% discount."
    },
    {
        "couponCode": "EMERALD",
        "couponTitle": "Get 30% Off Your Order",
        "couponDescription": "Receive 30% off selected green fabric right now with this Minerva Crafts code."
    },
    {
        "couponCode": "BLOOM",
        "couponTitle": "Enjoy 20% Off Your Purchase",
        "couponDescription": "Enjoy 20% off select floral fabric at Minerva Crafts with this promo code. Additionally, Minerva Craft Club members can save 30% on their purchases. Don't miss out on this limited-time offer."
    },
    {
        "couponCode": "IAMWOMAN",
        "couponTitle": "Minerva Crafts Coupon: Get Up to 10% Off Your Purchase",
        "couponDescription": "Apply this Minerva Crafts discount code during checkout to enjoy up to 10% off your qualifying order."
    },
    {
        "couponCode": "VISCOSE",
        "couponTitle": "Get 20% Off Your Order",
        "couponDescription": "Take 20% off viscose jersey with this Minerva Crafts code."
    },
    {
        "couponCode": "HIBARBIE",
        "couponTitle": "Minerva Crafts Coupon Code: Take 30% Off Any Pink Fabric ",
        "couponDescription": "Enjoy a 30% discount on any pink fabric when you enter this coupon code at checkout."
    },
    {
        "couponCode": "RIB40",
        "couponTitle": "30% Off Your Order",
        "couponDescription": "Get 30% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "SEWNATURAL",
        "couponTitle": "Take 20% Off Your Order",
        "couponDescription": "Get 20% off selected fibers by adding this Minerva Crafts code."
    },
    {
        "couponCode": "REFRESH",
        "couponTitle": "Minerva Crafts Coupon: 15% Off Your Order",
        "couponDescription": "Revamp your space with Minerva's premium upholstery textiles. Apply this coupon during checkout to save 15%. Craft Club members enjoy an even bigger 25% savings. Elevate your home décor at a fraction of the cost."
    },
    {
        "couponCode": "LIBERTYLAWN",
        "couponTitle": "Take 20% Off All Liberty London Lawn Fabric Products ",
        "couponDescription": "Enjoy shopping and get a 20% discount on Liberty London lawn fabric products when you enter this coupon code at checkout."
    }
]