[
    {
        "couponCode": "A35OUT20EE",
        "couponTitle": "Lands' End Business Promo Code: 30% Off + 20% Off",
        "couponDescription": "Apply 30% off select outerwear + 20% off everything else at checkout when you purchase using this discount code on your cart."
    },
    {
        "couponCode": "W40OUT25EE",
        "couponTitle": "Lands' End Business Coupon: 40% Off Your Outerwear Order & 25% Off Everything Else",
        "couponDescription": "Use this promo code to enjoy 40% off on all outerwear and 25% off on everything else in the Lands' End Business collection. Please note that some exclusions may apply."
    },
    {
        "couponCode": "W50",
        "couponTitle": "Lands' End Business Coupon: 50% Off Your Order",
        "couponDescription": "Remember to apply this promotional code at checkout to save 50% on your select purchase."
    },
    {
        "couponCode": "EHOL35FS",
        "couponTitle": "Save 35% Off w/ Discount Code",
        "couponDescription": "Get 35% off with coupon"
    },
    {
        "couponCode": "A30FLEECE",
        "couponTitle": "Take 30% Off Your Order",
        "couponDescription": "Save at Lands' End by getting up to 30% on fleece."
    },
    {
        "couponCode": "WUP40",
        "couponTitle": "Take 40% Off Your Order",
        "couponDescription": "Big savings at Land's End by enjoying up to 40% on your purchase."
    },
    {
        "couponCode": "VALUE10",
        "couponTitle": "Lands' End Business Outfitters Coupon: 10% Off Your Order",
        "couponDescription": "Enter this promo code at checkout to save an extra 10% when you spend $5,000 or more on select items."
    },
    {
        "couponCode": "WOCTVEST",
        "couponTitle": "Take 40% Off Your Order",
        "couponDescription": "Save 40% on LE vest by adding this Lands' End discount code."
    },
    {
        "couponCode": "W30FLEECE",
        "couponTitle": "30% Off Your Order",
        "couponDescription": "Shop and take 30% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "W15FS",
        "couponTitle": "Take 15% Off Labeled Items",
        "couponDescription": "Enjoy shopping and get a 15% discount on labeled items when you enter this coupon code at checkout."
    },
    {
        "couponCode": "A25",
        "couponTitle": "Lands' End Business Coupon: 25% Off Your Order",
        "couponDescription": "Use this coupon code and enjoy a whopping 25% off on all Lands' End labeled merchandise at business.landsend.com."
    },
    {
        "couponCode": "A50",
        "couponTitle": "Up to 50% Off Your Purchase w/ Coupon",
        "couponDescription": "Save up to 50% on your eligible order when this Lands' End Business discount code is applied."
    },
    {
        "couponCode": "A30PP10",
        "couponTitle": "Lands' End Business Discount Code: Save 30% on Lands' End Styles ",
        "couponDescription": "Shop at  Lands' End Styles and enjoy a 30% discount on  Lands' End styles. Apply this discount code at checkout."
    },
    {
        "couponCode": "W30PP10",
        "couponTitle": "Lands' End Business Coupon: Extra 30% Off Your Purchase",
        "couponDescription": "Enjoy an additional 30% off store-wide orders on your cart using this promo code at Lands' End Business."
    },
    {
        "couponCode": "AUP40",
        "couponTitle": "Lands' End Business Outfitters Coupon: Up to 40% Off Your Order",
        "couponDescription": "Get ready to dive into sensational savings at business.landsend.com with their Early Black Friday Event. Enjoy a whopping discount of up to 40% on your favorite business attire and accessories. Don't miss this chance to revamp your wardrobe with high-quality, stylish pieces for less. Hurry, the best deals won't last long."
    },
    {
        "couponCode": "W20FS",
        "couponTitle": "Lands' End Business Promo Code: 20% Off + Free Shipping",
        "couponDescription": "Shop and get 20% off select styles + free shipping using this discount code on your purchase at Lands' End Business."
    },
    {
        "couponCode": "AOCTVESTS",
        "couponTitle": "Take 40% Off Select Vests + 20% Off All Other Labeled Products",
        "couponDescription": "Get a 40% discount on select vests and 20% off on other labeled products. Enter this coupon code at checkout."
    },
    {
        "couponCode": "A25FS",
        "couponTitle": "Lands' End Business Coupon: 25% Off Your Order & Free Shipping",
        "couponDescription": "Unlock 25% off your order at business.landsend.com when you use this coupon code. Refresh your team's uniforms or enhance your office's promotional products with this deal."
    },
    {
        "couponCode": "AHOL40FLEECE",
        "couponTitle": "40% Off + 20% Off Your Order",
        "couponDescription": "Shop and get 40% off select fleece + 20% off all other LE labeled using a promo code on your cart."
    },
    {
        "couponCode": "AHOL30",
        "couponTitle": "Lands' End Business Promo Code: 30% Off Your Order",
        "couponDescription": "Shop using this discount code and get 30% off sitewide orders on your purchase at Lands' End Business."
    }
]