[
    {
        "couponCode": "R9-8EY9-5C",
        "couponTitle": "Save Extra 20% on Your Purchase ",
        "couponDescription": "Shop at Lovehoney CA and get an extra 20% discount on your purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "BF20OFF",
        "couponTitle": "Lovehoney CA Discount Code: Extra 20% Off Your Order",
        "couponDescription": "Shop and take an extra 20% off your purchase sitewide using a coupon code on your cart."
    },
    {
        "couponCode": "KEELIN20",
        "couponTitle": "Lovehoney CA Coupon Code: Take 20% Off Any Purchase ",
        "couponDescription": "Enjoy a 20% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "TREAT",
        "couponTitle": "Get 20% Off Your Order",
        "couponDescription": "Enjoy 20% off when you spend above $125 and more at Lovehoney CA."
    },
    {
        "couponCode": "AFF-BLOGBFCM5",
        "couponTitle": "Take Extra 5% Off Sale Items ",
        "couponDescription": "Enjoy shopping at Lovehoney CA and receive an extra 5% discount on sale items. Enter this discount code at checkout."
    },
    {
        "couponCode": "SPICEITUP",
        "couponTitle": "Love Honey Coupon: 50% Off Your Order",
        "couponDescription": "Save 50% on 1 LH item by adding this Love Honey code."
    },
    {
        "couponCode": "BBFAV",
        "couponTitle": "Lovehoney CA Promo Code: 20% Off Your Order",
        "couponDescription": "Shop and take 20% off your purchase using a coupon code on your cart."
    },
    {
        "couponCode": "SINGLE",
        "couponTitle": "Lovehoney Coupon: Extra 11% Off Your Order",
        "couponDescription": "Experience the ultimate savings with an additional 11% discount on top of the already discounted Black Friday Deals - all part of Lovehoney CA's Singles' Day celebration. Today is the perfect opportunity to save money at Lovehoney CA not only because of these significant discounts, but also because combining Singles' Day and Black Friday deals means you get more value for your money."
    },
    {
        "couponCode": "WEEKEND",
        "couponTitle": "Get 25% Discount Using Promo Code",
        "couponDescription": "Take 25% off with promo code"
    },
    {
        "couponCode": "FREEVIBE",
        "couponTitle": "Complimentary Vibrator With $120 Purchase",
        "couponDescription": "Get Free Vibrator When You Spend $120"
    },
    {
        "couponCode": "SAVE25",
        "couponTitle": "Get 25% Off Select Toys with Promo Code",
        "couponDescription": "Paste this coupon code at checkout and enjoy a 25% discount on select toys."
    },
    {
        "couponCode": "EXTRA20",
        "couponTitle": "Extra 20% Off Clearance At Lovehoney CA",
        "couponDescription": "Use this Lovehoney CA coupon code at checkout to take an extra 20% off your orders of clearance items."
    },
    {
        "couponCode": "COMMUNITY20",
        "couponTitle": "Get 20% Off Sitewide with Promo Code",
        "couponDescription": "Enter this coupon code at checkout and get a 20% discount on your order."
    },
    {
        "couponCode": "LONGWEEKEND",
        "couponTitle": "Lovehoney CA Promo Code: 50% Off 1 Full Price Item",
        "couponDescription": "Add this Lovehoney CA coupon code at checkout to get 50% off your orders of 1 full price Lovehoney item."
    },
    {
        "couponCode": "EXTRA15",
        "couponTitle": "Get 15% Off Your Order",
        "couponDescription": "Take extra 15% off when you purchase $99 with this Love Honey code."
    },
    {
        "couponCode": "AGAIN",
        "couponTitle": "$20 Off Sitewide",
        "couponDescription": "Unleash your desires with a tempting $20 off promo code for Lovehoney, applicable on a wide range of tantalizing products when you spend $100 or more. Ignite your passion with luxurious lingerie, experience thrilling sensations with exciting adult toys, or explore new fantasies with the daring bondage gear."
    },
    {
        "couponCode": "hon15ey",
        "couponTitle": "15% Off Select Clearance Toys + Kits at Lovehoney",
        "couponDescription": "Before completing your order, make sure you've applied this Lovehoney coupon code. If you have qualifying toys or kits in your cart, you'll save an extra 15%."
    },
    {
        "couponCode": "ANALDAY",
        "couponTitle": "Take Extra 10% Off Anal Toys ",
        "couponDescription": "Enjoy shopping and get an extra 10% discount on anal toys when you enter this coupon code at checkout."
    },
    {
        "couponCode": "VIBE",
        "couponTitle": "Free Mini Massage Wand Vibrator Worth $89.95 with $100 Purchase",
        "couponDescription": "Receive a complimentary Dream Wand Rechargeable Mini Massage Wand Vibrator, valued at $89.95, when you spend $100 or more on your purchases at lovehoney.ca. This special offer is the perfect incentive to indulge in premium quality intimate products while maximizing your savings. With today's fantastic discounts and deals available at Lovehoney CA, there's never been a better time to enjoy great value for your money."
    },
    {
        "couponCode": "FOLLOW12",
        "couponTitle": "*CouponFollow Exclusive* Get 12% Off with Code",
        "couponDescription": "Use our code to get 12% off! Minimum order value: 49$. Time-limited offer. One coupon code per order. Some exclusions may apply."
    }
]