[
    {
        "couponCode": "EYC24",
        "couponTitle": "Save 10% Off",
        "couponDescription": "Use this keh.com coupon code at checkout to claim  receive 10% off select products and 20% off other select products."
    },
    {
        "couponCode": "Gm10e",
        "couponTitle": "Save 10% Off",
        "couponDescription": "Take 10% off with coupon"
    },
    {
        "couponCode": "bf10",
        "couponTitle": "Save 10% with Code",
        "couponDescription": "Receive 10% off your shopping cart when you apply our discount code. Redeem at checkout."
    },
    {
        "couponCode": "ES20",
        "couponTitle": "KEH Camera Discount Code: 20% Off Your Order",
        "couponDescription": "Shop and take 20% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "SALE20",
        "couponTitle": "20% Off camera gear At KEH Camera",
        "couponDescription": "Enter this KEH Camera coupon code at checkout to receive 20% off Cameras and Lenses in the Overstock category as well as 20% off the Accessories, Lighting and Tripods categories."
    },
    {
        "couponCode": "TNC24",
        "couponTitle": "24% Off Your Order",
        "couponDescription": "Shop and take 24% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "YOLO5",
        "couponTitle": "Get 5% Off with Code",
        "couponDescription": "Pick and enjoy 5% discount with coupon code on your purchase. Redeem at checkout."
    },
    {
        "couponCode": "SC-EKMFM09UD",
        "couponTitle": "KEH Discount Code: Get 5% Off Your Order",
        "couponDescription": "Save 5% on your purchase of the Canon EOS R6 Mirrorless Camera at KEH with this promo code. Capture stunning moments with this advanced mirrorless camera at an exclusive discounted price. Shop now and elevate your photography experience."
    },
    {
        "couponCode": "BF10A",
        "couponTitle": "10% Off With Code",
        "couponDescription": "Shop and save at Keh and receive 10% off using a promo code on your cart."
    },
    {
        "couponCode": "W1-V3N3OPPX",
        "couponTitle": "KEH Camera Promo Code: Get 5% Off Canon Eos r6 Mirrorless Camera Body",
        "couponDescription": "Paste this promo code at checkout and save 5% on the Canon Eos r6 mirrorless camera body."
    },
    {
        "couponCode": "EXEXP12",
        "couponTitle": "12% Off With Code",
        "couponDescription": "Shop using KEH Camera's  discount code and get 12% off your purchase at checkout."
    },
    {
        "couponCode": "LEIGHANDRAY",
        "couponTitle": "KEH Camera Coupon Code: Up to 5% on Your Purchase",
        "couponDescription": "Apply this KEH Camera promotional code to get up to 5% off your order at checkout."
    },
    {
        "couponCode": "SV24",
        "couponTitle": "Take 15% Discount on All Order",
        "couponDescription": "Use this code at KEH Camera to receive 15% off a selection of camera gear."
    },
    {
        "couponCode": "HUGH",
        "couponTitle": "KEH Camera Promo Code: Get 5% Off Your Order",
        "couponDescription": "Redeem this promo code at checkout and save 5% on your order."
    },
    {
        "couponCode": "JESS24",
        "couponTitle": "Get 5% Off Your Order",
        "couponDescription": "Take 5% off used cameras by adding this KEH code."
    },
    {
        "couponCode": "W1-5LB5OTLQ",
        "couponTitle": "Take 5% Off Your Order",
        "couponDescription": "Save up to 5% on digital cameras with this Keh Camera code."
    },
    {
        "couponCode": "PAULIEB12",
        "couponTitle": "Receive 5% Off Your Purchase",
        "couponDescription": "Apply this KEH Camera promotional code at checkout to get 5% off your eligible order."
    },
    {
        "couponCode": "SM-R1DC42GO",
        "couponTitle": "KEH Camera Coupon Code: Take Up to 10% Off Any Purchase ",
        "couponDescription": "Enjoy up to a 10% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "DL20",
        "couponTitle": "Save 20% Off Using Code",
        "couponDescription": "Get 20% off on overstock cameras, lenses, and all accessories at keh.com."
    },
    {
        "couponCode": "SL24",
        "couponTitle": "Save 20% Off Using Code",
        "couponDescription": "Save up to 20% off on all your purchase at keh.com."
    }
]