[
    {
        "couponCode": "BONUS",
        "couponTitle": "Enjoy 25% Off on Your Online Order",
        "couponDescription": "Redeem this promo code at checkout and save 25% on any order. Save money on basic fashion, accessories, and more."
    },
    {
        "couponCode": "TEN",
        "couponTitle": "Old Navy Promo Code: 10% Off Your Order",
        "couponDescription": "When this discount code is applied during checkout, you can get 10% off gift cards."
    },
    {
        "couponCode": "GREAT",
        "couponTitle": "Old Navy Promo Code: Get Up to 15% Off Any Order ",
        "couponDescription": "Redeem this promo code at checkout and save up to 15% on any order."
    },
    {
        "couponCode": "GAPGOODNOW",
        "couponTitle": "20% Off Your Purchase + Free Shipping",
        "couponDescription": "Shop at Old Navy for the latest affordable fashion and receive 20% off and free shipping when you use your new Gap Good Rewards Card."
    },
    {
        "couponCode": "LUXE",
        "couponTitle": "Old Navy Coupon: 15% Off Your Order",
        "couponDescription": "Get 15% off your purchase of sweaters, jackets, scarves, and more with this Old Navy code."
    },
    {
        "couponCode": "TREAT",
        "couponTitle": "Save Up to 20% Off Your Order of $125+",
        "couponDescription": "Paste this Old Navy promo code at checkout and save 20% on orders of $125 or more."
    },
    {
        "couponCode": "FIFTY",
        "couponTitle": "Enjoy 50% Off on All Items with Old Navy Coupon",
        "couponDescription": "Unlock a fabulous 50% off on your entire shopping spree at oldnavy.com with the sparkling discount code when you pay with your Gap Inc. Credit Card. Don't miss this chance to revamp your wardrobe with trendy clothing and accessories from Old Navy."
    },
    {
        "couponCode": "ATHLETANEW",
        "couponTitle": "Get 20% Off Your Order",
        "couponDescription": "Take 20% off when you spend $150 and more at Old Navy."
    },
    {
        "couponCode": "YOURS",
        "couponTitle": "Save 20% Off w/ Discount Code",
        "couponDescription": "20% Off All Women's Bras, Bralettes & Underwear"
    },
    {
        "couponCode": "VIP",
        "couponTitle": "Extra 20% Off Your First Order",
        "couponDescription": "Get an additional 20% off your first purchase when you open & use an Old Navy Card."
    },
    {
        "couponCode": "FAMILY",
        "couponTitle": "Old Navy Discount Code: 40% Off with Coupon Code",
        "couponDescription": "Get a 40% discount on your order of accessories, tops, pants, and more. Enter this Old Navy coupon code at checkout."
    },
    {
        "couponCode": "THANKS",
        "couponTitle": "Old Navy Coupon: 40% Off Your Order with Gap Credit Card",
        "couponDescription": "Hey savvy shopper. Get ready for a fantastic deal at oldnavy.com. As a valued Gap Inc. Credit Card holder, you're privy to an exclusive 40% discount on your entire order. So why wait? Dive into the plethora of fashion options we have and enjoy this special perk just for you."
    },
    {
        "couponCode": "ID-1050197",
        "couponTitle": "Old Navy Coupon: 35% Off Your Order",
        "couponDescription": "Big savings at Old Navy by getting 35% on your purchase."
    },
    {
        "couponCode": "EXTRA",
        "couponTitle": "Take 40% Off Your Order at Old Navy ",
        "couponDescription": "Use this Old Navy coupon code and score up to an extra 40% off clearance items at Old Navy. Save on dresses, shorts, hats, and all your summer essentials."
    },
    {
        "couponCode": "PQV2C46PPC1W",
        "couponTitle": "Take 15% Off Any Order with Old Navy Coupon",
        "couponDescription": "Redeem this Old Navy coupon code at checkout on your next order and get 15% off the latest fashions."
    },
    {
        "couponCode": "SAVE",
        "couponTitle": "Take $15 Off Your Orders of $75 or More",
        "couponDescription": "Take $15 off your purchase of $75 or more when you use this Old Navy coupon code at checkout. Save money on high quality basics for your wardrobe."
    },
    {
        "couponCode": "SHORT",
        "couponTitle": "Old Navy Coupon Code: 50% Off Any Purchase",
        "couponDescription": "Receive 50% off on tops, dresses, and more on your order with the code. Redeem at checkout."
    },
    {
        "couponCode": "CARD",
        "couponTitle": "Up To 10% Off Your Purchase At Old Navy",
        "couponDescription": "Apply this Old Navy coupon code at checkout to get up to 10% off your orders."
    },
    {
        "couponCode": "ADDON",
        "couponTitle": "Extra 10% Off Or 20% Off $100+ Reg. Price Styles At Gap",
        "couponDescription": "Use this discount code to get extra 10% off or extra 20% off $100+ regular price styles at Gap."
    },
    {
        "couponCode": "FREESHIP",
        "couponTitle": "Free Shipping",
        "couponDescription": "Free shipping with code"
    }
]