[
    {
        "couponCode": "WELCOME20",
        "couponTitle": "Kaplan Promo Code: 20% Off SAT Test Prep",
        "couponDescription": "Save 20% on SAT Test prep by using this Kaplan promo code at checkout."
    },
    {
        "couponCode": "MCAT500",
        "couponTitle": "Score $500 Off MCAT Prep",
        "couponDescription": "Sign up for MCAT live online and get $500 off when you use our code at checkout"
    },
    {
        "couponCode": "MCAT400",
        "couponTitle": "$400 Off On Demand Course at Kaplan",
        "couponDescription": "Study for the MCAT exam and save $400 on 12 months resource access at Kaplan."
    },
    {
        "couponCode": "ALL25",
        "couponTitle": "Kaplan Test Prep Promo Code: 25% Off Your Order",
        "couponDescription": "All shoppers can receive a 25% discount on their select purchase by simply applying this coupon at checkout."
    },
    {
        "couponCode": "REG600",
        "couponTitle": "Get $600 Off Any Items ",
        "couponDescription": "Paste this promo code at checkout and save $600 on any items."
    },
    {
        "couponCode": "SALE15",
        "couponTitle": "Get 15% Off LSAT Products",
        "couponDescription": "When using this Kaplan Test prep coupon code you can save 15% off all LSAT products. Apply at checkout to redeem."
    },
    {
        "couponCode": "USMLESAVE10",
        "couponTitle": "Save 10% on USMLE Prep",
        "couponDescription": "Get help studying up for your medical exams by utilizing this code to redeem a 10% discount on USMLE prep."
    },
    {
        "couponCode": "50BAP",
        "couponTitle": "Kaplan Test Prep Coupon Code: Take 50% Off REE Course",
        "couponDescription": "Enjoy a 50% discount on REE course when you enter this coupon code at checkout."
    },
    {
        "couponCode": "20FALL",
        "couponTitle": "Take 20% Off Your Order",
        "couponDescription": "Save at Kaplan Test by getting 20% usmle products."
    },
    {
        "couponCode": "SUCCEED",
        "couponTitle": "Take $50 Off Your Order",
        "couponDescription": "Save at Kaplan Test by getting $50 on real state."
    },
    {
        "couponCode": "MCAT300",
        "couponTitle": "Save $300 on Any Course ",
        "couponDescription": "Apply this discount code at checkout and get a $300 discount on any course."
    },
    {
        "couponCode": "SPR20",
        "couponTitle": "Kaplan Test Prep Coupon: 20% Off Your Order",
        "couponDescription": "Take 20% off ACT products. Use this promo code in your cart at checkout for discount."
    },
    {
        "couponCode": "PREP12MCAT",
        "couponTitle": "Kaplan Test Coupon: 12% Off Your Order",
        "couponDescription": "Take 12% off when you use this Kaplan Test code."
    },
    {
        "couponCode": "LIVE15",
        "couponTitle": "Kaplan Test Prep Coupon: 15% Off Your Online Courses ",
        "couponDescription": "Snag a fantastic deal with a flat 15% off on all Live Online Courses at kaptest.com. This is the perfect time to invest in your education and save big with Kaplan Test Prep's discount extravaganza."
    },
    {
        "couponCode": "ACTION20",
        "couponTitle": "Enjoy 20% Off Your Purchase",
        "couponDescription": "Use this offer to receive 20% off GMAT products in March from Kaplan Test Prep."
    },
    {
        "couponCode": "LAST2024",
        "couponTitle": "Kaplan Test Coupon:  25% Off Your Order",
        "couponDescription": "Save 25% on the USMLE course by adding this Kaplan Test code."
    },
    {
        "couponCode": "GIFT25",
        "couponTitle": "25% Off - Save now on SAT and ACT products",
        "couponDescription": "December Promo: 25% Off SAT and ACT Products. Achieve a higher score with help from our SAT and ACT tutoring experts."
    },
    {
        "couponCode": "EXAM",
        "couponTitle": "Kaplan Test Prep Coupon: $150 Off Your Courses",
        "couponDescription": "Get ready to conquer your exams with Kaplan Test Prep. Use the promo code and enjoy a whopping $150 off on any purchase sitewide at kaptest.com. Whether you're preparing for medical school or law school entrance exams, this Kaplan Test Prep discount code has got you covered."
    },
    {
        "couponCode": "JULY15",
        "couponTitle": "Kaplan Test Prep Coupon: 15% Off Your ACT Online Preparation Course",
        "couponDescription": "Experience an incredible deal at Kaplan Test Prep. Use this coupon code and score a 15% discount on ACT Online Preparation Courses. This valuable offer ensures you get high-quality, comprehensive preparation for the ACT exam at a reduced price."
    },
    {
        "couponCode": "WINTERWIN200",
        "couponTitle": "Kaplan Coupon: $200 Off Your Order",
        "couponDescription": "Take $200 off select LSAT products by adding this Kaplan code."
    }
]