[
    {
        "couponCode": "HELLO10",
        "couponTitle": "Get 10% Off",
        "couponDescription": "Redeem this Bogs Footwear coupon code at checkout to take 10% off your total."
    },
    {
        "couponCode": "freeship",
        "couponTitle": "Enjoy Complimentary Delivery On $100+ Purchases",
        "couponDescription": "Receive Free Shipping When You Spend $100 or More"
    },
    {
        "couponCode": "2DAYFREE",
        "couponTitle": "Bogs Footwear Discount Code: Get Free 2-Day Shipping on Your Purchase ",
        "couponDescription": "Enter this Bogs Footwear discount on your order and get free 2-day shipping on your purchase."
    },
    {
        "couponCode": "SHIPFREE",
        "couponTitle": "Bogs Footwear Coupon Code: Get Free Ground Shipping on Your Order ",
        "couponDescription": "Apply this Bogs Footwear coupon code and enjoy free ground shipping on your order."
    },
    {
        "couponCode": "TCR",
        "couponTitle": "Take 10% Off Your Order",
        "couponDescription": "Save at Bogs Footwear by getting 10% on your purchase."
    },
    {
        "couponCode": "COS10",
        "couponTitle": "Bogs Footwear Coupon: 10% Off Your Order",
        "couponDescription": "Get 10% off your purchase with this Bogs Footwear code."
    },
    {
        "couponCode": "SAVE25",
        "couponTitle": "Get 25% Off Your Order",
        "couponDescription": "Enjoy 25% off sitewide by adding this Bogs Footwear code."
    },
    {
        "couponCode": "FREE",
        "couponTitle": "Bogs Footwear Promo Code: Free Shipping on Your Purchase",
        "couponDescription": "Order using Bogs Footwear's coupon code and receive free 2-day shipping on any purchase at checkout."
    },
    {
        "couponCode": "BOGS123",
        "couponTitle": "Enjoy Up to 10% Off",
        "couponDescription": "Shop for boots, shoes, work shoes, and more with this Bogs Footwear coupon code and get up to 10% off."
    },
    {
        "couponCode": "FREESHIP2",
        "couponTitle": "Free Shipping on Orders $120+",
        "couponDescription": "Use this promo code from Bogs Footwear to receive free shipping when you spend $120 or more on your shopping cart."
    },
    {
        "couponCode": "ABGS3",
        "couponTitle": "Bogs Footwear Coupon Code: 10% Off All Orders",
        "couponDescription": "Apply the promo code to receive 10% off your complete next order across the board."
    },
    {
        "couponCode": "SNOW20",
        "couponTitle": "Save 65% Off",
        "couponDescription": "Get Up to 65% Discount When You Use Promo Code"
    },
    {
        "couponCode": "SUNNY60",
        "couponTitle": "Save 60% Off with Code",
        "couponDescription": "Score 60% off with discount code"
    },
    {
        "couponCode": "ENJOY10",
        "couponTitle": "Score 10% Off",
        "couponDescription": "Shop for kids boots using this Bogs Footwear discount code to get 10% off."
    },
    {
        "couponCode": "CLOSEOUT",
        "couponTitle": "BOGS Footwear Promo Code: Extra 25% Off Sale + Free Shipping",
        "couponDescription": "Enjoy an extra 25% off sale items from BOGS Footwear with this promo code. Get stylish and durable boots at unbeatable prices. Plus, free shipping on your entire order for added savings."
    },
    {
        "couponCode": "LABORDAY",
        "couponTitle": "Bogs Footwear Promo Code: Get 20% Off Your Order",
        "couponDescription": "Apply this  promo code at checkout to get up to 60% off your orders of All Sale Items."
    },
    {
        "couponCode": "LDSHIP",
        "couponTitle": "Bogs Footwear Coupon: Free Shipping on Your Order",
        "couponDescription": "Enjoy free shipping on your Bogs Footwear order when you use this promo code at checkout."
    },
    {
        "couponCode": "FLASH",
        "couponTitle": "Take Extra 25% Off Any Items ",
        "couponDescription": "Enjoy shopping and get an extra 25% discount on any items when you enter this coupon code at checkout."
    },
    {
        "couponCode": "GIFT",
        "couponTitle": "Bogs Footwear Coupon: Free 2-Day Shipping Sitewide",
        "couponDescription": "Step into a world of savings with Bogs Footwear. We're excited to offer you an amazing deal that's too good to ignore. Grab this promo code today and enjoy free 2-day shipping on their distinctive collection of durable, comfortable, and stylish footwear. Whether it's sturdy work boots or chic rain boots, we've got your feet covered for every adventure."
    },
    {
        "couponCode": "BOGSWINTER",
        "couponTitle": "Save With Free Shipping",
        "couponDescription": "Enter this Bogs Footwear discount code at checkout to get free two-day shipping on your next order."
    }
]