[
    {
        "couponCode": "viddal",
        "couponTitle": "Take 35% Off Your Myprotein Order With Code",
        "couponDescription": "Get a discount of 35% off your Myprotein order when you enter this code at checkout. See site for more details."
    },
    {
        "couponCode": "APPY",
        "couponTitle": "Myprotein Coupon: Extra 10% Off In-App Order",
        "couponDescription": "Enjoy an additional 10% off at Myprotein when you use this promo code on your order."
    },
    {
        "couponCode": "boxing",
        "couponTitle": "Save 80% Off Using Code",
        "couponDescription": "Apply this promo code at checkout and receive up to an 80% discount on your order."
    },
    {
        "couponCode": "NEW45",
        "couponTitle": "45% Off Any Purchase Sitewide",
        "couponDescription": "Enter this Myprotein coupon code at checkout to enjoy 45% off all your orders."
    },
    {
        "couponCode": "JOEX",
        "couponTitle": "Get $15 Off Sitewide with Promo Code",
        "couponDescription": "Paste this code at checkout and enjoy a $15 discount on your order."
    },
    {
        "couponCode": "TIBO",
        "couponTitle": "Myprotein Coupon: Up to 25% Off Your Order",
        "couponDescription": "Score up to 25% off your select purchase using this promotional code during checkout."
    },
    {
        "couponCode": "HORSE",
        "couponTitle": "45% Off Your Order",
        "couponDescription": "Shop and receive 45% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "QUICK",
        "couponTitle": "Save 20% Off w/ Coupon Code",
        "couponDescription": "Apply this Myprotein discount code at checkout to save an extra 20% off your orders of protein powders."
    },
    {
        "couponCode": "BRITTMYP",
        "couponTitle": "Myprotein Discount Code: 35% Off Your Order",
        "couponDescription": "Score 35% off your select purchase using this coupon code during checkout."
    },
    {
        "couponCode": "LHMYP",
        "couponTitle": "Take 37% Off Your Order",
        "couponDescription": "Save an extra 37% on your purchase with this My Protein code."
    },
    {
        "couponCode": "HOLIDAY10",
        "couponTitle": "Myprotein Coupon: 10% Off",
        "couponDescription": "Shop and receive 10% off orders with Myprotein's promo code on your cart."
    },
    {
        "couponCode": "MAXLIFTS",
        "couponTitle": "Myprotein Coupon Code: Up to 10% Off Your Purchase",
        "couponDescription": "Utilize this code during checkout and enjoy up to 10% off your purchase at Myprotein."
    },
    {
        "couponCode": "MILOUFOODIE",
        "couponTitle": "Myprotein Promo Code: 10% Off Your Order",
        "couponDescription": "Shop and receive 10% off your purchase using a coupon code on your cart."
    },
    {
        "couponCode": "MIKE",
        "couponTitle": "Myprotein Coupon Code: Up to 20% Off Your Purchase",
        "couponDescription": "Apply this promotional code at checkout to get up to 20% off your select order."
    },
    {
        "couponCode": "Kale",
        "couponTitle": "Myprotein Promo Code: Up to 50% Off Your Purchase",
        "couponDescription": "Order using Myprotein's coupon code and receive up to 50% off your purchase at checkout."
    },
    {
        "couponCode": "NUTTY",
        "couponTitle": "Myprotein Coupon Code: Up to 20% Off Your Order",
        "couponDescription": "Enjoy 20% off on your orders at myprotein.com. Use this code at checkout to redeem discount."
    },
    {
        "couponCode": "WILLSCOTT",
        "couponTitle": "Myprotein Coupon: Extra 10% Off Your Order",
        "couponDescription": "Unlock an additional 10% off your favorite vitamins, protein powders, supplements, and more at Myprotein.com. Grab this coupon code and apply it at checkout to score this deal."
    }
]