[
    {
        "couponCode": "KOHLERFAM",
        "couponTitle": "Save 35% Off",
        "couponDescription": "Save up to 35% off with promo code"
    },
    {
        "couponCode": "REFRESH",
        "couponTitle": "Spend $99+ and Save 25% on Your Entire Kohler Cart",
        "couponDescription": "Refresh your bathroom and kitchen furniture without breaking the bank  spend $99 or more to save 25% on your entire purchase."
    },
    {
        "couponCode": "MERRY",
        "couponTitle": "Take 20% Off Kohler Kitchen Fixtures, Sinks and More",
        "couponDescription": "Apply this Kohler coupon code during checkout to unlock this 20% off home improvement discount."
    },
    {
        "couponCode": "GET25",
        "couponTitle": "Get 15% Off Bathroom Lighting, Toilets, Showers at Kohler",
        "couponDescription": "Take advantage of this Kohler promo code and save 15% on select bathroom products and collections."
    },
    {
        "couponCode": "MOXIEGIFT",
        "couponTitle": "Use this Kohler promo code to get a free Moxie showerhead and wireless speaker with any smart toilet order.",
        "couponDescription": null
    },
    {
        "couponCode": "THANKS",
        "couponTitle": "Save up to 25% on Toilets, Showers, Sinks and More",
        "couponDescription": "Shop and save up to 25% on bathroom, lighting, and kitchen fixtures at Kohler. This sitewide offer applies to all categories, but certain collections may be excluded from the sale."
    },
    {
        "couponCode": "mystyle",
        "couponTitle": "Get 10% Discount Using Coupon Code",
        "couponDescription": "Score up to 10% off with coupon"
    },
    {
        "couponCode": "FALL",
        "couponTitle": "Save 25% Sitewide When You Spend $99+ at Kohler",
        "couponDescription": "Add $99 or more worth of products to your cart to qualify for this spend-and-save offer. Apply this Kohler promo code at checkout to activate your 25% off discount."
    },
    {
        "couponCode": "BATHROOM20",
        "couponTitle": "Get 5% Discount Using Coupon",
        "couponDescription": "Save up to 5% off with coupon"
    },
    {
        "couponCode": "THELOOK",
        "couponTitle": "5% Off $2,500+ or 10% Off $5,000",
        "couponDescription": "Get ready for incredible discounts at kohler.com during the Love Your Look Event. Enjoy 5% off on orders of $2,500+ or an amazing 10% off on orders of $5,000+. Don't miss this fantastic opportunity to save big and elevate your space with the stylish and high-quality products. Shop now and make the most of these extra savings."
    },
    {
        "couponCode": "LOVEYOURLOOK",
        "couponTitle": "Get 10% Discount Using Promo Code",
        "couponDescription": "Save 10% off with code"
    },
    {
        "couponCode": "STYLE25",
        "couponTitle": "Take Up to 5% Off Sitewide at Kohler",
        "couponDescription": "Apply this Kohler promo code at checkout to save up to 5% on bathroom, kitchen, and lighting essentials."
    },
    {
        "couponCode": "25FORYOU",
        "couponTitle": "Extra 25% Off Your Purchase",
        "couponDescription": "Take an extra 25% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "SIXDAYS",
        "couponTitle": "Kohler Coupon: Up to 10% Off Your Order of $750+",
        "couponDescription": "Snag sensational savings with this coupon code at kohler.com. Enjoy a cool 5% off on orders of $750, or go big and get an amazing 10% off on orders of $1500 or more. Dive into these deal-tastic discounts today."
    },
    {
        "couponCode": "SAVE20",
        "couponTitle": "Get 20% Off Your Order",
        "couponDescription": "Take 20% off when you use this Kohler code."
    },
    {
        "couponCode": "welcome10",
        "couponTitle": "Save 10% on Your Next Home Improvement Project",
        "couponDescription": "Updating daily use fixtures isn't cheap, but you can get 10% off your entire Kohler order when you apply this coupon code during checkout."
    },
    {
        "couponCode": "AUTUMN",
        "couponTitle": "Enjoy 15% Discount Using Code",
        "couponDescription": "Take up to 15% off with code"
    },
    {
        "couponCode": "KITCHEN20",
        "couponTitle": "Enjoy 20% Discount On Selected Items",
        "couponDescription": "Get Up to 20% Off on Select Products"
    },
    {
        "couponCode": "SUMMER",
        "couponTitle": "Enjoy 25% Savings On $149+ Purchases",
        "couponDescription": "Take Up to 25% Off When You Spend $149 or More"
    },
    {
        "couponCode": "WELCOME25",
        "couponTitle": "Take up to 15% Off Kohler Kitchen and Bathroom Collections",
        "couponDescription": "Select Kohler collections are eligible for an additional 15% discount  redeem this code during checkout to activate this offer."
    }
]