[
    {
        "couponCode": "NWVSNF83",
        "couponTitle": "Take 15% Off Your Order",
        "couponDescription": "Get 15% off when you add this Nest New York discount code."
    },
    {
        "couponCode": "310JUN4",
        "couponTitle": "Nest New York Coupon: 10% Off Your Order",
        "couponDescription": "Save 10% on ink and toner at Nest New York."
    },
    {
        "couponCode": "GVXD6TJB",
        "couponTitle": "Save Up to 15% on Any Items ",
        "couponDescription": "Shop at NEST New York and get up to a 15% discount on any items. Apply this discount code at checkout."
    },
    {
        "couponCode": "HOLIDAY",
        "couponTitle": "NEST New York Promo Code: Get 20% Off Your Order ",
        "couponDescription": "Redeem this promo code at checkout and save 20% on your order."
    },
    {
        "couponCode": "FESTIVE",
        "couponTitle": "Free Shipping Using Code",
        "couponDescription": "Free shipping with coupon"
    },
    {
        "couponCode": "CART156HFG6Z",
        "couponTitle": "NEST New York Discount Code: 5% Off Your Purchase",
        "couponDescription": "Score an extra 5% off your order by using this coupon code at checkout."
    },
    {
        "couponCode": "BETTYLULSEGED15",
        "couponTitle": "Take 15% Off Your Order",
        "couponDescription": "Get 15% off candles, diffusers and more at Nest New York."
    },
    {
        "couponCode": "TARMCC15",
        "couponTitle": "NEST New York Coupon Code: Take Extra 15% Off Your Purchase ",
        "couponDescription": "Enjoy an extra 15% discount on your purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "MONEYGOBYEBYE15",
        "couponTitle": "NEST New York Offer: 15% Off Your Order",
        "couponDescription": "Use this NEST New York promo code in your shopping cart and enjoy 15% off when you shop worth £100+ at checkout."
    },
    {
        "couponCode": "fall25",
        "couponTitle": "Get 25% Discount Using Promotional Code",
        "couponDescription": "Save up to 25% off with promo code"
    },
    {
        "couponCode": "WEL15RQVYBP",
        "couponTitle": "Take Up to 15% Off",
        "couponDescription": "Enjoy up to 15% off your entire order when you redeem this NEST New York coupon code at checkout."
    },
    {
        "couponCode": "DIARYOFTIFFY15",
        "couponTitle": "15% Off Your Purchase",
        "couponDescription": "Shop and take 15% off your purchase of select items using a promo code on your cart."
    },
    {
        "couponCode": "L4TXCCQX",
        "couponTitle": "Up to 10% Off Your Purchase with Coupon",
        "couponDescription": "Don't forget to apply this NEST New York promotional code at checkout to receive up to 10% off your select order."
    },
    {
        "couponCode": "MONDAY25",
        "couponTitle": "Save Extra 25% on Your Purchase ",
        "couponDescription": "Shop at NEST New York get an extra 25% discount on your purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "FESTIVE25",
        "couponTitle": "NEST New York Promo Code: Get Up to 25% Off Orders $100+",
        "couponDescription": "Redeem this promo code at checkout and save up to 25% on orders over $100."
    },
    {
        "couponCode": "MISTS",
        "couponTitle": "Get Free Shipping on Newest Product ",
        "couponDescription": "Paste this promo code at checkout and get free shipping on newest product."
    },
    {
        "couponCode": "FALLSHIP",
        "couponTitle": "Get Free Shipping on Any Home Fragrance, Pistachio, and Wild Fig",
        "couponDescription": "Shop at NEST New York and get free shipping on any home fragrance, pistachio, and wild fig. Apply this discount code at checkout."
    },
    {
        "couponCode": "BOURBON",
        "couponTitle": "Get Free Shipping on Eau de Parfum Bourbon",
        "couponDescription": "Shop at NEST New York and get free shipping on you purchase eau de parfum Bourbon. Apply this discount code at checkout."
    },
    {
        "couponCode": "Ritchie15",
        "couponTitle": "15% Off with Coupon Code",
        "couponDescription": "Apply this NEST New York discount code during checkout to get a 15% discount on your purchase."
    },
    {
        "couponCode": "t4c7ltp5",
        "couponTitle": "Take 5% Off Any Purchase",
        "couponDescription": "Receive 5% off everything in the store at Nest New York."
    }
]