[
    {
        "couponCode": "NEWYEAR50",
        "couponTitle": "Save 50% Off",
        "couponDescription": "New Year's New Customer Offer: Get 50% off on Orders"
    },
    {
        "couponCode": "FRESH2024",
        "couponTitle": "Save 20% Off with Code",
        "couponDescription": "New customers score 20% off your first order when you use this code at checkout."
    },
    {
        "couponCode": "HOLIDAYS",
        "couponTitle": "Little Spoon Coupon: 50% Off Your First Order + Enjoy a Free Gift",
        "couponDescription": "Use this promo code and enjoy 50% off your first order at littlespoon.com. Plus, score a free gift with your purchase."
    },
    {
        "couponCode": "50FALL",
        "couponTitle": "50% Off Your Order",
        "couponDescription": "Take 30% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "DRIZZLE30",
        "couponTitle": "30% Off Your Order",
        "couponDescription": "Take 30% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "SUNNYSIDE",
        "couponTitle": "Little Spoon Coupon: 50% Off Your 1st Purchase",
        "couponDescription": "Whoop it up with littlespoon.com's June Blowout Sale. Use their coupon code to snap up a fantastic 50% off on your first purchase. Don't miss out on the chance to snag high-quality items for half the price at littlespoon.com - your ultimate hub for mind-blowing discounts."
    },
    {
        "couponCode": "SPOON25",
        "couponTitle": "Little Spoon, Inc Coupon: 25% Off Your 1st Order",
        "couponDescription": "Enjoy a fabulous deal at littlespoon.com with this 25% off coupon. Explore the best of healthy, organic baby food and save while doing so. It's a win-win for both mom and baby."
    },
    {
        "couponCode": "MORE4MOM",
        "couponTitle": "Get $85 Off Your Order",
        "couponDescription": "Take up to $85 off your purchase with this Little Spoon code."
    },
    {
        "couponCode": "APRIL35",
        "couponTitle": "Little Spoon Coupon: $35 Off Your Order",
        "couponDescription": "Take $35 off your first purchase only for new customers at Little Spoon."
    },
    {
        "couponCode": "NYE50",
        "couponTitle": "Save 50% Off w/ Coupon Code",
        "couponDescription": "Receive 50% off on Your First order"
    },
    {
        "couponCode": "BESTDEAL60",
        "couponTitle": "Little Spoon Coupon: 60% Off Your 1st Order",
        "couponDescription": "Score 60% off your first order with this coupon code. Little Spoon's fresh, healthy meals for little ones make mealtime a breeze."
    },
    {
        "couponCode": "OCT50",
        "couponTitle": "Little Spoon Coupon: 50% Off Your 1st Order ",
        "couponDescription": "Save big with their discount code and enjoy 50% off your first order at littlespoon.com. Dont miss out on this limited-time offer."
    },
    {
        "couponCode": "BYESUMMER",
        "couponTitle": "Little Spoon, Inc Coupon: 50% Off Your Order",
        "couponDescription": "Get 50% off at littlespoon.com when you use this code at checkout. Here's your chance to stock up on high-quality baby food for your little one."
    },
    {
        "couponCode": "BIGTOTE",
        "couponTitle": "Little Spoon Coupon: 20% Off Your Order + Free Tote",
        "couponDescription": "Use this coupon code and enjoy 20% off your order at littlespoon.com, your destination for fresh, organic baby blends and nutritious plates for toddlers. You can also bag a free tote with your purchase."
    },
    {
        "couponCode": "SUMMER50",
        "couponTitle": "Little Spoon, Inc Coupon: 50% Off Your 1st Order ",
        "couponDescription": "Get ready to celebrate this Fourth of July with Little Spoon by snagging a fantastic deal. Enjoy a whopping 50% off on your first order, up to a maximum discount of $35. Just use this coupon code at checkout."
    },
    {
        "couponCode": "MDW25",
        "couponTitle": "Little Spoon Coupon: 25% Off Your 1st Purchase, Plus Free Shipping",
        "couponDescription": "Kickstart your shopping spree at littlespoon.com with their Memorial Day Sale. Use this coupon code to enjoy a whopping 25% off on your first order, plus get free shipping."
    },
    {
        "couponCode": "SPRINGTIME50",
        "couponTitle": "Little Spoon Coupon: 50% Off Your Order",
        "couponDescription": "Get ready for a delightful saving spree with Little Spoon, Inc. Use this promo code and enjoy 50% off on nutrient-packed, delicious meals. Hurry, the spoons are waiting."
    },
    {
        "couponCode": "FREELUNCH",
        "couponTitle": "Little Spoon Coupon: Get Free Lunchers",
        "couponDescription": "Hip Hip Hooray. Little Spoon, Inc. is making meal times more exciting with an amazing offer. Grab the promo code now and enjoy free lunchers. Whether it's for your little one or the whole family, Little Spoon is here to make healthy eating delicious, fun and affordable."
    },
    {
        "couponCode": "LOVEBUG50",
        "couponTitle": "Little Spoon, Inc Coupon: 50% Off Your 1st Order",
        "couponDescription": "Get ready to feel the love this Valentine's Day 2024 with Little Spoon. We're rolling out an irresistible offer just for you. Enjoy a whopping 50% discount on your first order with us. It's time to treat yourself or your loved ones to delicious, healthy meals without breaking the bank."
    },
    {
        "couponCode": "CF30",
        "couponTitle": "*CouponFollow Exclusive* Get 30% Off Sitewide with Code",
        "couponDescription": "Score 30% off your first order with our exclusive code. Expires 2/27 at 11:59 pm ET"
    }
]