[
    {
        "couponCode": "STYLE",
        "couponTitle": "Target Coupon Code: Save 25% on Your Order",
        "couponDescription": "Use this Target coupon code at checkout to save up to 25% on your must-have essentials."
    },
    {
        "couponCode": "SAVE20",
        "couponTitle": "Target Discount Code: Get 20% Off Your Order",
        "couponDescription": "Get 20% off your next Target purchase by applying this promo code to your cart at checkout."
    },
    {
        "couponCode": "10OFF",
        "couponTitle": "Target Discount Code: Save 10% on Any Purchase ",
        "couponDescription": "Shop at Target and get a 10% discount on any purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "BALANCE2OFF",
        "couponTitle": "Extra $2 Off On Your Target Order",
        "couponDescription": "Use this coupon code for an additional $2 off on everyday essentials, home goods, and trendy fashion at Target."
    },
    {
        "couponCode": "SAVE5",
        "couponTitle": "Target Promo Code: Get 5% Off Your Order",
        "couponDescription": "Apply this Target coupon code at checkout to get 5% off your entire purchase of electronics, home goods, clothing, and more."
    },
    {
        "couponCode": "SAVENOW",
        "couponTitle": "Save Up to 25% with Target Promo Code",
        "couponDescription": "Take up to 25% off on a wide range of products at Target when you apply this promo code to your cart."
    },
    {
        "couponCode": "TOP10",
        "couponTitle": "$10 Off Philips Sonicare with Target Promo",
        "couponDescription": "Save $10 on Philips Sonicare Oral Care products at Target using this promo code."
    },
    {
        "couponCode": "HIGH5",
        "couponTitle": "$5 Off Your Order with Target Coupon",
        "couponDescription": "Apply this Target promo code to receive $5 off your next order of groceries, electronics, clothing and more."
    },
    {
        "couponCode": "MAKEYOURGAINM1",
        "couponTitle": "Target Coupon Code: Save 10% on Your Purchase",
        "couponDescription": "Save 10% on all Gainful products at Target with this coupon code. Improve your fitness and wellness routine with Gainful's tailored nutrition solutions. Don't miss out on this exclusive discount at Target."
    },
    {
        "couponCode": "WOMEN20",
        "couponTitle": "15% Off Sitewide with Target Discount Code",
        "couponDescription": "Shop at Target for household essentials, furniture, clothing and more and use this coupon to take 15% off at checkout."
    },
    {
        "couponCode": "BIG10",
        "couponTitle": "Target Coupon Code: $10 Off Sonicare",
        "couponDescription": "Use this Target discount code to receive $10 off on select Sonicare Oral Care purchase."
    },
    {
        "couponCode": "OUTDOOR10",
        "couponTitle": "Get 10% Off with Target Coupon",
        "couponDescription": "Use this Target coupon code at checkout to receive 10% off on select outdoor items."
    },
    {
        "couponCode": "SCHOOL",
        "couponTitle": "Extra 15% Off Your Target Order ",
        "couponDescription": "Get an additional 15% off on select products for school at Target, when you use this promo code at checkout."
    },
    {
        "couponCode": "JOY5",
        "couponTitle": "Target Discount Code: Save $5 on Your Purchase",
        "couponDescription": "Shop at Target and enjoy $5 discount on any Philips Sonicare toothbrushes. Apply this discount code at checkout."
    },
    {
        "couponCode": "LEGO",
        "couponTitle": "Target Promo Code: Up to 10% Off Your Order",
        "couponDescription": "get up to a 10% discount on select  when you apply this target promo code at checkout."
    },
    {
        "couponCode": "20OFF",
        "couponTitle": "Get 20% Off Your Order",
        "couponDescription": "Take up to 20% off when you add this Target code."
    },
    {
        "couponCode": "WELCOME10",
        "couponTitle": "Target Coupon Code: Take Up to 5% Off Any Purchase ",
        "couponDescription": "Enjoy up to a 5% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "THANKSGIVING",
        "couponTitle": "Get 10% Off Your Order ",
        "couponDescription": "Paste this promo code at checkout and save 10% on your order."
    },
    {
        "couponCode": "NUDO",
        "couponTitle": "Save 45% On Your Order with Target Discount",
        "couponDescription": "Apply this coupon to your cart to take up to 45% off on select summer apparel, pool toys, picnic gear, women's clearance apparel, and more."
    },
    {
        "couponCode": "TCFKGF9LCTFPJ9W3",
        "couponTitle": "Target Promo Code: 10% Off",
        "couponDescription": "Receive 10% off your purchase with this discount code at Target."
    }
]