[
    {
        "couponCode": "US12AFF",
        "couponTitle": "Pretty Little Thing Coupon: 50% Off Everything + Extra 12% Off",
        "couponDescription": "Get 50% off everything at Pretty Little Thing. Apply this coupon code at checkout to save an additional 12%. Excludes beauty products."
    },
    {
        "couponCode": "NEW10",
        "couponTitle": "Save 10% With Verified New Customer Coupon",
        "couponDescription": "For a limited time, new customers can save 10% off their entire order when using this coupon code at checkout."
    },
    {
        "couponCode": "US20NEW",
        "couponTitle": "PLT Promo Code: Get Up to 75% Off Sale+ Extra 20% Off",
        "couponDescription": "Enjoy up to 75% off Sale and get an additional 20% off sitewide for new customers at Pretty Little Thing. Excludes beauty products"
    },
    {
        "couponCode": "NEW20",
        "couponTitle": "Save 20% Off",
        "couponDescription": "Apply an additional 20% off using this coupon code on your purchase at Pretty Little Thing US."
    },
    {
        "couponCode": "BF60",
        "couponTitle": "Pretty Little Thing Promo Code: 60% Off",
        "couponDescription": "Shop using Pretty Little Thing's discount code and get 60% off absolutely everything on your purchase at checkout."
    },
    {
        "couponCode": "EXTRA20",
        "couponTitle": "Take 20% Off Your Purchase ",
        "couponDescription": "Enjoy shopping and get a 20% discount on your purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "GET50",
        "couponTitle": "Pretty Little Thing US Discount Code: 50% Off",
        "couponDescription": "Purchase at Pretty Little Thing US and get 50% off everything using this coupon code on your cart."
    },
    {
        "couponCode": "OFFERSWIM15",
        "couponTitle": "Pretty Little Thing US Offer: 50% Off + Extra 15% Off Swimwear",
        "couponDescription": "Save 15% off your cart when you apply this coupon code on your purchase + an additional 15% off with your swimwear order at checkout."
    },
    {
        "couponCode": "NEWBIE60",
        "couponTitle": "Pretty Little Thing Coupon: 60% Off Your Order",
        "couponDescription": "Take 60% off when you use this Pretty Little Thing code."
    },
    {
        "couponCode": "SALE10",
        "couponTitle": "Save 10% Off Women's Apparel With Promo Code",
        "couponDescription": "Take 10% off women's clothing by adding this Pretty Little Thing code."
    },
    {
        "couponCode": "NEW15",
        "couponTitle": "Save 15% With Verified Sitewide Discount Code",
        "couponDescription": "Score up to 15% off everything at Pretty Little Thing."
    },
    {
        "couponCode": "extra10",
        "couponTitle": "10% Off at Pretty Little Thing",
        "couponDescription": "Get an additional 10% off in your shopping cart when you use this coupon code at checkout."
    },
    {
        "couponCode": "USA25",
        "couponTitle": "Pretty Little Thing US Promo Code: Get 25% Off Your Purchase",
        "couponDescription": "Use this Pretty Little Thing US coupon code to save 25% on your purchase."
    },
    {
        "couponCode": "USA28AFF",
        "couponTitle": "Pretty Little Thing US Promo Code: Get 28% Off Your Order",
        "couponDescription": "Redeem this promo code at checkout and get 28% discount on your order."
    },
    {
        "couponCode": "USA5NEW",
        "couponTitle": "Pretty Little Thing US Coupon: 60% Off Your Order + Extra 5% Off for New Customers",
        "couponDescription": "Get ready to revamp your wardrobe with this promo code. Enjoy a whopping 60% off on all items at prettylittlething.us, and if you're a new customer, we're throwing in an additional 5% off just for you. It's the perfect time to save big at Pretty Little Thing US, where fashion meets affordability like never before. Don't miss this golden opportunity to shop and save."
    },
    {
        "couponCode": "10PLT",
        "couponTitle": "Pretty Little Thing Promo Code: 10% Off Your Order",
        "couponDescription": "Shop and get 10% off your purchase using a discount code on your cart."
    },
    {
        "couponCode": "US8AFF",
        "couponTitle": "Get Extra 9.8% Off Any Order ",
        "couponDescription": "Paste this promo code at checkout and save an extra 9.8% on any order."
    },
    {
        "couponCode": "US65ALL",
        "couponTitle": "Pretty Little Thing Coupon: 65% Off Your Order",
        "couponDescription": "Save big at Pretty Little Thing by getting 65% on everything."
    },
    {
        "couponCode": "USA65NEW",
        "couponTitle": "Take Extra 65% Off Your Purchase ",
        "couponDescription": "Enjoy shopping and get an extra 65% discount on your purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "US18NEW",
        "couponTitle": "Pretty Little Thing Coupon: 50% Off Everything + Extra 18% Off",
        "couponDescription": "Get 50% off everything at Pretty Little Thing, plus new customers can receive an additional 18% off when this promo code is applied at checkout. Excludes beauty products."
    }
]