[
    {
        "couponCode": "SAVE15",
        "couponTitle": "Lumens Coupon: 15% Off Your Order",
        "couponDescription": "Save 15% on steelcase furniture with this Lumens code."
    },
    {
        "couponCode": "WELCOME10",
        "couponTitle": "New Clients: Enjoy 10% Off On $100+ Purchases",
        "couponDescription": "New Customers Take 10% off on any order of $100 or more"
    },
    {
        "couponCode": "EXTRA60",
        "couponTitle": "Save 60% Off w/ Discount Code",
        "couponDescription": "Take 60% off with promo code"
    },
    {
        "couponCode": "VCMODERN",
        "couponTitle": "Get Free Tepa Accent Rechargeable LED Table Lamp Orders Of $400+",
        "couponDescription": "Enjoy free tepa accent rechargeable led table lamp when you spend $400+ on visual comfort moderns at Lumens."
    },
    {
        "couponCode": "KONCEPT",
        "couponTitle": "Extra 20% Off Select Koncept Lighting At Lumens",
        "couponDescription": "Lumens Exclusive: Save an additional 20% on select lighting by Koncept."
    },
    {
        "couponCode": "TOWER",
        "couponTitle": "Lumens Coupon: Get a Free Oscillating Tower Fan with Your Order",
        "couponDescription": "Use the promo code at lumens.com and get an Oscillating Tower Fan absolutely free when you spend $400 or more on Minka Aire Fans. Beat the heat in style with this fantastic offer."
    },
    {
        "couponCode": "ELK",
        "couponTitle": "Save 15% Off + Free Shipping with Code",
        "couponDescription": "Take 15% off and Free Shipping on Elk Lighting"
    },
    {
        "couponCode": "CELEBRATE",
        "couponTitle": "15% Off Your Order with Discount Code",
        "couponDescription": "Save 15% on your eligible purchase when this Lumens promotional code is applied at checkout."
    },
    {
        "couponCode": "EMAIL50",
        "couponTitle": "Enjoy $50 Discount Using Promo Code",
        "couponDescription": "Take $50 off with promo code"
    },
    {
        "couponCode": "FLASH",
        "couponTitle": "Get Extra 12% Off Your Order ",
        "couponDescription": "Paste this promo code at checkout and save an extra 12% on your order."
    },
    {
        "couponCode": "HUNTER",
        "couponTitle": "Lumens Coupon: 20% Off Your Order",
        "couponDescription": "Score a fantastic 20% off on your current purchase at lumens.com with their special coupon code. This irresistible deal applies to three major categories - lighting, furniture, and outdoor living products."
    },
    {
        "couponCode": "CASABLANCA",
        "couponTitle": "Score Up to 20% Off Your Purchase",
        "couponDescription": "Receive up to an extra 20% off Casablanca fans with this Lumens promo code."
    },
    {
        "couponCode": "FLASH5",
        "couponTitle": "Lumens Coupon: Extra 5% Off Your Purchase",
        "couponDescription": "Shop Lumens' Flash Sale and get an additional 5% off on your purchase. Just use this coupon code at lumens.com to enjoy this deal."
    },
    {
        "couponCode": "HOLIDAY15",
        "couponTitle": "Lumens Promo Code: 15% Off You Order",
        "couponDescription": "Get 15% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "TAKE10",
        "couponTitle": "Lumens Discount: Extra 10% Off Lenora Led Mirror",
        "couponDescription": "Purchase 10% off at checkout when you use the discount code in your shopping cart at checkout."
    },
    {
        "couponCode": "KICHLER",
        "couponTitle": "Lumens Promo Code: Get 20% Off All Kichler Products ",
        "couponDescription": "Redeem this promo code at checkout and save 20% on all Kichler products."
    },
    {
        "couponCode": "TAKE5",
        "couponTitle": "Lumens Coupon: 5% Off Your Purchase",
        "couponDescription": "Illuminate your life with a 5% off discount at lumens.com, applicable to an impressive variety of lighting, furniture and home decor. Discover the perfect pieces to elevate your space from their wide range of chic chandeliers, contemporary couches or stylish wall art with this special offer."
    },
    {
        "couponCode": "MITZI",
        "couponTitle": "20% Off Using Code",
        "couponDescription": "Enjoy a 20% discount on your current purchase at lumens.com with the coupon code. Simply tap into this amazing offer to grab your favorite items at a lower price. Don't forget to paste the code during checkout. Seize this irresistible deal now."
    },
    {
        "couponCode": "SAVE10",
        "couponTitle": "Lumens Coupon Code: Enjoy $10 Off Orders $100+",
        "couponDescription": "Get ready to save big with this coupon code at Lumens. Enjoy $10 off orders of $100 or more. Shop now and avail of the discount by using the code at checkout. Don't miss out on this amazing offer."
    },
    {
        "couponCode": "LUMENS",
        "couponTitle": "Receive a Free Design Gift with any Qualifying $400 or more purchase",
        "couponDescription": null
    }
]