[
    {
        "couponCode": "4009062024",
        "couponTitle": "Take 40% Off Any Order",
        "couponDescription": "Enjoy extra 40% off when you add this Michaels Canada code."
    },
    {
        "couponCode": "11040630",
        "couponTitle": "Michaels Canada Code: Take 30% Off Any Purchase ",
        "couponDescription": "Enjoy a 30% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "300126240",
        "couponTitle": "Get 30% Off with April Promo Code",
        "couponDescription": "Score 30% off one full-priced item when you use this Michaels Canada coupon code at checkout."
    },
    {
        "couponCode": "5010",
        "couponTitle": "Save $10 on Orders $50+ ",
        "couponDescription": "Shop at Michaels Canada and get a $10 discount on orders over $50. Apply this discount code at checkout."
    },
    {
        "couponCode": "40240719",
        "couponTitle": "Take 40% Off Your Order",
        "couponDescription": "Enjoy 40% off your entire purchase at Michaels Canada."
    },
    {
        "couponCode": "501081622",
        "couponTitle": "Up to 10% Off Your Purchase w/ Promo Code",
        "couponDescription": "Receive up to a 10% discount on your eligible order by simply applying this Michaels Canada coupon code at checkout."
    },
    {
        "couponCode": "10141724",
        "couponTitle": "30% Off One Regular Price item At Michaels Canada",
        "couponDescription": "Apply this Michaels Canada coupon code at checkout to claim 30% off your orders of One Regular Price item."
    },
    {
        "couponCode": "10070924",
        "couponTitle": "40% Off 2 Regular Price Items At Michaels Canada",
        "couponDescription": "Use this Michaels Canada discount code at checkout to get 40% off your orders of Two Regular Price Items."
    },
    {
        "couponCode": "91292224",
        "couponTitle": "40% Off One Regular Price Item At Michaels Canada",
        "couponDescription": "Enter this Michaels Canada promo code at checkout to enjoy 40% off your orders of One Regular Price Item."
    },
    {
        "couponCode": "93245010",
        "couponTitle": "Take $10 Off Your Purchase",
        "couponDescription": "Enjoy $10 off when you spend $50 and more at Michaels Canada."
    },
    {
        "couponCode": "12121640",
        "couponTitle": "Michaels Canada Discount Code: 40% Off  1 Regular Price Item",
        "couponDescription": "Add this Michaels Canada discount code at checkout to take 40% off your orders of One Regular Price Item."
    },
    {
        "couponCode": "120205402",
        "couponTitle": "Michaels Canada Coupon Code: 40% Off 2 Regular Priced items",
        "couponDescription": "Apply this Michaels Canada discount code at checkout to unlock 40% off your orders of two regular priced items."
    },
    {
        "couponCode": "12060840",
        "couponTitle": "40% Off 1 Regular Price Item At Michaels Canada",
        "couponDescription": "Use this Michaels Canada coupon code at checkout to apply 40% off your orders of One Regular Price Item."
    },
    {
        "couponCode": "112112140",
        "couponTitle": "40% off 1 regular price item At Michaels Canada",
        "couponDescription": "Enter this Michaels Canada coupon code at checkout to apply 40% off your orders of one regular price item."
    },
    {
        "couponCode": "11182030",
        "couponTitle": "30% Off 1 Regular Price Item At Michaels Canada",
        "couponDescription": "Use this Michaels Canada promo code at checkout to claim 30% off your orders of One Regular Price Item."
    },
    {
        "couponCode": "11111230",
        "couponTitle": "30% Off 1 Regular Priced item At Michaels Canada",
        "couponDescription": "Apply this Michaels Canada discount code at checkout to unlock 30% off your orders of 1 Regular Priced item."
    },
    {
        "couponCode": "11071040",
        "couponTitle": "Save 40% Off using Coupon Code",
        "couponDescription": "Shop with this Michaels Canada promo code to claim 40% off your order of one regular priced item."
    },
    {
        "couponCode": "10242740",
        "couponTitle": "Michaels Canada Coupon Code: 40% Off One Regular Price Item",
        "couponDescription": "Shop with this Michaels Canada promo code to unlock 40% off your orders of One Regular Price item."
    },
    {
        "couponCode": "24101013",
        "couponTitle": "Michaels Canada Coupon Code: 40% Off 1 Regular Price item",
        "couponDescription": "Apply this Michaels Canada promo code at checkout to claim 40% off your orders of one regular price item."
    },
    {
        "couponCode": "9302440",
        "couponTitle": "40% off 1 regular price purchase At Michaels Canada",
        "couponDescription": "Apply this Michaels Canada promo code at checkout to get 40% off your orders of one regular price purchase."
    }
]