[
    {
        "couponCode": "HALLO",
        "couponTitle": "Save 20% Off",
        "couponDescription": "Take up to 20% off with discount code"
    },
    {
        "couponCode": "HIFRIEND",
        "couponTitle": "Asos Coupon: 10% Off Your Purchase",
        "couponDescription": "Shop and save 10% with this promo code for almost everything on your cart at Asos."
    },
    {
        "couponCode": "NEWBIE",
        "couponTitle": "15% Off Orders of $50+",
        "couponDescription": "Get a sitewide 15% off when you spend at least $50 at Asos. Use this code at checkout to apply savings."
    },
    {
        "couponCode": "UNWRAP",
        "couponTitle": "Asos Coupon Code: Take Up to 10% Off Any Purchase ",
        "couponDescription": "Enjoy up to a 10% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "MERRY",
        "couponTitle": "Asos Coupon Code: Extra 20% Off Your Order",
        "couponDescription": "Take an extra 20% off your purchase of selected sale styles using a coupon code on your cart."
    },
    {
        "couponCode": "BIRTHDAYBB",
        "couponTitle": "Get Up to 10% Off Sitewide with Promo Code",
        "couponDescription": "Use this coupon code at checkout and get up to a 10% discount on your order."
    },
    {
        "couponCode": "CA15",
        "couponTitle": "Asos Coupon- 15% Off Sitewide",
        "couponDescription": "Get an extra 15% discount on all your orders when you use this promo code at checkout."
    },
    {
        "couponCode": "TEAMASOS",
        "couponTitle": "Get Up to 10% Off with Coupon Code",
        "couponDescription": "Save up to 10% on your order. Apply this discount code at checkout."
    },
    {
        "couponCode": "IMNEW",
        "couponTitle": "Up to 30% Off Your Order",
        "couponDescription": "Pick and enjoy up to 30% discount with a coupon code on your purchase. Redeem at checkout."
    },
    {
        "couponCode": "GIFT4U",
        "couponTitle": "Save 15% Off",
        "couponDescription": "Take up to 15% off with code"
    },
    {
        "couponCode": "GOASOS",
        "couponTitle": "ASOS Discount Code: 30% Off Everything",
        "couponDescription": "Get 30% off everything at ASOS with this exclusive discount code. Shop the latest fashion trends and save big on clothing, shoes, and accessories. Don't miss out on this limited-time offer."
    },
    {
        "couponCode": "BONJOUR",
        "couponTitle": "Asos Promo Code: Up to 15% Off Your Order",
        "couponDescription": "Shop and get up to 15% off using this discount code on your purchase at Asos."
    },
    {
        "couponCode": "STUDENTUK",
        "couponTitle": "Get 15% Off Select Items with Promo Code",
        "couponDescription": "Take a 15% discount on select items. Enter this coupon code at checkout."
    },
    {
        "couponCode": "HEJ",
        "couponTitle": "Asos Coupon: 10% Off Your Order",
        "couponDescription": "Take 10% off on clothing by using this Asos code."
    },
    {
        "couponCode": "STUDENTAU",
        "couponTitle": "Take 20% Off Sitewide with Coupon Code",
        "couponDescription": "Enter this coupon code at checkout and enjoy a 20% discount on your order."
    },
    {
        "couponCode": "CIAO",
        "couponTitle": "Asos Coupon Code: Take 10% Off Any Purchase ",
        "couponDescription": "Enjoy a 10% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "lctb",
        "couponTitle": "Asos Coupon Code: Take 20% Off Any Order",
        "couponDescription": "Enter this promo code at checkout for a 20% discount on your order."
    },
    {
        "couponCode": "HOLA",
        "couponTitle": "Take 10% Off Your Purchase ",
        "couponDescription": "Enjoy shopping and get a 10% discount on your purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "STUDENTIE",
        "couponTitle": "Get 25% Discount with Code",
        "couponDescription": "Add this Asos promo code to receive 25% off the entire site."
    },
    {
        "couponCode": "STUDENTIT",
        "couponTitle": "Save 10% with Code",
        "couponDescription": "Use this promo code from Asos to receive 10% off on your shopping cart."
    }
]