[
    {
        "couponCode": "Matkovich8",
        "couponTitle": "8% Off Your Order",
        "couponDescription": "Redeem this State and Liberty promo code at checkout and enjoy 8% off on your order."
    },
    {
        "couponCode": "BF20",
        "couponTitle": "State and Liberty Coupon: Get 20% Cash Back as S&L e-Gift Card When You Purchase $2,000+",
        "couponDescription": "Enjoy an incredible savings opportunity at State and Liberty. When you spend $2,000 or more on their diverse range of products, youll receive a generous 20% cash back reward. This cash back will be conveniently provided in the form of an S&L e-Gift Card, perfect for treating yourself to even more quality items from their online store."
    },
    {
        "couponCode": "BF18",
        "couponTitle": "State and Liberty Coupon: Get 18% Cash Back as an e-Gift Card When You Order Between $1,000 - $1,999",
        "couponDescription": "Get ready to snag a brilliant 18% cash back in the form of an S&L e-gift card when you spend between $1,000 and $1,999 at stateandliberty.com. It's an irresistible deal for all savvy shoppers. Boost your buying power and enjoy the thrill of scoring fantastic bargains on your favorite items."
    },
    {
        "couponCode": "BLACKFRIDAY",
        "couponTitle": "State and Liberty Coupon: 20% Off Your Order",
        "couponDescription": "Take up to 20% off when you spend $250 and more at State and Liberty."
    },
    {
        "couponCode": "FREESHIRT",
        "couponTitle": "State and Liberty Coupon: Buy 4, Get 1 Free ",
        "couponDescription": "Step up your style game gents. Use the online coupon code at stateandliberty.com and dive into an amazing deal. Stock up on their top-notch men's dress shirts. When you buy four, get one absolutely free. It's time to freshen up your wardrobe."
    },
    {
        "couponCode": "PANT3",
        "couponTitle": "Get 10% Off 3 Stretch Shorts",
        "couponDescription": "Enjoy 10% off when you buy 3 stretch shorts at stateandliberty.com using this coupon code at checkout."
    },
    {
        "couponCode": "STATEANDLIB3",
        "couponTitle": "State and Liberty Coupon: Up to 10% Off Any Purchase",
        "couponDescription": "Redeem this State & Liberty discount code at checkout to enjoy up to 10% off your next order."
    },
    {
        "couponCode": "sl20",
        "couponTitle": "State and Liberty Discount Code: 20% Off Your Order ",
        "couponDescription": "Apply this discount code at checkout and enjoy 20% off your order at State and Liberty."
    },
    {
        "couponCode": "THRIFTSHIRTS3",
        "couponTitle": "Enjoy 10% Discount on All Purchase",
        "couponDescription": "Apply the promo code to receive 10% off your complete next order across the board."
    },
    {
        "couponCode": "BIShirts3",
        "couponTitle": "State and Liberty Special Offer: 10% Off",
        "couponDescription": "Get 10% off your cart when you use the promo code in your shopping cart at checkout."
    },
    {
        "couponCode": "FREESHIP",
        "couponTitle": "Up to 5% Off using State and Liberty Promo Code",
        "couponDescription": "Take advantage of up to a 5% discount with the provided code. Start saving now at State and Liberty."
    },
    {
        "couponCode": "FLOWRESTLING",
        "couponTitle": "Enjoy 10% Off Your Purchase",
        "couponDescription": "When this State and Liberty discount code is applied during checkout, you can get 10% off your order."
    },
    {
        "couponCode": "WESCOTT10",
        "couponTitle": "State & Liberty Promo Code: Extra 10% Off Your Order",
        "couponDescription": "Buy and save an additional 10% with this discount code on your sitewide purchase at State & Liberty."
    },
    {
        "couponCode": "GRETO10",
        "couponTitle": "State and Liberty Coupon: 10% Your Order",
        "couponDescription": "Take 10% off tops, suits and more at State and Liberty."
    },
    {
        "couponCode": "STATEANDLIB5",
        "couponTitle": "State and Liberty Discount Code: Up to 15% Off Your Order",
        "couponDescription": "Enjoy up to 15% off your order with this code at State and Liberty."
    },
    {
        "couponCode": "PANT5",
        "couponTitle": "Get 15% Off 5 Stretch Shorts w/ State and Liberty Coupon Code",
        "couponDescription": "Enjoy 15% discount when you buy 5 stretch shorts at stateandliberty.com using this code at checkout."
    },
    {
        "couponCode": "BF10",
        "couponTitle": "Get 10% Off With State and Liberty Code",
        "couponDescription": "Shop and save 10% at State & Liberty when you redeem this discount code on your cart."
    },
    {
        "couponCode": "SpotrShorts3",
        "couponTitle": "Save 10% Off Your Cart at State and Liberty",
        "couponDescription": "Get 10% off your purchase when you use the State and Liberty on your cart at checkout."
    },
    {
        "couponCode": "SpotrShirts3",
        "couponTitle": "Get 10% Off Your Cart at State and Liberty",
        "couponDescription": "Save 10% off your purchase when you apply the promo code to your cart at State and Liberty."
    },
    {
        "couponCode": "BIPANTS3",
        "couponTitle": "Enjoy10% Off Your Pants Order",
        "couponDescription": "Shop and get 10% off your purchase at checkout with a State and Liberty promo code in your shopping cart."
    }
]