[
    {
        "couponCode": "CHGG10",
        "couponTitle": "Chegg Promo Code: 10% Off Your Purchase",
        "couponDescription": "Enjoy 10% off 1st-month subscription for Chegg Study or Chegg Study Pack with this promo code."
    },
    {
        "couponCode": "Pocket10",
        "couponTitle": "Take 10% Off Your Purchase ",
        "couponDescription": "Enjoy shopping and get a 10% discount on your purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "3B22BCB",
        "couponTitle": "Get Free Shipping Orders Of $35+",
        "couponDescription": "Enjoy free shipping when you spend $35 and more at Chegg."
    },
    {
        "couponCode": "XHSJJ9K",
        "couponTitle": "Chegg Coupon: Free Shipping With Your Order",
        "couponDescription": "Use this Chegg promo code at checkout and get free standard shipping with your order."
    },
    {
        "couponCode": "LM63UD8",
        "couponTitle": "Chegg Discount Code: Up to 5% Off Your Purchase",
        "couponDescription": "Visit Chegg and get up to 5% off orders with this coupon code on your cart at checkout."
    },
    {
        "couponCode": "JIYMU8K",
        "couponTitle": "Take 90% Off Your Order",
        "couponDescription": "Enjoy up to 90% off textbooks plus enjoy free shipping with this Chegg code."
    },
    {
        "couponCode": "24FwWendy",
        "couponTitle": "Chegg Discount Code: Up to 25% Off Your Purchase",
        "couponDescription": "Visit Chegg and get up to 25% off select orders with this coupon code on your cart at checkout."
    },
    {
        "couponCode": "CHGBLKFRI2024",
        "couponTitle": "Take 20% Off Your Purchase",
        "couponDescription": "Save 20% on first month study pack subscription by adding this Chegg code."
    },
    {
        "couponCode": "CHGDec2022024",
        "couponTitle": "Chegg Coupon: 20% Off Your First Month of Chegg Study or Study Pack Subscription",
        "couponDescription": "Score 20% off on your first month when you sign up for a new Chegg Study or Chegg Study Pack monthly subscription. Just use this promo code to unlock this deal."
    },
    {
        "couponCode": "SNELL",
        "couponTitle": "Extra $5 on Your Purchase",
        "couponDescription": "Apply this Chegg promo code at checkout and save an additional $5."
    },
    {
        "couponCode": "CSPF8YWJW20",
        "couponTitle": "Chegg Coupon: $10 Off Your Order",
        "couponDescription": "Apply this Chegg coupon code to score $10 off on your order."
    },
    {
        "couponCode": "BBBC36CE",
        "couponTitle": "15% Off $100 with Chegg Coupon",
        "couponDescription": "Use this Chegg code to get 15% off your $100 book purchases. See site for eligible textbooks and e-books."
    },
    {
        "couponCode": "CSAF25OFF15",
        "couponTitle": "Save 25% Off with this Chegg Promo Code",
        "couponDescription": "Apply this code today and get 25% off your first month's subscription."
    },
    {
        "couponCode": "CHGDEC2012024",
        "couponTitle": "Chegg Coupon: 20% Off Your First Month of Chegg Study or Study Pack Subscription",
        "couponDescription": "Get ready to ace your studies with 20% off your first month of Chegg Study or Chegg Study Pack. Just use the promo code at checkout and unlock this amazing deal at chegg.com."
    },
    {
        "couponCode": "CAPITAL20",
        "couponTitle": "20% Off Your Order",
        "couponDescription": "Shop and get 20% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "C1J8U5J",
        "couponTitle": "Chegg Coupon: Free Standard Shipping on Your Order",
        "couponDescription": "Get ready to hit the books and save. With their promo code, enjoy free shipping on Chegg. Whether you're tackling tough homework, prepping for that big test, or just looking for a great read - we've got you covered."
    },
    {
        "couponCode": "CHEGG10",
        "couponTitle": "Chegg Coupon Code: Take 10% Off Chegg Study or Chegg Study Pack First month Subscription ",
        "couponDescription": "Enjoy a 10% discount on Chegg study or Chegg study pack first month subscription when you enter this coupon code at checkout."
    },
    {
        "couponCode": "BSUS23QKD3CAPITAL20",
        "couponTitle": "Chegg Promo Code: 20% Off",
        "couponDescription": "Receive 20% off your purchase with this discount code at Chegg."
    },
    {
        "couponCode": "3POERISB",
        "couponTitle": "Free Shipping at Chegg",
        "couponDescription": "Get your textbooks shipped for free with this Chegg shipping code."
    },
    {
        "couponCode": "SMDN13A",
        "couponTitle": "Chegg Coupon: Get Free Standard Shipping ",
        "couponDescription": "Score big savings with this Chegg promo code. Get free standard shipping on all orders. Just use this promo code when you shop."
    }
]