[
    {
        "couponCode": "EXTRA25",
        "couponTitle": "Get 25% Off Clearance Items with Promo Code",
        "couponDescription": "Get a 25% discount on clearance items. Enter this coupon code at checkout."
    },
    {
        "couponCode": "SPOOKY2",
        "couponTitle": "Take Up to 31% Off Your Purchase",
        "couponDescription": "Save up to an extra 31% on your order with this Banter by Piercing Pagoda promo code."
    },
    {
        "couponCode": "PGCART10",
        "couponTitle": "Get 10% Off Your Next Banter Purchase w/ Email Sign-up",
        "couponDescription": "Sign up for email updates at Banter.com to receive an exclusive coupon code for 10% off your next order."
    },
    {
        "couponCode": "AFF035",
        "couponTitle": "30% Off Your Order",
        "couponDescription": "Purchase at Banter by Piercing Pagoda and get 30% off orders using this coupon code on your cart."
    },
    {
        "couponCode": "EMLBOGO",
        "couponTitle": "Banter by Piercing Pagoda Coupon: Buy 1 Get 1 Free Your Order",
        "couponDescription": "Buy one item and get another free. Enter this discount code during checkout to redeem your offer."
    },
    {
        "couponCode": "EMLBGF000000018",
        "couponTitle": "Banter Promo Code: Buy 1, Get 1 Free Select Items",
        "couponDescription": "Use this promo code to get 1 item free when you buy 1 of select products at Banter. Shop now and enjoy this limited-time offer. Don't miss out on this one."
    },
    {
        "couponCode": "EML040",
        "couponTitle": "Banter Coupon: 40% Off Your Order",
        "couponDescription": "Take 40% off sitewide when you spend $50 with this Banter code."
    },
    {
        "couponCode": "PGWLCM10",
        "couponTitle": "Banter Coupon: 10% Off All Orders",
        "couponDescription": "Add this Banter by Piercing Pagoda promo code to receive 10% off the entire site."
    },
    {
        "couponCode": "OGS035",
        "couponTitle": "Save 30% on Your Purchase",
        "couponDescription": "Save 30% on your purchase at Banter with this exclusive promo code. Shop your favorite items now and enjoy big savings. Dont miss out on this limited-time offer."
    },
    {
        "couponCode": "PAG10",
        "couponTitle": "Banter by Piercing Pagoda Promo Code: Get 10% Off Your Purchase",
        "couponDescription": "Apply this coupon code at Banter by Piercing Pagoda to receive 10% off your order at checkout."
    },
    {
        "couponCode": "SECRET10",
        "couponTitle": "Banter Promo Code: Take 10% Off Any Purchase",
        "couponDescription": "Save extra 10% on your Banter purchase with this discount code."
    },
    {
        "couponCode": "EXTRA20",
        "couponTitle": "Get 20% Off Clearance Items with Promo Code",
        "couponDescription": "Get a 20% discount on clearance items. Redeem this coupon code at checkout."
    },
    {
        "couponCode": "19EWS2000000018",
        "couponTitle": "Get 10% Off Any Order ",
        "couponDescription": "Paste this promo code at checkout and save 10% on any order."
    },
    {
        "couponCode": "WINTER",
        "couponTitle": "Take 30% Off Sitewide With Code",
        "couponDescription": "Get a 30% Sitewide discount with Banter's coupon code on your cart at checkout."
    },
    {
        "couponCode": "HLWEML000000018",
        "couponTitle": "Banter by Piercing Pagoda Coupon: 31% Off Your Order",
        "couponDescription": "Enter this promo code during checkout and take a 31% discount on your order."
    },
    {
        "couponCode": "WINBACK10",
        "couponTitle": "Banter by Piercing Pagoda Coupon: 10% Off",
        "couponDescription": "Take 10% off your storewide purchase using this promo code at Banter by Piercing Pagoda."
    },
    {
        "couponCode": "pgwlcm15t3d4",
        "couponTitle": "Banter by Piercing Pagoda Discount Code: 10% Off Any Order",
        "couponDescription": "Get an extra 10% off your entire purchase when you enter this promo code at checkout."
    },
    {
        "couponCode": "B2V415",
        "couponTitle": "Get Up To 10% Off Your Order",
        "couponDescription": "Receive up to 10% off sitewide by adding this Banter code."
    },
    {
        "couponCode": "HLWAFF000000018",
        "couponTitle": "Save 31% Off",
        "couponDescription": "Score 31% off with coupon code"
    },
    {
        "couponCode": "SPOOKY8",
        "couponTitle": "Take 31% Off Your Purchase",
        "couponDescription": "Enjoy 31% off sitewide by using this Banter code."
    }
]