[
    {
        "couponCode": "EXTRA20",
        "couponTitle": "Kohl's Promo Code: Get 20% Off Any Order ",
        "couponDescription": "Redeem this promo code at checkout and save 20% on any order."
    },
    {
        "couponCode": "SHOP25",
        "couponTitle": "Kohl's Friends & Family Sale: Extra 25% Off Your Order",
        "couponDescription": "Enjoy an additional 25% off on your purchase at Kohls when this coupon code is applied at checkout."
    },
    {
        "couponCode": "CATCH15OFF",
        "couponTitle": "Kohl's Promo Code: 15% Off Your Order ",
        "couponDescription": "Get 15% off when you spend at least $100 on clothing, shoes, summer clothing, and more at Kohl's. Apply this Kohl's coupon code at checkout for discount."
    },
    {
        "couponCode": "REWARDS20",
        "couponTitle": "Kohl's Promo Code: Extra 20% Off Your Order",
        "couponDescription": "Rewards members can enjoy an additional 20% off at checkout when using this Kohl's promo code at checkout."
    },
    {
        "couponCode": "FRIENDS20",
        "couponTitle": "Kohl's Code: 20% Any Purchase",
        "couponDescription": "Treat yourself, friends and family members to some well-deserved savings. Take an extra 20% off on any order with the current Kohl's Friends and Family coupon code."
    },
    {
        "couponCode": "BUZZYMAKEUP",
        "couponTitle": "Get Free 4X Points On Your Purchase",
        "couponDescription": "Enjoy 4x points with the order of a clean makeup product at Kohl's."
    },
    {
        "couponCode": "YOUR15",
        "couponTitle": "Kohl's Discount: 15% Off Your Purchase",
        "couponDescription": "Explore Kohl's wide range of products, including clothing, home goods, electronics, and more. Enjoy an extra 15% off on your purchase in store and online, when you use this promo code at checkout."
    },
    {
        "couponCode": "HOME10",
        "couponTitle": "Kohl's Discount Code: Extra $10 Off Your Order",
        "couponDescription": "Take an additional $10 off your order when your spend over $50 and use this Kohl's coupon code at checkout."
    },
    {
        "couponCode": "KOHLSCARD30",
        "couponTitle": "Extra 30% Off with Kohl's Card",
        "couponDescription": "Receive an additional 30% off on any purchase when you apply this Kohl's discount code and use your Kohl's card at checkout."
    },
    {
        "couponCode": "MYFAMILY25",
        "couponTitle": "Get Up to 30% Off Your Order ",
        "couponDescription": "Paste this promo code at checkout and save up to 30% on your order."
    },
    {
        "couponCode": "FFSAVE",
        "couponTitle": "Kohl's Coupon: 20% Off Your Order",
        "couponDescription": "Save 20% on clothing, shoes and more at Kohl's."
    },
    {
        "couponCode": "SHOPPER20",
        "couponTitle": "Kohl's Discount: 20% Off Your Order ",
        "couponDescription": "Apply this Kohl's discount code at checkout and save 20% on your order."
    },
    {
        "couponCode": "20SHOP",
        "couponTitle": "Kohl's Promo Code: 20% Off Your Order",
        "couponDescription": "Apply this Kohl's coupon code during checkout to get 20% off  on eligible purchases."
    },
    {
        "couponCode": "REWARDS25",
        "couponTitle": "Extra 25% Off Your Order with Kohl's Coupon",
        "couponDescription": "Enjoy shopping at Kohl's and receive an extra 25% discount on your order. Apply this discount code at checkout. Valid for Kohl's Rewards members."
    },
    {
        "couponCode": "RED30",
        "couponTitle": "Kohl's Discount: 30% Off Your Order Storewide ",
        "couponDescription": "Save big on your next shopping spree at Kohl's. Enjoy 30% off your entire purchase when you apply this Kohl's coupon code at checkout. From fashion to home essentials, Kohl's has everything you need at unbeatable prices. Promo valid only for rewards members."
    },
    {
        "couponCode": "GOSHOP25",
        "couponTitle": "Kohl's Coupon: 25% Off Your Order",
        "couponDescription": "Save 25% on most clothing items with this Kohl's code."
    },
    {
        "couponCode": "FFSAVE25",
        "couponTitle": "Kohl's Coupon: 25% Off Your Order",
        "couponDescription": "Take 25% off your Kohl's purchase with this code."
    },
    {
        "couponCode": "BUYTOYS",
        "couponTitle": "Kohl's Promo Code: Up to $25 Off Your Order",
        "couponDescription": "Receive up to $25 off your purchase of select toys worth over $50 using this Kohl's promo code at checkout."
    },
    {
        "couponCode": "TIMETOSAVE",
        "couponTitle": "30% Off Sephora Savings Event",
        "couponDescription": "The Sephora Savings Event is here, and every Beauty Insider member gets a discount. Enjoy 30% off select beauty products when you use this promo code at checkout."
    },
    {
        "couponCode": "YOUGET25",
        "couponTitle": "Take 25% Off Your Purchase ",
        "couponDescription": "Enjoy shopping and get a 25% discount on your purchase when you enter this coupon code at checkout."
    }
]