[
    {
        "couponCode": "LROPTIN",
        "couponTitle": " La Redoute UK Coupon: 30% Off Your Order",
        "couponDescription": "Take 30% off when you add this La Redoute UK code."
    },
    {
        "couponCode": "EXTRA15",
        "couponTitle": "La Redoute UK Coupon: 15% Off Your Order",
        "couponDescription": "Brighten up your wardrobe and home with a delightful 15% off at La Redoute UK. Whether you're eyeing that chic midi dress or a minimalist-inspired rug, enjoy great savings on your favourite fashion and home décor items."
    },
    {
        "couponCode": "BIRTHDAY",
        "couponTitle": "Enjoy 10% Savings Using Promo Code",
        "couponDescription": "Get 10% off with discount code"
    },
    {
        "couponCode": "welcome",
        "couponTitle": "Get Up to 30% Off Select Items with Promo Code",
        "couponDescription": "Enjoy up to a 30% discount on select Items. Redeem this coupon code at checkout."
    },
    {
        "couponCode": "CYBER10",
        "couponTitle": "La Redoute UK Promo Code: Extra 10% Off",
        "couponDescription": "Score 10% off on your cart when you order using the discount code from La Redoute UK at checkout."
    },
    {
        "couponCode": "WILLKOMMEN",
        "couponTitle": "La Redoute UK Coupon Code: Take 50% Off Any Purchase ",
        "couponDescription": "Enjoy a 50% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "LRPAY20",
        "couponTitle": "Save Up to 20% on Your Purchase ",
        "couponDescription": "Shop at La Redoute UK and get up to a 20% discount on your purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "EXTRA10",
        "couponTitle": "Save 10% Sitewide",
        "couponDescription": "Get linens, apparel, and more when you shop at La Redoute and enter this coupon at checkout to get 10% off your total."
    },
    {
        "couponCode": "SAVEBIG",
        "couponTitle": "La Redoute UK Coupon: 15% Off Your Order",
        "couponDescription": "Take up to 15% off sitewide on autumn sale at \nLa Redoute UK."
    },
    {
        "couponCode": "BF15",
        "couponTitle": "Save 15% Off with Code",
        "couponDescription": "Save 15% off with discount code"
    },
    {
        "couponCode": "FREEDEL",
        "couponTitle": "60% Savings + Free Shipping on Your Next Order",
        "couponDescription": "Shop La Redoute for French styles of home, fashion, and more and use this code to save 60% on your next order and get it shipped to you for free."
    },
    {
        "couponCode": "LR10",
        "couponTitle": "Save 10% at La Redoute UK",
        "couponDescription": "With a coupon code, receive an extra 10% off La Redoute house brands."
    },
    {
        "couponCode": "OH10",
        "couponTitle": "La Redoute UK Promo Code: Extra 10% Off Your Order",
        "couponDescription": "Shop and take an extra 10% off your purchase using a coupon code on your cart."
    },
    {
        "couponCode": "LR20",
        "couponTitle": "Take Extra 20% Off Your Order",
        "couponDescription": "Enjoy extra 20% off fashion and home with this La Redoute UK code."
    },
    {
        "couponCode": "WEEKEND",
        "couponTitle": "Free Shipping on Your Purchase",
        "couponDescription": "Take free delivery on orders of £20 and over. Remember to apply this La Redoute UK voucher code at checkout."
    },
    {
        "couponCode": "LOVE14",
        "couponTitle": "Take 14% Off with Code",
        "couponDescription": "Buy now and use this promo code at laredoute.co.uk for an additional 14% discount on final clearance."
    },
    {
        "couponCode": "VIP20",
        "couponTitle": "20% Off Any Order Sitewide",
        "couponDescription": "Use this promo code at La Redoute UK to get 20% off your entire order when you check out."
    },
    {
        "couponCode": "MERRY",
        "couponTitle": "Score Up to 40% Off Your Order",
        "couponDescription": "Get up to 40% off your eligible purchase when you apply this La Redoute UK voucher code at checkout."
    },
    {
        "couponCode": "FRIDAY",
        "couponTitle": "La Redoute UK Promo Code: Extra 13% Off Your Order",
        "couponDescription": "Buy and save an additional 13% with this discount code on your purchase at La Redoute UK."
    },
    {
        "couponCode": "EARLYBF",
        "couponTitle": "La Redoute UK Discount Code: Save Extra 15% on Any Purchase ",
        "couponDescription": "Shop at La Redoute UK and enjoy an extra 15% discount on any purchase. Apply this discount code at checkout."
    }
]