[
    {
        "couponCode": "NB2016",
        "couponTitle": "10% Off Your Purchase At Carolina",
        "couponDescription": "Shop with this Carolina discount code to get 10% off your orders."
    },
    {
        "couponCode": "BIOTECH",
        "couponTitle": "Carolina Coupon: 10% Off",
        "couponDescription": "Take 10% off all orders on your purchase using Carolina's promo code at checkout."
    },
    {
        "couponCode": "PLANT",
        "couponTitle": "Carolina Coupon Code: 10% Off Your Order",
        "couponDescription": "Enjoy a 10% discount on your purchase at Carolina with this coupon code. Don't miss out on this limited-time offer. Save on your order today."
    },
    {
        "couponCode": "CAROLINA10",
        "couponTitle": "Take $10 Off w/ Discount Code",
        "couponDescription": "sign up as a new member today and receive $10 off with coupon code"
    },
    {
        "couponCode": "WATER",
        "couponTitle": "10% Off Your Purchase",
        "couponDescription": "Unlock a world of savings with 10% off your current purchase at carolina.com by using this coupon code. Explore their vast selection of educational resources, science kits, and lab supplies to ignite curiosity and fuel learning."
    },
    {
        "couponCode": "LARVAE",
        "couponTitle": "Carolina Coupon: 10% Off Your Order",
        "couponDescription": "Get ready to save more with a 10% off discount code for your current purchase at carolina.com, your destination for quality science, technology, and math learning materials. From lab supplies to live organisms and digital resources, enhance your educational experience while enjoying great savings."
    },
    {
        "couponCode": "SPIDER",
        "couponTitle": "Carolina Coupon: 10% Off Your Order",
        "couponDescription": "Experience the joy of savings with a 10% off discount code for your current purchase at carolina.com, where quality meets affordability. Whether you're shopping for top-notch science kits or in need of lab supplies and specimens, this deal offers you the chance to save while stocking up on your essentials."
    },
    {
        "couponCode": "GRADE",
        "couponTitle": "Save 10% on Classroom Guides + Tools + STEAM Supplies w/ Coupon",
        "couponDescription": "Before checking out, apply this Carolina promo code to receive 10% off your online order."
    },
    {
        "couponCode": "TURTLE",
        "couponTitle": "10% Off Sitewide",
        "couponDescription": "Apply this promo code to score 10% off your purchase at Carolina.com. Choose from a wide selection of premium outdoor apparel, accessories, and equipment - perfect for your current adventure."
    },
    {
        "couponCode": "ALGAE",
        "couponTitle": "Carolina Coupon: 10% Off",
        "couponDescription": "Shop and receive 10% off orders with Carolina's promo code on your cart."
    },
    {
        "couponCode": "ANIMAL",
        "couponTitle": "Carolina Coupon: 10% Off Your Order",
        "couponDescription": "Receive 10% off when you use this Carolina discount code."
    },
    {
        "couponCode": "SENSOR",
        "couponTitle": "Carolina Coupon: 10% Off Your Order",
        "couponDescription": "Take 10% off when you add this Carolina code."
    },
    {
        "couponCode": "SLIDES",
        "couponTitle": "Carolina Coupon: 10% Off Your Order",
        "couponDescription": "Get ready to bag a bargain, Carolina fans. We have an exciting 10% off promo code just for you. Don't miss this fantastic opportunity to get your hands on their best-sellers like the Carolina Panthers jerseys or the iconic UNC Tar Heels caps at an unbeatable price."
    },
    {
        "couponCode": "TUBES",
        "couponTitle": "Carolina Coupon: 10% Off Your Order",
        "couponDescription": "Save at Carolina by getting 10% on your purchase."
    },
    {
        "couponCode": "CLAMP",
        "couponTitle": "Carolina Coupon: 10% Off Your Order",
        "couponDescription": "Take 10% off sitewide by using this Carolina code."
    },
    {
        "couponCode": "HARDY",
        "couponTitle": "Save 10% Off Sitewide",
        "couponDescription": "Get an amazing deal at Carolina because you can get 10% off your purchase when you use this promo code. This is a great way to save money on your current purchase."
    },
    {
        "couponCode": "CYCLE",
        "couponTitle": "10% Off Any Order",
        "couponDescription": "Get ready to cheer, Carolina shoppers. We're rolling out a delightful 10% off promo code just for you. With the change of season comes an exciting opportunity to refresh your wardrobe, upgrade your home decor, or even invest in some much-needed self-care products. This is a fantastic time to save at Carolina because the extensive range of high-quality products is designed to cater to all your needs and desires. So why wait? Start saving now and make the most of this irresistible offer."
    },
    {
        "couponCode": "RULER",
        "couponTitle": "Get 10% Off Your Order",
        "couponDescription": "Take 10% off when you add this Carolina code."
    },
    {
        "couponCode": "REAGENT",
        "couponTitle": "Take 10% Off Qualifying Reagent Products with Carolina Promo Code",
        "couponDescription": "Once you redeem this Carolina lab supply promo code, you'll save 10% on chemical grade reagents."
    },
    {
        "couponCode": "STUDENT",
        "couponTitle": "Carolina Coupon: 10% Off Your Order",
        "couponDescription": "Enjoy a 10% discount on your purchase at carolina.com with this promo code. This deal applies to students only."
    }
]