[
    {
        "couponCode": "EMGWABS100",
        "couponTitle": "Teleflora Discount Code: Save Up to 15% on Any Purchase ",
        "couponDescription": "Shop at Teleflora and enjoy up to a 15% discount on any purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "AFCJWINTER24",
        "couponTitle": "20% Off Any Order Sitewide",
        "couponDescription": "Redeem this Teleflora code as you checkout to enjoy 20% off your purchase."
    },
    {
        "couponCode": "EMGWAL97",
        "couponTitle": "Teleflora Discount Code: Save 20% on Your Purchase ",
        "couponDescription": "Shop at Teleflora and enjoy a 20% discount on your purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "DECEMBER20",
        "couponTitle": "Teleflora Code: Save 20% Off Your Purchase",
        "couponDescription": "Add this Teleflora coupon code at checkout to save 20% off your orders."
    },
    {
        "couponCode": "EMGWABS97",
        "couponTitle": "Get Up to 10% Off Your Purchase",
        "couponDescription": "Save up to 10% on flowers and gifts with this promo code at Teleflora. Choose from a wide range of beautiful arrangements for any occasion. Enjoy fresh flowers delivered right to your door."
    },
    {
        "couponCode": "EMGWAL93",
        "couponTitle": "Take $25 Off Your Order",
        "couponDescription": "Save at Teleflora by getting 25% on your purchase."
    },
    {
        "couponCode": "XMASVIP2024",
        "couponTitle": "Teleflora Discount Code: Take Up to 20% Off",
        "couponDescription": "Save up to 20% on your next Teleflora order with this discount code. Shop beautiful flowers and gifts while enjoying great savings. Don't miss out on this limited-time offer."
    },
    {
        "couponCode": "HOLLY2024",
        "couponTitle": "Save 5% on Any Purchase ",
        "couponDescription": "Shop at Teleflora and get a 5% discount on any purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "EMGWAL98",
        "couponTitle": "Teleflora Promo Code: 20% Off",
        "couponDescription": "Receive 20% off your purchase with this discount code at Teleflora."
    },
    {
        "couponCode": "UPSELL25PDP",
        "couponTitle": "Teleflora Discount Code: Up to 25% Off Your Order",
        "couponDescription": "Save up to 25% using this coupon code on your sitewide purchase at Teleflora."
    },
    {
        "couponCode": "NATURALFALL10",
        "couponTitle": "Teleflora Coupon Code: Take 10% Off Your Purchase ",
        "couponDescription": "Enjoy a 10% discount on your purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "AFCJXMAS24",
        "couponTitle": "Teleflora Coupon:  20% Off Your Order",
        "couponDescription": "Save 20% on christmas flowers on cyber monday at Teleflora."
    },
    {
        "couponCode": "AFCJDEC176",
        "couponTitle": "Take 20% Off Your Order",
        "couponDescription": "Save 20% on fall bouquets with this Teleflora code."
    },
    {
        "couponCode": "emgan114",
        "couponTitle": "Take Up to 20% Off Your Purchase",
        "couponDescription": "Save up to 20% on beautiful flowers at Teleflora. Use this promo code during checkout to enjoy this special offer. Brighten someone's day with stunning bouquets at a lower price."
    },
    {
        "couponCode": "Turkey2024",
        "couponTitle": "Get Free $20 Turkey Card Orders Of $125",
        "couponDescription": "Enjoy free $20 turkey card when you spend $125 with this Teleflora code."
    },
    {
        "couponCode": "THANKS2024",
        "couponTitle": "Teleflora Coupon: 20% Off Your Order",
        "couponDescription": "Get up to 20% off sitewide with this Teleflora code."
    },
    {
        "couponCode": "UPSELL25",
        "couponTitle": "Teleflora Coupon: 25% Off Your Order",
        "couponDescription": "Get 25% off when you add this Teleflora discount code."
    },
    {
        "couponCode": "AFCJHON25",
        "couponTitle": "Teleflora Coupon Code: Take Extra 25% Off Flower Collection Items ",
        "couponDescription": "Enjoy an extra 25% discount on flower collection when you enter this coupon code at checkout."
    },
    {
        "couponCode": "AFCJDECY211",
        "couponTitle": "Teleflora Coupon: 20% Off Your Order",
        "couponDescription": "Save 20% on flower delivery by adding this Teleflora code."
    },
    {
        "couponCode": "PSGF10D",
        "couponTitle": "Teleflora Promo Code: Up to 15% Off Your Order",
        "couponDescription": "Shop and take up to 15% off your purchase using a coupon code on your cart."
    }
]