[
    {
        "couponCode": "W3XFBQ7H",
        "couponTitle": "Get Free Shipping On Your Purchase",
        "couponDescription": "Enjoy free shipping on blake crossbody in colorful bouquet with this The Paper Store code."
    },
    {
        "couponCode": "SHOP30",
        "couponTitle": "The Paper Store Coupon: 30% Off Your Purchase",
        "couponDescription": "Apply this promotional code at checkout to get 30% off regular priced items."
    },
    {
        "couponCode": "AP29AJDS",
        "couponTitle": "The Paper Store Promo Code: Get Up to 5% Off Any Order ",
        "couponDescription": "Redeem this promo code at checkout and save up to 5% on any order."
    },
    {
        "couponCode": "65W4HLHZ",
        "couponTitle": "Save 15% Off",
        "couponDescription": "Take up to 15% off with promo code"
    },
    {
        "couponCode": "EXTRA30",
        "couponTitle": "The Paper Store Coupon: 30% Off Your Order",
        "couponDescription": "Take 30% off select fall fashion with this The Paper Store code."
    },
    {
        "couponCode": "FAM24",
        "couponTitle": "The Paper Store Coupon: 20% Off Your Entire Purchase",
        "couponDescription": "Enjoy 20% off your entire purchase with this coupon code. It's the perfect time to stock up on all your favorite finds at thepaperstore.com during their Friends & Family Sale."
    },
    {
        "couponCode": "3F4HC7Z5",
        "couponTitle": "Save Extra 10% on Your Purchase ",
        "couponDescription": "Shop at The Paper Store and get an extra 10% discount on your purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "LCYKW7PY",
        "couponTitle": "Free Shipping",
        "couponDescription": "Free shipping with coupon"
    },
    {
        "couponCode": "BD150",
        "couponTitle": "Free Winter Set With $150+ Barefoot Dreams Order At The Paper Store",
        "couponDescription": "Use this The Paper Store promo code at checkout to get a free winter set with $150 or more Barefoot Dreams purchase."
    },
    {
        "couponCode": "UY738YSW",
        "couponTitle": "Get 10% Off Sitewide with Promo Code",
        "couponDescription": "Use this coupon code at checkout and get a 10% discount on your order."
    },
    {
        "couponCode": "CHEER24",
        "couponTitle": "40% Off Your Purchase Instantly",
        "couponDescription": "Use a promo code to save 40% on regular-price items at The Paper Store."
    },
    {
        "couponCode": "8QG9Z4HY",
        "couponTitle": "Enjoy 15% Off Your Order Sitewide",
        "couponDescription": "Get 15% off your entire order at The Paper Store with this coupon code. Shop a wide selection of gifts, stationery, and more. Don't miss out on this limited-time offer."
    },
    {
        "couponCode": "ZXGRDQ2A",
        "couponTitle": "The Paper Store Coupon: 40% Off Your Order",
        "couponDescription": "Take 40% off your The Paper Store purchase with this code."
    },
    {
        "couponCode": "INIS40",
        "couponTitle": "The Paper Store Discount Code: Get Free Inis Cosmetic Bag on Orders $40+",
        "couponDescription": "Shop at The Paper Store and get a free Inis cosmetic bag on orders over $40 when you apply this discount code at checkout."
    },
    {
        "couponCode": "QM58HV3H",
        "couponTitle": "Get 40% Off Your Order",
        "couponDescription": "Big savings at The Paper Store by getting 40% on your purchase."
    },
    {
        "couponCode": "TAKE20",
        "couponTitle": "Get 20% Off Any Items ",
        "couponDescription": "Paste this promo code at checkout and save 20% on any items."
    },
    {
        "couponCode": "FREESTRAW",
        "couponTitle": "Take 40% Off Your Order",
        "couponDescription": "Get 40% off sitewide plus free gift with stanley quencher purchase at The Paper Store."
    },
    {
        "couponCode": "GB8RSLGA",
        "couponTitle": "The Paper Store Promo Code: 40% Off Your Order",
        "couponDescription": "Get 40% off your purchase using a promo code on your cart."
    },
    {
        "couponCode": "VERA30",
        "couponTitle": "Paper Store Coupon: 30% Off Your Order",
        "couponDescription": "Save 30% on vera bradley item by adding this The Paper Store code."
    },
    {
        "couponCode": "CYBER40",
        "couponTitle": " The Paper Store Offer: 40% Off Your Purchase",
        "couponDescription": "Score 40% off at checkout using the coupon code in your shopping cart at The Paper Store."
    }
]