[
    {
        "couponCode": "SHIPFAST",
        "couponTitle": "Entirely Pets Discount Code: Get Free USA Shipping on Your Purchase ",
        "couponDescription": "Shop at Entirely Pets and get free USA shipping on your purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "NY25",
        "couponTitle": "Entirely Pets Promo Code: 17% Off All Products",
        "couponDescription": "Add this Entirely Pets promo code at checkout to save 17% off all your orders."
    },
    {
        "couponCode": "EP15",
        "couponTitle": "Enjoy A 15% Discount On All Items",
        "couponDescription": "15% off sitewide"
    },
    {
        "couponCode": "3VCAPSBOGO",
        "couponTitle": "Entirely Pets Coupon Code: Buy 2 Get 1 Free 3V Caps HP Snip Tips for Smaller Dogs and Cats",
        "couponDescription": "Purchase two 3V caps HP snip tips for smaller dogs and cats and get another free when you enter this coupon code at checkout."
    },
    {
        "couponCode": "BF20",
        "couponTitle": "20% Off Black Friday Sale",
        "couponDescription": "Score up to 20% off sitewide purchase during black Friday sale at EntirelyPets."
    },
    {
        "couponCode": "20EP",
        "couponTitle": "Get 20% Off Your Shopping",
        "couponDescription": "Enjoy 20% Discount on Your Purchase"
    },
    {
        "couponCode": "JOINTMAX20",
        "couponTitle": "Save 20% Off",
        "couponDescription": "Score 20% off with code"
    },
    {
        "couponCode": "ANNI20",
        "couponTitle": "Take Extra 20% Off Your Purchase ",
        "couponDescription": "Enjoy shopping and get an extra 20% discount on your purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "MOM20",
        "couponTitle": "Entirely Pets Coupon: 20% Off Your Order",
        "couponDescription": "Take 20% off pet food and pet products at Entirely Pets."
    },
    {
        "couponCode": "CM20",
        "couponTitle": "Get 20% Off Sale",
        "couponDescription": "Score 20% off sale at EntirelyPets."
    },
    {
        "couponCode": "EP17",
        "couponTitle": "Save 17% Off Sitewide",
        "couponDescription": "Score up to 17% off sitewide during Labor Day sale at EntirelyPets, plus $69 order ships free."
    },
    {
        "couponCode": "DADDAY20",
        "couponTitle": "Entirely Pets Coupon: Extra 20% Off Your Order",
        "couponDescription": "Take an additional 20% off store-wide orders when you purchase with a promo code on your cart."
    },
    {
        "couponCode": "OURTREAT",
        "couponTitle": "Entirely Pets Coupon: $10 Off Your Order",
        "couponDescription": "Save $10 on pet food and pet products at Entirely Pets."
    },
    {
        "couponCode": "10FORU",
        "couponTitle": "Take 10% Off Your Order",
        "couponDescription": "Enjoy 10% off select products with this Entirely Pets code."
    },
    {
        "couponCode": "SPOG25",
        "couponTitle": "Enjoy 25% Off Special Deals for Your Beloved Pet on Selected Items",
        "couponDescription": "Get ready for some paw-some savings. Use the special code at entirelypets.com and get an exciting 25% off on selected items. Because we know your pet is special, we've curated a selection of quality products just for them. Now's the perfect time to pamper your furry friend and save at Entirely Pets, so don't let this amazing deal slip away."
    },
    {
        "couponCode": "ORA20",
        "couponTitle": "EntirelyPets Coupon Code: 20% Off Your Order",
        "couponDescription": "Save 20% on Ora-Clens products at EntirelyPets with this coupon code. Keep your pet's teeth clean and healthy. Don't miss this great deal on top dental care products for pets."
    },
    {
        "couponCode": "PRIME18",
        "couponTitle": "Entirely Pets Coupon: 18% Off Your Order + Free Shipping on Orders $49+",
        "couponDescription": "Take advantage of a fantastic 18% discount exclusively on Amazon Prime Day when shopping at entirelypets.com. Plus, enjoy the benefit of free shipping on any orders totaling $49 or more. Today's special offerings make it an opportune time to get great savings on your pet needs at Entirely Pets."
    },
    {
        "couponCode": "20OFF105",
        "couponTitle": "Entirely Pets Coupon: $20 Off Orders $105+",
        "couponDescription": "Take advantage of a fantastic deal at entirelypets.com with a $20 off promo code. Don't forget to paste this coupon code at checkout to enjoy your savings. Grab your pet supplies for less today."
    },
    {
        "couponCode": "10OFF55",
        "couponTitle": "Entirely Pets Coupon Code: $10 Off All Orders",
        "couponDescription": "Entirely Pets is offering a discount of $10 off purchases of $55 or more."
    },
    {
        "couponCode": "VITABOGO",
        "couponTitle": "Entirely Pets Promo Code: Buy 2 Get 1 Free Vita-Tabs Chewable Tablet",
        "couponDescription": "Purchase two Vita-Tabs chewable tablets and get another free. Redeem this promo code at checkout."
    }
]