[
    {
        "couponCode": "MRRSL30",
        "couponTitle": "Get Free Shipping On Your Purchase",
        "couponDescription": "Take free shipping when you spend $30 and more at Salt Life."
    },
    {
        "couponCode": "CYBERSALE",
        "couponTitle": "Save 25% + Free Shipping",
        "couponDescription": "Apply this Salt Life coupon code to get 25% off on Full Price Items and an extra 50% off on Sale Items with a Free Shipping discount on your orders."
    },
    {
        "couponCode": "review20",
        "couponTitle": "Take 20% Off at Salt Life With Promo Code",
        "couponDescription": "Use this code at checkout and save 20% off your order at Salt Life."
    },
    {
        "couponCode": "SALE10AFF",
        "couponTitle": "Salt Life Coupon: Extra 10% Off Your Order",
        "couponDescription": "Save an extra 10% on sale items when you use this promo code at checkout."
    },
    {
        "couponCode": "CC10SL30",
        "couponTitle": "Get Free Shipping on Orders $30+ ",
        "couponDescription": "Paste this promo code at checkout and get free shipping on orders over $30."
    },
    {
        "couponCode": "FINAL50",
        "couponTitle": "Save 50% On Your Order",
        "couponDescription": "Enjoy 50% off your entire purchase with this Salt Life discount code."
    },
    {
        "couponCode": "DON10",
        "couponTitle": "Get 10% Off With Salt Life Code",
        "couponDescription": "Apply this code at checkout and get 10% off your eligible order at Salt Life."
    },
    {
        "couponCode": "SALTY30",
        "couponTitle": "Salt Life Promo Code: Get Extra 30% Off Your Order ",
        "couponDescription": "Redeem this promo code at checkout and save an extra 30% on your order."
    },
    {
        "couponCode": "SALTY10",
        "couponTitle": "Salt Life Coupon: Up to 10% Off Your Purchase",
        "couponDescription": "Get up to 10% off select items with Salt Life's promo code on your cart."
    },
    {
        "couponCode": "FISH50",
        "couponTitle": "Get 50% Off Sale Items",
        "couponDescription": "Score up to 50% off on sale items at Salt Life."
    },
    {
        "couponCode": "BIGSALE25",
        "couponTitle": "Get 50% Off Sale Items with Discount Code",
        "couponDescription": "Apply this coupon code at checkout and take a 50% discount on sale items."
    },
    {
        "couponCode": "SLASH50",
        "couponTitle": "Save 50% at Salt Life",
        "couponDescription": "Take advantage of our discount of 50% off when you shop with the code. Redeem at checkout."
    },
    {
        "couponCode": "PREZ50",
        "couponTitle": "Take Extra 50% Off Everything",
        "couponDescription": "Big savings at Salt Life by getting 50% on your order."
    },
    {
        "couponCode": "EXTRA50",
        "couponTitle": "Additional Half-Price Discount On Sale Goods",
        "couponDescription": "Extra 50% Off Sale Items"
    },
    {
        "couponCode": "FLASH50",
        "couponTitle": "Get 50% Off 48-Hour Flash Sale",
        "couponDescription": "Save big at Salt Life during the 48-hour flash sale by getting 50% off sale items."
    },
    {
        "couponCode": "USA50",
        "couponTitle": "Get EXTRA 50% OFF SALE ITEMS With Code",
        "couponDescription": "Add this Salt Life promo code to enjoy extra 50% off sale items."
    },
    {
        "couponCode": "SALE25",
        "couponTitle": "Salt Life Promo Code: 25% Off Entire Order",
        "couponDescription": "Use this Salt Life discount code at checkout to take 25% off your entire order."
    },
    {
        "couponCode": "REWARDS30",
        "couponTitle": "Save Up to 30% on Your Purchase ",
        "couponDescription": "Shop at Salt Life and get up to a 30% discount on your purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "SALUTE",
        "couponTitle": "Salt Life Coupon: Free Shipping on Your Order",
        "couponDescription": "Get ready for a splash of savings. Dive into the Salt Life experience with this coupon code for free shipping on your order. Discover beach-ready apparel, accessories and more at unbeatable prices."
    },
    {
        "couponCode": "SUMMER50",
        "couponTitle": "50% Off Memorial Day Sale Items",
        "couponDescription": "Get ready to dive into a fantastic 50% discount on sale items at SaltLife.com during the amazing Memorial Day Sale. Don't miss out on this incredible opportunity to grab your favorite beachwear, accessories, and more at unbeatable prices. Shop now and make a splash in style this summer."
    }
]