[
    {
        "couponCode": "EXTRA20",
        "couponTitle": "Get 20% Off On Sale Items",
        "couponDescription": "Score 20% off on sale items at Dylan's Candy Bar."
    },
    {
        "couponCode": "CHEWY",
        "couponTitle": "Enjoy $20 Discount on Orders Over $125 with Free Shipping",
        "couponDescription": "Sweeten up your day with this exciting promo code. Enjoy a delicious $20 off when you spend $125 or more at dylanscandybar.com. Plus, we're throwing in free shipping to make your shopping experience even sweeter. Indulge yourself today."
    },
    {
        "couponCode": "SWT24",
        "couponTitle": "Dylan's Candy Bar Coupon: 15% Off Your Order & Free Shipping on $50+ ",
        "couponDescription": "Sweeten your online shopping experience at dylanscandybar.com with a delightful 15% off on any order. Plus, enjoy the cherry on top - free shipping every day on orders of $50 or more. Grab this coupon code and start shopping."
    },
    {
        "couponCode": "SWT23",
        "couponTitle": "Enjoy 10% Off Any Order + Free Shipping on Purchases Over $75",
        "couponDescription": "Satisfy your sweet tooth with an irresistible deal at DylansCandyBar.com. Snap up a delightful 10% off on any order, whether it's the famous chocolate bars, colourful candy collections or the scrumptious signature treats. Plus, when you spend $75 or more, we're throwing in free shipping. It's time to fill your cart with sweetness and enjoy these fantastic savings."
    },
    {
        "couponCode": "CHEWY23",
        "couponTitle": "Score $15 Off and Free Shipping Sitewide",
        "couponDescription": "Sweeten your shopping spree at DylansCandyBar.com with a scrumptious $15 discount on orders over $125. Plus, enjoy free shipping. Just use this coupon code at checkout. Indulge in a colorful candy wonderland without breaking the bank, and treat yourself to this unmissable offer."
    },
    {
        "couponCode": "SWEETS20",
        "couponTitle": "Enjoy 20% Off + Free Shipping",
        "couponDescription": "Receive 20% off a $100 order + Free Shipping on your cart using the promo code at checkout."
    },
    {
        "couponCode": "MEM25",
        "couponTitle": "Dylan's Candy Bar Coupon: Enjoy 25% Off Your Order, Free Body Art Kit & Free Shipping on Orders Over $75",
        "couponDescription": "Get ready for a sweet deal at dylanscandybar.com. With the Memorial Day Sale, you can enjoy a whopping 25% off on everything, sitewide. But that's not all - we're topping off this offer with a complimentary Body Art Kit. Just use this coupon code at checkout. Plus, bag free shipping on orders over $75."
    },
    {
        "couponCode": "GREEN20",
        "couponTitle": "Save 20% Off",
        "couponDescription": "Receive 20% Off on Full-Priced Items"
    },
    {
        "couponCode": "SWEETS2024",
        "couponTitle": "Get 25% Off Your Purchase",
        "couponDescription": "Use this Dylan's Candy Bar discount code to save 25% on your order."
    },
    {
        "couponCode": "30SHIPSFREE",
        "couponTitle": "Free Shipping on Order $30+",
        "couponDescription": "Get free shipping on purchases of $30 or more with code. Redeem at checkout."
    },
    {
        "couponCode": "SWEETS23",
        "couponTitle": "15% Off + Free Shipping w/ Minimum Spend",
        "couponDescription": "Get a 15% discount plus free delivery on orders over $50 using this promo code at dylanscandybar.com."
    }
]