[
    {
        "couponCode": "VTXCLR",
        "couponTitle": "Primary Arms Coupon: $500 Off Your Order",
        "couponDescription": "Get $500 on vortex optics impact 4000 ballistic railmounted laser rangefinder by adding this Primary Arms code."
    },
    {
        "couponCode": "SAVE12",
        "couponTitle": "Save 12% Off On Your Order",
        "couponDescription": "Save 12% Off sitewide on your Primary Arms purchase today using discount code during checkout."
    },
    {
        "couponCode": "RAPTOR",
        "couponTitle": "Only $69.99! with Code",
        "couponDescription": "holy cow! primary arms is selling raptors for $69.99 with coupon code!!! limit 2. this is by far the..."
    },
    {
        "couponCode": "DEFENDER",
        "couponTitle": "Primary Arms Discount Code: 30% Off",
        "couponDescription": "Apply 30% off select items using this coupon code on your purchase at Primary Arms."
    },
    {
        "couponCode": "ADAC",
        "couponTitle": "Primary Arms Coupon: 10% Off Your Order",
        "couponDescription": "Save 10% on all radian weapons a dac lower by adding this Primary Arms code."
    },
    {
        "couponCode": "EXPS3",
        "couponTitle": "Get 20% Off EOTECH EXPS3 ",
        "couponDescription": "paste this promo code at checkout and save 20% on eotech ."
    },
    {
        "couponCode": "LMTLPK",
        "couponTitle": "Receive 15% Off Your Purchase",
        "couponDescription": "Apply this Primary Arms promotional code at checkout to get 15% off your eligible order."
    },
    {
        "couponCode": "GUNFUNNY",
        "couponTitle": "Primary Arms Coupon: 10% Off Your Order",
        "couponDescription": "Save extra 10% on cleaning kit at Primary Arms."
    },
    {
        "couponCode": "VTXVNM",
        "couponTitle": "Get Extra 20% Off Any Item ",
        "couponDescription": "Paste this promo code at checkout and save an extra 20% on any item."
    },
    {
        "couponCode": "DFNDR",
        "couponTitle": "Receive 25% Off Select Item",
        "couponDescription": "Get 25% off the Vortex Defender-CCW Red Dot Sight 6 MOA at Primary Arms when you use this coupon code. Enjoy precise targeting with this reliable sight designed for accuracy. Shop now and save big on your shooting essentials."
    },
    {
        "couponCode": "VENOM",
        "couponTitle": "Primary Arms Coupon: 20% Off",
        "couponDescription": "Take 20% off Vortex Scope on your purchase using this promo code at Primary Arms."
    },
    {
        "couponCode": "SLICK",
        "couponTitle": "Primary Arms Discount Code: Members Get 15% Off Select Items",
        "couponDescription": "Save 15% on select items at Primary Arms with this discount code. This special offer is for members only. Shop now and enjoy big savings on quality gear."
    },
    {
        "couponCode": "EAGLE",
        "couponTitle": "Primary Arms Promo Code: Get 20% Off Your Order ",
        "couponDescription": "Redeem this promo code at checkout and save 20% on your order."
    },
    {
        "couponCode": "MWS",
        "couponTitle": "Primary Arms Discount Code: Save LMT MWS 308 Stripped Lower Receiver",
        "couponDescription": "shop at primary arms and enjoy a 20% discount on lmt  308 stripped lower receiver. apply this discount code at checkout."
    },
    {
        "couponCode": "RPTRLT",
        "couponTitle": "Primary Arms Coupon: 15% Off Your Order",
        "couponDescription": "Save at Primary Arms by getting 15% on select items."
    },
    {
        "couponCode": "eotech",
        "couponTitle": "Primary Arms Discount Code: Save Extra 15% on Any Items ",
        "couponDescription": "Shop at Primary Arms and enjoy an extra 15% discount on any items. Apply this discount code at checkout."
    },
    {
        "couponCode": "20APPAREL",
        "couponTitle": "Save 20% Off on Apparel",
        "couponDescription": "Score an extra 20% Off on Apparel Items using coupon code during checkout"
    },
    {
        "couponCode": "take13",
        "couponTitle": "Primary Arms Coupon: 13% Off Your Order",
        "couponDescription": "Take 13% off your Primary Arms purchase with this code."
    },
    {
        "couponCode": "512",
        "couponTitle": "Primary Arms Coupon: 15% Off Your Order",
        "couponDescription": "save 15% on eotech  0 holographic weapon sight with this primary arms code."
    },
    {
        "couponCode": "VTXCCW",
        "couponTitle": "Primary Arms Promo Code: Get 25% Off Vortex Optics Defender Ccw 6 Moa Mini Reflex Sight at Primary Arms",
        "couponDescription": "Redeem this promo code at checkout and receive a 25% discount on Vortex Optics Defender Cow 6 moa mini reflex sight at primary arms."
    }
]