[
    {
        "couponCode": "HELLOYOU10",
        "couponTitle": "Enjoy 10% Off Any Purchase ",
        "couponDescription": "Enter this Bloom Boutique coupon code at checkout to receive an extra 10% off everything."
    },
    {
        "couponCode": "BLOOMBDAY15",
        "couponTitle": "Get 15% Off Your Order",
        "couponDescription": "Enjoy 15% off when you use this Bloom Boutique code."
    },
    {
        "couponCode": "BB_ALEXT15",
        "couponTitle": "Bloom Boutique Promo Code: 15% Off Your Order",
        "couponDescription": "Take 15% off your purchase using a coupon code on your cart."
    },
    {
        "couponCode": "BLOOMSTUDENT",
        "couponTitle": "Take up to 10% Off",
        "couponDescription": "Apply this Bloom Boutique discount code to enjoy up to 10% off your entire order."
    },
    {
        "couponCode": "SAVOO12",
        "couponTitle": "Save 12% ",
        "couponDescription": "Use this Bloom Boutique coupon code to enjoy 12% off your next purchase of necklaces, bracelets, and more."
    },
    {
        "couponCode": "TREATS20",
        "couponTitle": "Score 20% Off",
        "couponDescription": "Enter this Bloom Boutique discount code to enjoy 20% off your next jewelry purchase."
    },
    {
        "couponCode": "VIP20",
        "couponTitle": "Bloom Boutique Coupon: 20% Off Your Order",
        "couponDescription": "Avail a 20% discount on your entire order at Bloom Boutique with this exclusive coupon. Enhance your shopping experience and enjoy savings on a wide range of premium products. Shop now to seize the discount."
    },
    {
        "couponCode": "MISSYOU15",
        "couponTitle": "Bloom Boutique Promo Code: 15% Off",
        "couponDescription": "Buy and save 15% with this discount code on your purchase at Bloom Boutique."
    },
    {
        "couponCode": "FIRST15",
        "couponTitle": "Enjoy 15% Off",
        "couponDescription": "Shop for jewelry, necklaces, bracelets, and more and enter this Bloom Boutique coupon code to receive 15% off."
    },
    {
        "couponCode": "BLOOM10",
        "couponTitle": "Get 10% Off Sitewide",
        "couponDescription": "Shop for necklaces, jewelry, bracelets, and more using this Bloom Boutique discount code to get 10% off."
    },
    {
        "couponCode": "VIP25",
        "couponTitle": "Get 25% Off Any Purchase",
        "couponDescription": "Enjoy an extra 25% off all your orders with this Bloom Boutique coupon."
    },
    {
        "couponCode": "welcome10",
        "couponTitle": "Save 10% Sitewide",
        "couponDescription": "Redeem this Bloom Boutique coupon code when shopping for jewelry and save 10% on your order."
    },
    {
        "couponCode": "WELCOME20",
        "couponTitle": "Enjoy 20% Off",
        "couponDescription": "Shop using this Bloom Boutique discount code to score 20% off your next jewelry order."
    },
    {
        "couponCode": "EXTRA10",
        "couponTitle": "Bloom Boutique Coupon: 10% Off Your Order",
        "couponDescription": "Take 10% off your Bloom Boutique purchase with this code."
    },
    {
        "couponCode": "BLOOMDAY15",
        "couponTitle": "Get 15% Off With Bloom Boutique Coupon Code",
        "couponDescription": "Enjoy 15% off your order when you apply this Bloom Boutique coupon code at checkout."
    },
    {
        "couponCode": "VALENTINES15",
        "couponTitle": "Save 15% With Promo Code",
        "couponDescription": "Shop for earrings, necklaces, and more with this Bloom Boutique discount code and enjoy 15% off your order."
    },
    {
        "couponCode": "WEDDING15",
        "couponTitle": "15% Off Personalized Wedding Gifts",
        "couponDescription": "Shop for personalized wedding gifts to receive 15% off your purchase with this Bloom Boutique coupon code."
    }
]