[
    {
        "couponCode": "SAVE",
        "couponTitle": "Wayfair Promo Code: Get 20% Off Your Order",
        "couponDescription": "Use this Wayfair coupon code at checkout to receive an additional 20% off your entire purchase."
    },
    {
        "couponCode": "APP10",
        "couponTitle": "Wayfair Coupon Code: Get 10% Off Your Order",
        "couponDescription": "Get an extra 10% off on select furniture, décor, home essentials, and more when you apply this Wayfair coupon code at checkout. Offer valid only on select items and through the app."
    },
    {
        "couponCode": "WAYFAIR10",
        "couponTitle": "Wayfair Promo Code: $10 Off Your Order",
        "couponDescription": "Save $10 on your order with this Wayfair promo code. Enjoy discounts on select products."
    },
    {
        "couponCode": "APP15",
        "couponTitle": "Wayfair Discount Code: 15% Off Your Order",
        "couponDescription": "Transform your space with an exclusive 15% off app-only discount at Wayfair. Valid on select brands and products across the site. Apply this coupon code for discount."
    },
    {
        "couponCode": "WB20",
        "couponTitle": "Wayfair Coupon: Extra $20 Off Your Order",
        "couponDescription": "Enjoy an additional $20 off on select WoodBridge bathroom vanities using this Wayfair coupon at checkout."
    },
    {
        "couponCode": "APP20",
        "couponTitle": "Wayfair Code: 20% Off Your Order",
        "couponDescription": "Save an extra 20% off your purchase when you apply this code at checkout. Apply code in your cart or during the checkout process in the app for instant savings on decor, furniture, appliances, and more."
    },
    {
        "couponCode": "SAVE300",
        "couponTitle": "Wayfair Promo Code: Extra $300 Off at Checkout",
        "couponDescription": "Upgrade your kitchen for less with $300 off select kitchen appliances at Wayfair when this promo code is applied at checkout."
    },
    {
        "couponCode": "SYN12",
        "couponTitle": "Wayfair Code: Extra $12 Off Your Order",
        "couponDescription": "Use this Wayfair promo code to receive an additional $12 off on select small kitchen appliance and cookware."
    },
    {
        "couponCode": "EXTRA10",
        "couponTitle": "Extra 10% Off Your Order",
        "couponDescription": "Score an extra 10% off on your Wayfair purchase when using this code during checkout.  This code is valid for various brands and products.  Apply code in your cart to see if your order qualifies."
    },
    {
        "couponCode": "BASQUE13",
        "couponTitle": "Wayfair Coupon: Extra $20 Off at Checkout",
        "couponDescription": "Apply this Wayfair promo code to save an additional $20 on a 7-piece non-stick cast iron cookware set by Basque."
    },
    {
        "couponCode": "SAVE200",
        "couponTitle": "Extra $200 Off with Wayfair Coupon Code",
        "couponDescription": "Apply this Wayfair promo code at checkout to score $200 off select kitchen appliances."
    },
    {
        "couponCode": "WIRECUTTER1",
        "couponTitle": "Extra 26% Off on Your Order at Wayfair",
        "couponDescription": "Use this Wayfair coupon code to receive an additional 26% off on a Vornado VH200 1500 W Electric Fan Heater."
    },
    {
        "couponCode": "WB10",
        "couponTitle": "Wayfair Coupon: 10% Off Your Order",
        "couponDescription": "Use this Wayfair discount code to get 10% off on your purchase. Discover savings on a wide range of home furnishings and décor, including stylish sofas, comfortable bedding, modern kitchenware, and outdoor furniture."
    },
    {
        "couponCode": "ZOO15",
        "couponTitle": "Extra $15 Off Select Reptizoo Items at Wayfair",
        "couponDescription": "Enjoy an additional $15 off on select Reptizoo products when you apply this Wayfair coupon code at checkout."
    },
    {
        "couponCode": "SAVE100",
        "couponTitle": "Wayfair Discount Code: Extra $100 Off Your Order",
        "couponDescription": "Apply this Wayfair coupon code at checkout to receive $100 off on select kitchen appliances."
    },
    {
        "couponCode": "LAVAFAUCET5",
        "couponTitle": "Get $5 Off on Select Products",
        "couponDescription": "Upgrade your bathroom fixtures and save $5 on select Lava Odoro products when this Wayfair promo code is applied."
    },
    {
        "couponCode": "MEMBER50",
        "couponTitle": "Get 50% Off Your First Year of Wayfair Rewards",
        "couponDescription": "Sign up for Wayfair Rewards and get 50% off your first year of membership with this promo code."
    },
    {
        "couponCode": "BIZ50WA1",
        "couponTitle": "Get $50 Off Your Order with Wayfair Coupon",
        "couponDescription": "Enter this promo code at Wayfair to get $50 off your next purchase of furniture, decor, and more."
    },
    {
        "couponCode": "BIZ25WA1",
        "couponTitle": "Wayfair Coupon Code: $25 Off Your Order",
        "couponDescription": "Shop for furniture, decor, lighting, and more and enter this promo code at checkout to get $25 off your next purchase. This offer is valid for Wayfair Professional Members."
    },
    {
        "couponCode": "WIRECUTTER2",
        "couponTitle": "Extra 14% Off on Select Items at Wayfair",
        "couponDescription": "Get an additional 14% off on a Hon Ignition 2 Office Chair at Wayfair when using this promo code."
    }
]