[
    {
        "couponCode": "TPFSHIP9",
        "couponTitle": "Pay just $5.99 shipping on any order. Paste this promo code at checkout.",
        "couponDescription": null
    },
    {
        "couponCode": "BX10",
        "couponTitle": "Up to 10% Off Your Purchase",
        "couponDescription": "Receive up to a 10% discount when this coupon code is applied."
    },
    {
        "couponCode": "WITHPOP",
        "couponTitle": "Free Shipping",
        "couponDescription": "Valentine's Cards With Pop $9.99 + Free Shipping"
    },
    {
        "couponCode": "TPF25",
        "couponTitle": "25% Off Your Order",
        "couponDescription": "Enjoy a 25% discount on any gifts when you apply this promo code at checkout."
    },
    {
        "couponCode": "VETERAN4",
        "couponTitle": "The Popcorn Factory Discount Code: Save 30% on Your Purchase ",
        "couponDescription": "Shop at The Popcorn Factory and enjoy a 30% discount on your purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "TPF20WEL",
        "couponTitle": "Save $15 on Any Purchase ",
        "couponDescription": "Shop at The Popcorn Factory and get a $15 discount on any purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "WADV",
        "couponTitle": "Take Up to 5% Off at The Popcorn Factory",
        "couponDescription": "Apply this promo code during checkout for up to a 5% discount on your order."
    },
    {
        "couponCode": "MILITARYUSA",
        "couponTitle": "Take 25% Off Your Purchase",
        "couponDescription": "Save at The Popcorn Factory by getting 25% on your order."
    },
    {
        "couponCode": "TPFTEXT20",
        "couponTitle": "Take Up to 20% Off Any Item ",
        "couponDescription": "Enjoy shopping at The Popcorn Factory and receive up to a 20% discount on any item. Redeem this discount code at checkout."
    },
    {
        "couponCode": "POPFS",
        "couponTitle": "Free Shipping on Patriotic Items ",
        "couponDescription": "Get ready to enjoy free shipping on all your favorite Patriotic goodies and so much more at ThePopcornFactory.com. Indulge in the top products from The Popcorn Factory while saving big with this amazing deal. Don't miss out, start shopping now."
    },
    {
        "couponCode": "DIAMONDFR",
        "couponTitle": "The Popcorn Factory Promo Code: 15% Off",
        "couponDescription": "Shop using The Popcorn Factory's discount code and get 15% off your purchase at checkout."
    },
    {
        "couponCode": "HOLIDAYFREE",
        "couponTitle": "Up to 30% Off Your Purchase with Promo Code",
        "couponDescription": "Receive up to a 30% discount on your eligible order by simply applying this The Popcorn Factory coupon code at checkout."
    },
    {
        "couponCode": "YOUDECIDE",
        "couponTitle": "The Popcorn Factory Coupon: 20% Off Your Order",
        "couponDescription": "Enjoy up to 20% off your purchase on black friday sale at The Popcorn Factory."
    },
    {
        "couponCode": "ECP",
        "couponTitle": "Score 20% Off Your Order",
        "couponDescription": "Enter this The Popcorn Factory promo code at checkout to get 20% off on orders over $100."
    },
    {
        "couponCode": "TWENTYPOP",
        "couponTitle": "The Popcorn Factory Coupon: 20% Off Your Purchase ",
        "couponDescription": "Enjoy a 20% off sitewide discount code on your current purchase at thepopcornfactory.com. Whether you're stocking up on your favorite popcorn flavors or gifting a loved one with a delicious treat, this deal lets you indulge for less."
    },
    {
        "couponCode": "TPF10",
        "couponTitle": "Enjoy 10% Discount Using The Promo Code",
        "couponDescription": "Get Up to 10% Off with Promo Code"
    },
    {
        "couponCode": "20XFLWS",
        "couponTitle": "Save 20% Off w/ Promo Code",
        "couponDescription": "Shop at The Popcorn Factory and get a 20% discount on any Valentine's Day gifts. Apply this discount code at checkout."
    },
    {
        "couponCode": "entbook",
        "couponTitle": "Get 15% Off Using Promo Code",
        "couponDescription": "Score up to 15% off with discount code"
    },
    {
        "couponCode": "TIER25",
        "couponTitle": "The Popcorn Factory Coupon: Up to 25% Off - 15% Off $50+, 20% Off $75+, and 25% Off $100+ ",
        "couponDescription": "Get ready to pop with savings at thepopcornfactory.com. With this special coupon code, you can save big on your favorite popcorn treats. Spend $50 or more and get a delightful 15% off, or grab a 20% discount when you spend $75 or more. But wait, there's more. For orders of $100 or above, you'll get an irresistible 25% off. Savor the flavor and enjoy these amazing discounts today."
    },
    {
        "couponCode": "TPF50",
        "couponTitle": "50% Off Site-Wide At The Popcorn Factory",
        "couponDescription": "Buy One & Get One 50% off sitewide at thepopcornfactory."
    }
]