[
    {
        "couponCode": "99FLORAL",
        "couponTitle": "Adrianna Papell Discount Code: Up to 20% Off Your Purchase",
        "couponDescription": "Enter this coupon code at checkout to save up to an extra 20% on your order."
    },
    {
        "couponCode": "COCKTAIL20",
        "couponTitle": "Take 20% Off Your Purchase",
        "couponDescription": "Save extra 20% on cocktail dress collection with this Adrianna Papell code."
    },
    {
        "couponCode": "LBDS",
        "couponTitle": "Adrianna Papell Discount Code: Save Extra 25% on Little Black Dresses ",
        "couponDescription": "Shop at Adrianna Papell and enjoy an extra 25% discount on little black dresses. Apply this discount code at checkout."
    },
    {
        "couponCode": "SAVINGS15OFF",
        "couponTitle": "Enjoy Up To 20% Discount Using Promo Code",
        "couponDescription": "Take up to 20% off with promo code"
    },
    {
        "couponCode": "CANCELLED15",
        "couponTitle": "Save 15% Off",
        "couponDescription": "Save Up to 15% When You Use Promo Code"
    },
    {
        "couponCode": "beaded20",
        "couponTitle": "Adrianna Papell Promo Code: 20% Off",
        "couponDescription": "Shop using Adrianna Papell's discount code and get 20% off hand-beaded dresses on your purchase at checkout."
    },
    {
        "couponCode": "2WHVFB",
        "couponTitle": "Save $20 on Your Order",
        "couponDescription": "Apply this Adrianna Papell discount code during checkout to get $20 off your selected purchase."
    },
    {
        "couponCode": "SHAMIHA10",
        "couponTitle": "Adrianna Papell Promo Code: Extra 10% Off Your Purchase",
        "couponDescription": "Order using Adrianna Papell's coupon code and receive an additional 10% off your sitewide purchase at checkout."
    },
    {
        "couponCode": "JS99",
        "couponTitle": "Get 50% Off Your Order",
        "couponDescription": "Receive extra 50% off sleeves asymmetrical jumpsuit at Adrianna Papell."
    },
    {
        "couponCode": "WELCOME20",
        "couponTitle": "Take $20 Off using Coupon Code",
        "couponDescription": "Receive $20 Discount on Eligible Items"
    },
    {
        "couponCode": "SELECT20",
        "couponTitle": "Adrianna Papell Discount Code: 20% Offf",
        "couponDescription": "Apply 20% off using this coupon code on your purchase at Adrianna Papell."
    },
    {
        "couponCode": "SHUG25",
        "couponTitle": "Adrianna Papell Coupon Code: Take 25% Off S'HUG Products ",
        "couponDescription": "Enjoy a 25% discount on S'HUG products when you enter this coupon code at checkout."
    },
    {
        "couponCode": "COZY20",
        "couponTitle": "Save 20% Off Sweaters And Cardigans",
        "couponDescription": "Shop now at Adrianna Papell and receive a 20% discount on sweaters and cardigans. Enter this discount code at checkout."
    },
    {
        "couponCode": "SHUG50",
        "couponTitle": "Take $50 Off SHUG Styles",
        "couponDescription": "Enjoy shopping and get a $50 discount on SHUG styles when you enter this coupon code at checkout."
    },
    {
        "couponCode": "BEADED25",
        "couponTitle": "Adrianna Papell Coupon: Extra 25% Off Your Purchase",
        "couponDescription": "Shop and save an additional 25% with this promo code for beaded dressed on your purchase at Adrianna Papell."
    },
    {
        "couponCode": "FF35",
        "couponTitle": "Enjoy 35% Discount Using Promo Code",
        "couponDescription": "Save up to 35% off with coupon code"
    },
    {
        "couponCode": "AP79",
        "couponTitle": "Save $70 on Any Midi Dresses ",
        "couponDescription": "Shop at Adrianna Papell and get a $70 discount on any midi dresses. Apply this discount code at checkout."
    },
    {
        "couponCode": "SALE25",
        "couponTitle": "Take 25% Off Any Purchase ",
        "couponDescription": "Enjoy shopping and get a 25% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "JS50",
        "couponTitle": "Adrianna Papell Coupon Code: Take $79 Off Any Purchase ",
        "couponDescription": "Enjoy a $79 discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "SAVE30",
        "couponTitle": "Adrianna Papell Discount Code: Extra 30% Off Sale",
        "couponDescription": "Save big at Adrianna Papell with an extra 30% off sale styles. Update your wardrobe with elegant dresses, chic tops, and stylish pants. Shop now and enjoy top fashion at unbeatable prices. Use the discount code at checkout."
    }
]