[
    {
        "couponCode": "goodfinds10",
        "couponTitle": "Clove Discount Code: 10% Off Your Order",
        "couponDescription": "Score 10% off your eligible purchase using this promo code during checkout."
    },
    {
        "couponCode": "CloveDonte",
        "couponTitle": "Grab Up to 10% Off Sitewide",
        "couponDescription": "Get your order for up to 10% off when you enter this Clove coupon code at checkout."
    },
    {
        "couponCode": "MYSTERYGIFT15",
        "couponTitle": "Clove Discount: 5% Off At Checkout",
        "couponDescription": "Score up to 5% off and a mystery gift when you enter this Clove discount code at checkout."
    },
    {
        "couponCode": "cloveemily",
        "couponTitle": "10% Off Any Order with Clove Discount",
        "couponDescription": "Shop for slip on sneakers at Clove and get 10% off your purchase when you enter this promo code at checkout."
    },
    {
        "couponCode": "ADDSOCKSFREE",
        "couponTitle": "Clove Promo Code: Up to 10% Off Instantly",
        "couponDescription": "Use this Clove promo code at checkout to get up to 10% off your purchase."
    },
    {
        "couponCode": "FREE24",
        "couponTitle": "Clove Discount: 15% Off At Checkout",
        "couponDescription": "Enjoy up to 15% off your purchase when you enter this Clove coupon code at checkout on your purchase of shoes."
    },
    {
        "couponCode": "withlove",
        "couponTitle": "Take up to 15% Off Any Purchase with Code",
        "couponDescription": "Use this promo code at checkout to get up to 15% off any Clove footwear."
    },
    {
        "couponCode": "CLOVECLARA",
        "couponTitle": "Get Up to 10% Off with Clove Discount Code",
        "couponDescription": "Enter this Clove promo code at checkout on your next purchase and get up to 10% off your total."
    },
    {
        "couponCode": "clovelisa",
        "couponTitle": "Get 10% Off Your Order Using Clove Coupon",
        "couponDescription": "Shop for shoes using this Clove coupon code and enjoy 10% off your purchase."
    },
    {
        "couponCode": "ADBEX",
        "couponTitle": "Take Extra 5% Off Any Purchase ",
        "couponDescription": "Enjoy shopping and get an extra 5% discount on any purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "XR7Y6-20",
        "couponTitle": "Clove Coupon Code: Enjoy Up to 20% Off",
        "couponDescription": "Shop at Clove for footwear and get up to 20% off your purchase when you redeem this Clove discount code at checkout."
    },
    {
        "couponCode": "WELCOME15",
        "couponTitle": "15% Off Your Order at Clove",
        "couponDescription": "Shop for sneakers using this Clove discount code and get your order for 15% off."
    },
    {
        "couponCode": "ADBEY",
        "couponTitle": "Clove Promo Code: Get Extra 5% Off Any Order ",
        "couponDescription": "Redeem this promo code at checkout and save an extra 5% on any order."
    },
    {
        "couponCode": "ADBES",
        "couponTitle": "Clove Discount Code: Save Up to 5% on Any Item ",
        "couponDescription": "Shop at Clove and enjoy up to a 5% discount on any item. Apply this discount code at checkout."
    },
    {
        "couponCode": "earlybfvip",
        "couponTitle": "Take Up to 25% Off Instantly",
        "couponDescription": "Instantly save up to 25% from your cart when you enter this Clove discount code at checkout."
    }
]