[
    {
        "couponCode": "NFSD",
        "couponTitle": "Enjoy Free Shipping on Your Order Sitewide",
        "couponDescription": "Get free shipping on all orders at Cheryl's Cookies with this promo code. Shop your favorite treats and enjoy fast, free delivery. Don't miss out on this sweet deal."
    },
    {
        "couponCode": "15HOL",
        "couponTitle": "Cheryl's Cookies Coupon: 15% Off Your Purchase",
        "couponDescription": "Indulge in the sweetness of saving with a 15% off coupon for Cheryl's Cookies. From their famous buttercream frosted cookies to gourmet brownies and delightful cookie assortments, this coupon code applies to a mouthwatering array of treats that are perfect for any occasion."
    },
    {
        "couponCode": "10TREAT",
        "couponTitle": "Enjoy 10% Off Your Orders With Code",
        "couponDescription": "Add this Cheryl's Cookies promo code to take take 10% off your purchase."
    },
    {
        "couponCode": "10COOKIE",
        "couponTitle": "Get A 10% Off On Your Shopping Spree",
        "couponDescription": "Enjoy 10% Discount on Your Purchase"
    },
    {
        "couponCode": "BOGODEAL",
        "couponTitle": "Save 50% Off",
        "couponDescription": "Score one for 50% off when you buy one on cookies at Cheryls."
    },
    {
        "couponCode": "HOLIDAYFREE",
        "couponTitle": "Cheryl's Coupon: Free Shipping On Your Order",
        "couponDescription": "Receive free shipping on your purchase with this Cheryl's code."
    },
    {
        "couponCode": "20XFLWS",
        "couponTitle": "Cheryl's Cookies Coupon: 20% Off Your Purchase",
        "couponDescription": "Use this promo code at checkout to get 20% off select holiday cookies and flowers."
    },
    {
        "couponCode": "15TRY",
        "couponTitle": "Cheryl's Cookies Promo Code: Save 15% on Any Order",
        "couponDescription": "Apply this promo code at checkout for a 15% discount on your order."
    },
    {
        "couponCode": "CH5",
        "couponTitle": "Only $5.99! using Coupon Code",
        "couponDescription": "Score expedited shipping on halloween gifts for only $5.99 at Cheryl's."
    },
    {
        "couponCode": "CH7",
        "couponTitle": "Cheryl's Cookies Promo Code: Get $7.99 Flat Rate Shipping on Your Order ",
        "couponDescription": "Pay just $7.99 shipping on your order. Redeem this promo code at checkout."
    },
    {
        "couponCode": "FRSHIP",
        "couponTitle": "Up to 25% Off V-Day Collection + Free Shipping!",
        "couponDescription": "Score free shipping on buttercream frosted flower cut-outs at Cheryl's Cookies."
    },
    {
        "couponCode": "GREATDEAL",
        "couponTitle": "Cheryl's Cookies Promo Code: 20% Off Your Order",
        "couponDescription": "Take an extra 20% off your purchase by using this coupon code at checkout."
    }
]