[
    {
        "couponCode": "TIM",
        "couponTitle": "Get 20% Off Of Mack Weldon",
        "couponDescription": "Score 20% off of Mack Weldon and save big on men's clothes and accessories together."
    },
    {
        "couponCode": "WILD",
        "couponTitle": "Extra 20% Off Any Purchase At Mack Weldon",
        "couponDescription": "Enter this Mack Weldon coupon code at checkout to enjoy 20% off your entire order. Save big on men's clothes today."
    },
    {
        "couponCode": "THEBIGTHING",
        "couponTitle": "Get 20% Off Your Mack Weldon Order",
        "couponDescription": "Take up to 20% off clothing with minimum spend of $150 and more at Mack Weldon. Save big on trendy men's clothes today."
    },
    {
        "couponCode": "ADBES",
        "couponTitle": "Mack Weldon Promo Code: Extra 20% Off Your Order",
        "couponDescription": "Apply an additional 20% off at checkout when you purchase eligible items using Mack Weldon's discount code on your cart."
    },
    {
        "couponCode": "BIGTHING",
        "couponTitle": "Save Extra 20% On Orders $100+ At Mack Weldon",
        "couponDescription": "Shop at Mack Weldon and get an extra 20% discount on orders over $100. Apply this discount code at checkout."
    },
    {
        "couponCode": "ADBEK",
        "couponTitle": "Mack Weldon Coupon: 20% Off Your Purchase Sitewide",
        "couponDescription": "Save 20% on your sitewide order at Mack Weldon with this coupon. Shop their premium selection of apparel designed for comfort and style. Don't miss this chance to refresh your wardrobe at a great price."
    },
    {
        "couponCode": "FINDINGMASTERY",
        "couponTitle": "Mack Weldon Discount Code: 20% Off",
        "couponDescription": "Save 20% using this coupon code on your $100+ purchase at Mack Weldon."
    },
    {
        "couponCode": "ERICG20",
        "couponTitle": "Get 20% Off Any Purchase At Mack Weldon",
        "couponDescription": "Use this Mack Weldon coupon code at checkout to save 20% off your orders and save big on men's accessories like socks, hats, and more."
    },
    {
        "couponCode": "MYWORLD",
        "couponTitle": "Score 20% Off Your Mack Weldon Purchase",
        "couponDescription": "Save 20% on your first order by entering this Mack Weldon discount code at checkout. Save big on men's jackets, vests, and more."
    },
    {
        "couponCode": "ADBET",
        "couponTitle": "Take 20% Off Your Order Sitewide",
        "couponDescription": "Enjoy 20% off your entire order at Mack Weldon with this promo code. Shop a wide range of high-quality apparel and essentials designed for comfort and style. Don't miss this chance to upgrade your wardrobe at a great price."
    },
    {
        "couponCode": "adbel",
        "couponTitle": "Save 20% on Orders $100+ ",
        "couponDescription": "Shop at Mack Weldon and get a 10% discount on orders over $100. Apply this discount code at checkout."
    },
    {
        "couponCode": "Garbage",
        "couponTitle": "Get 20% Off Your Order At Mack Weldon",
        "couponDescription": "Apply this Mack Weldon coupon code at checkout to take 20% off your orders. Save big on men's clothes today."
    },
    {
        "couponCode": "ADBEM",
        "couponTitle": "Mack Weldon Coupon: 20% Off Your Order",
        "couponDescription": "Take 20% off men's tops, bottoms and more at Mack Weldon."
    },
    {
        "couponCode": "ADBEX",
        "couponTitle": "Mack Weldon Promo Code: 20% Off",
        "couponDescription": "Buy and save 20% with this discount code for select items on your purchase at Mack Weldon."
    },
    {
        "couponCode": "ADBER",
        "couponTitle": "Mack Weldon Promo Code: Extra 20% Off Your Purchase",
        "couponDescription": "Order using Mack Weldon's coupon code and receive an additional 20% off your sitewide purchase at checkout."
    },
    {
        "couponCode": "YSK",
        "couponTitle": "Receive 20% Off Your Order Sitewide",
        "couponDescription": "Get 20% off your order at Mack Weldon with this coupon code. Shop quality clothing for less and enjoy a wide selection of items. Don't miss out on this limited-time offer to save on your next purchase."
    },
    {
        "couponCode": "SODER",
        "couponTitle": "Get 20% Off Your Mack Weldon Order",
        "couponDescription": "Take 20% off when you spend $100 and more at Mack Weldon. Save big on men's clothes today."
    },
    {
        "couponCode": "83WEEKS",
        "couponTitle": "Get 20% Off Your Mack Weldon Order",
        "couponDescription": "Take up to 20% off bottoms, tops and more for men at Mack Weldon."
    },
    {
        "couponCode": "DRNOC20",
        "couponTitle": "Get 20% Off Your Purchase",
        "couponDescription": "Use this Mack Weldon discount code to save 20% on clothing."
    },
    {
        "couponCode": "LEGALAF",
        "couponTitle": "Get 20% Off Of Your Mack Weldon Order",
        "couponDescription": "Save 20% off of Mack Weldon and save big on men's clothes and accessories like socks, underwear, polos, and more."
    }
]