[
    {
        "couponCode": "GOODBYE2024",
        "couponTitle": "Sam Edelman Coupon: $30 Off Your Order",
        "couponDescription": "Take $30 off when you purchase $130 and more at Sam Edelman."
    },
    {
        "couponCode": "GIFT35",
        "couponTitle": "35% Off Your Purchase At Sam Edelman",
        "couponDescription": "Add this Sam Edelman discount code at checkout to take 35% off your orders of select items."
    },
    {
        "couponCode": "GIFT30",
        "couponTitle": "Sam Edelman Promo Code: 30% Off Holiday Sale",
        "couponDescription": "Add this Sam Edelman promo code at checkout to save 30% off your orders on the Holiday Sale."
    },
    {
        "couponCode": "WOW10SEK",
        "couponTitle": "Sam Edelman Promo Code: Save 10% on Any Purchase",
        "couponDescription": "Utilize this promo code to avail a 10% discount on all purchases at Sam Edelman. Enjoy savings on your favorite Sam Edelman products."
    },
    {
        "couponCode": "loyalist30",
        "couponTitle": "Sam Edelman Promo Code: 30% Off Your Order",
        "couponDescription": "Use this discount code at checkout to save 30% on your qualifying purchase."
    },
    {
        "couponCode": "SUNNY25",
        "couponTitle": "Sam Edelman Promo Code: Extra 25% Off Your Purchase",
        "couponDescription": "Save an additional 25% when you purchase sale sandals using Sam Edelman's discount code on your cart."
    },
    {
        "couponCode": "HURRY25",
        "couponTitle": "Sam Edelman Discount Code: 25% Off Your Order",
        "couponDescription": "Purchase at Sam Edelman and get 25% off sale items using this coupon code on your cart."
    },
    {
        "couponCode": "SANDAL30",
        "couponTitle": "Sam Edelman Coupon Code: Take 30% Off Any Sandals ",
        "couponDescription": "Enjoy a 30% discount on any sandals when you enter this coupon code at checkout."
    },
    {
        "couponCode": "HURRY20",
        "couponTitle": "Sam Edelman Coupon: Extra 20% Off Any Order",
        "couponDescription": "Apply this promo code during checkout for an extra 20% discount on your order."
    },
    {
        "couponCode": "Holiday40",
        "couponTitle": "Take 40% Off Your Purchase ",
        "couponDescription": "Enjoy shopping and get a 40% discount on your purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "BUYMORE",
        "couponTitle": "Sam Edelman Discount Code: Save $50 on Orders $200+",
        "couponDescription": "Shop at Sam Edelman and enjoy a $50 discount on orders over $200. Apply this discount code at checkout."
    },
    {
        "couponCode": "GIFT40",
        "couponTitle": "Sam Edelman Coupon: 40% Off Your Order & Free Shipping",
        "couponDescription": "Enjoy 40% off your entire order at samedelman.com with their sitewide promo code. Plus, get free shipping on your order."
    }
]