[
    {
        "couponCode": "BLACKFRIDAY40",
        "couponTitle": "VEED Coupon Code: Get 40% off annual Pro subscription",
        "couponDescription": "Use this VEED promo code at checkout to claim 40% off VEED's Annual Pro plan plus access to a free video recording setup guide."
    },
    {
        "couponCode": "VEEDAUTUMN24",
        "couponTitle": "VEED Discount Code: Save 30% on 1st Year Annual Plan",
        "couponDescription": "Apply this discount code at checkout and enjoy a 30% discount on first year annual plan."
    },
    {
        "couponCode": "UPGRADEVEED24",
        "couponTitle": "Save 30% on Your First Year with VEED",
        "couponDescription": "Sign up for an annual plan at VEED and get 30% off your first years subscription."
    },
    {
        "couponCode": "VEED4REAL",
        "couponTitle": "Get 20% Off with VEED Promo Code",
        "couponDescription": "Apply this code at checkout to receive 20% off VEED annual and standard plans and subscriptions."
    },
    {
        "couponCode": "DPF",
        "couponTitle": "VEED Promo Code: Take 25% Off All Plans",
        "couponDescription": "Use this chance and redeem this code to take 25% off all VEED plans. Save money while creating seamless video edits."
    },
    {
        "couponCode": "VEEDOCT24",
        "couponTitle": "VEED Coupon Code: Get 30% Off Your Subscription",
        "couponDescription": "Apply this exclusive coupon code for a 30% discount on your first month or 30% off your annual subscription at VEED."
    },
    {
        "couponCode": "ENJOYVEED24",
        "couponTitle": "VEED Coupon: 30% Off Your 1st Year Plan or 30% Off 1 Standard Month ",
        "couponDescription": "Score major savings at veed.io with a whopping 30% off the first year of their annual plan or slash 30% off your first month on their standard plan. Just use this coupon code to save on premium video editing technology."
    },
    {
        "couponCode": "BC30PRO",
        "couponTitle": "VEED Coupon Code: Save 30% + Exclusive Boot Camp Access",
        "couponDescription": "Use this VEED promo code at checkout to save 30% off Pro Annual plus get an exclusive Boot Camp Access."
    },
    {
        "couponCode": "VEEDNOW24",
        "couponTitle": "Take 20% Off Your Purchase",
        "couponDescription": "Receive 20% off your annual subscription with this Veed code"
    },
    {
        "couponCode": "VEEDSUMMER24",
        "couponTitle": "VEED Coupon: 20% Off",
        "couponDescription": "Take 20% off the first-year annual plan and 20% off 1 month standard plan on your purchase using VEED's promo code at checkout."
    }
]