[
    {
        "couponCode": "MERRY24",
        "couponTitle": "Save 20% on Your Purchase ",
        "couponDescription": "Shop at Cratejoy and get a 20% discount on your purchase. Apply this discount code at checkout."
    },
    {
        "couponCode": "HOLIDAY24",
        "couponTitle": "Cratejoy Coupon: Get 50% Off Your Order",
        "couponDescription": "Receive a 50% discount on all orders. Use this promo code at checkout."
    },
    {
        "couponCode": "CRATEJOY25",
        "couponTitle": "Cratejoy Copuon: 25% Off",
        "couponDescription": "Shop and save 25% with this promo code for the first box with a 3+ month subscription on your cart at Cratejoy"
    },
    {
        "couponCode": "HALFOFF",
        "couponTitle": "Get 50% Off Your First Box with a 3-Month Subscription Plan",
        "couponDescription": "Take advantage of a fantastic 50% discount on the first box when you sign up for a 3-month subscription at Cratejoy.com. This is an ideal opportunity to sample the curated selection of goodies without breaking the bank. Today is the perfect day to save money at Cratejoy because this incredible deal allows you to explore new interests, indulge in luxuries, or even find your current favorite hobby, all while keeping your budget in check."
    },
    {
        "couponCode": "CJSAVE20",
        "couponTitle": "Take 20% Off Participating Boxes ",
        "couponDescription": "Enjoy shopping and get a 20% discount on participating boxes when you enter this coupon code at checkout."
    },
    {
        "couponCode": "WELCOME20",
        "couponTitle": "Save 20% Off w/ Discount Code",
        "couponDescription": "Take 20% off on your first subscription to Emma and Chloe - Valid for New Customers only"
    },
    {
        "couponCode": "GIFT24",
        "couponTitle": "Score 20% Off Your Purchase Instantly",
        "couponDescription": "Use this Cratejoy discount code at checkout to receive 20% off your eligible order."
    },
    {
        "couponCode": "BLACKFRIDAY24",
        "couponTitle": "Cratejoy Promo Code: 20% Off",
        "couponDescription": "Apply 20% off at checkout when you purchase using Cratejoy's discount code on your cart."
    },
    {
        "couponCode": "FREESHIPFORYOU",
        "couponTitle": "Cratejoy Coupon: Free Shipping on Your Gift Box Order",
        "couponDescription": "Use this coupon code and kick off your holiday gifting with free shipping on select curated boxes. Plus, enjoy free shipping."
    },
    {
        "couponCode": "SHARETHEJOY",
        "couponTitle": "Save 25% on Father's Day Boxes ",
        "couponDescription": "Shop at Cratejoy and get a 25% discount on Father's Day boxes. Apply this discount code at checkout."
    },
    {
        "couponCode": "FIRSTBOXFREE",
        "couponTitle": "free shipping on 1st shipment on a 6 or 12 month prepay With Code",
        "couponDescription": "Enter this Cratejoy promo code to receive free shipping on first shipment on a 6 or 12 month prepay."
    },
    {
        "couponCode": "LOVEMOM",
        "couponTitle": "Enjoy 50% Off Sitewide",
        "couponDescription": "Get ready to spread some joy, because Cratejoy is offering an amazing deal. Enjoy a fantastic 50% discount on your first box when you sign up for a 3+ month prepay plan. Just use this discount code at Cratejoy.com and let the happiness begin. Treat yourself or your loved ones to some Cratejoy magic."
    },
    {
        "couponCode": "COMEBACK10",
        "couponTitle": "Up to 10% Off Your Order w/ Coupon",
        "couponDescription": "Receive up to 10% off your eligible purchase by simply using this Cratejoy discount code at checkout."
    },
    {
        "couponCode": "EARLYBF24",
        "couponTitle": "Cratejoy Discount Code: Extra 20% Off Your Purchase",
        "couponDescription": "Receive an additional 20% off sitewide orders on your shopping cart when you apply Cratejoy's coupon code at checkout."
    },
    {
        "couponCode": "CRATEJOY30",
        "couponTitle": "Save 30% Off w/ Promo Code",
        "couponDescription": "Score 30% off with code"
    },
    {
        "couponCode": "CYBERMONDAY24",
        "couponTitle": "Get 30% Off Your Order",
        "couponDescription": "Enjoy 30% off your entire purchase this cyber week deals at Cratejoy."
    },
    {
        "couponCode": "MOTHERS2024",
        "couponTitle": "Cratejoy Coupon: Up to 50% Off Your 1st Box",
        "couponDescription": "Get ready to unbox some joy with Cratejoy. Use their online coupon and save up to 50% on your first box. It's the perfect chance to discover eligible boxes that pique your interest."
    },
    {
        "couponCode": "HBD9",
        "couponTitle": "Cratejoy Coupon: 40% Off Your First Box ",
        "couponDescription": "Are you ready to save some cash today? Here's a thrilling deal just for you. Get a whopping 40% off on your very first box when you pre-order for 3 months or more at cratejoy.com. Don't miss out on this incredible bargain."
    },
    {
        "couponCode": "CRATEJOY10",
        "couponTitle": "Get 10% Off Premier Wellness Box with Promo Code",
        "couponDescription": "Get a 10% discount on your purchase of the premier wellness box. Enter this coupon code at checkout."
    },
    {
        "couponCode": "CYBERGIFT24",
        "couponTitle": "Get $20 Off Your Order",
        "couponDescription": "Save $20 on selected boxes this cyber monday offer at Cratejoy."
    }
]