[
    {
        "couponCode": "EXTRA15",
        "couponTitle": "Save 15% Off",
        "couponDescription": "Get an Extra 15% Off on Select Items"
    },
    {
        "couponCode": "NAIL5",
        "couponTitle": "Get 5% Off Sitewide",
        "couponDescription": "Score 5% off your current Beyond Polish purchase when you use this promo code at checkout. Get discounted prices on nail polish, gel polish, and nail care products."
    },
    {
        "couponCode": "NAIL5OFF75",
        "couponTitle": "$5 Off Sitewide ",
        "couponDescription": "Save $5 on your current purchase at Beyond Polish. With so many amazing colors and nail care products, now is the perfect time to find the perfect look. Enjoy exceptional quality and unbeatable prices - shop now with this exclusive discount code and get your nails summer-ready."
    },
    {
        "couponCode": "NAILB1G1",
        "couponTitle": "Enjoy 10% Off Sitewide",
        "couponDescription": "Use this Beyond Polish promo code and get 10% off your order. Treat yourself to a new manicure set today."
    },
    {
        "couponCode": "MANI5OFF75",
        "couponTitle": "Beyond Polish Coupon: $5 Off Your Order of $75+",
        "couponDescription": "Save $5 on your order of $75 or more at Beyond Polish. Use the coupon code to treat yourself to high-quality nail care products and essentials."
    },
    {
        "couponCode": "MANI5",
        "couponTitle": "Beyond Polish Coupon: 5% Off Your Order",
        "couponDescription": "Enjoy 5% off your purchase at Beyond Polish when you use this promo code at checkout."
    },
    {
        "couponCode": "MANIB1G1",
        "couponTitle": "Beyond Polish Coupon: Buy One, Get One 10% Off ",
        "couponDescription": "Use this Beyond Polish coupon code to enjoy 10% off your second item. Elevate your nail care routine with premium polishes and tools from Beyond Polish."
    },
    {
        "couponCode": "FREESHIP45",
        "couponTitle": "Beyond Polish Coupon: Free Shipping on Your Order",
        "couponDescription": "Take free shipping on your $45+ purchase using this Beyond Polish promo code at checkout."
    },
    {
        "couponCode": "CM20",
        "couponTitle": "20% Off Your $75+ Orders At Beyond Polish",
        "couponDescription": "Enter this Beyond Polish coupon code at checkout to claim 20% off your orders of $75 or more."
    },
    {
        "couponCode": "B3G1",
        "couponTitle": "Buy 3 Get 1 75% Off At Beyond Polish",
        "couponDescription": "Add this Beyond Polish promo code at checkout for a buy 3, get one 75% offer on your orders."
    }
]