[
    {
        "couponCode": "BETSY20",
        "couponTitle": "Elie Tahari Coupon: 20% Off Your Order",
        "couponDescription": "Enjoy extra 20% off sitewide by adding this Elie Tahari code."
    },
    {
        "couponCode": "ET50",
        "couponTitle": "Enjoy $50 Discount on Purchases of $250+",
        "couponDescription": "Unleash the shopping spree with their online coupon code at elietahari.com. Enjoy a whopping $50 off when you spend $250 or more. It's the perfect excuse to splurge on your favorite styles."
    },
    {
        "couponCode": "ELIE10",
        "couponTitle": "Get $10 Off When You Spend $50+",
        "couponDescription": "Get ready to snag a fantastic deal. Use this coupon at elietahari.com and enjoy a $10 discount when you spend $50 or more. It's time to upgrade your wardrobe without breaking the bank. Happy shopping."
    },
    {
        "couponCode": "EOS25",
        "couponTitle": "Elie Tahari Promo Code: 25% Off Your Order",
        "couponDescription": "Shop and receive 25% off select styles on your purchase using this discount code at Elie Tahari."
    },
    {
        "couponCode": "MARIA20",
        "couponTitle": "Score 20% Off Your Order w/ Promo Code",
        "couponDescription": "Take 20% off your qualifying purchase when you apply this Elie Tahari coupon code at checkout."
    },
    {
        "couponCode": "30FRIENDS",
        "couponTitle": "Elie Tahari Coupon: Extra 30% Off Your Purchase",
        "couponDescription": "Receive an additional 30% off Select Styles on your order with Elie Tahari's promo code. Redeem at checkout."
    },
    {
        "couponCode": "JESSI20",
        "couponTitle": "Get 20% Off Any Order ",
        "couponDescription": "Paste this promo code at checkout and save 20% on any order."
    },
    {
        "couponCode": "FRIENDS30",
        "couponTitle": "Get 30% Discount Using Promo Code",
        "couponDescription": "Save 30% off with code"
    },
    {
        "couponCode": "FR2MXDFA",
        "couponTitle": "Take Extra 40% Off Sitewide",
        "couponDescription": "Get an extra 40% off sitewide at Elie Tahari with this coupon code. Shop the latest styles and save big on your favorite pieces. Don't miss out on this limited-time offer."
    },
    {
        "couponCode": "FRNXM8FA",
        "couponTitle": "Receive 40% Off Your Order Sitewide",
        "couponDescription": "Save 40% on your order at Elie Tahari with this discount code. Shop stylish clothing, accessories, and more for less. This offer is available for a limited time only."
    },
    {
        "couponCode": "BFCM30",
        "couponTitle": "Elie Tahari Coupon: 30% Off Your Order",
        "couponDescription": "Save 30% on new arrivals by adding this \nElie Tahari code."
    },
    {
        "couponCode": "FRMHXTFA",
        "couponTitle": "Get 40% Off Select Items",
        "couponDescription": "Save 40% on select items at Elie Tahari with this exclusive discount code. Shop stylish designs and premium quality at a lower price. Dont miss this limited-time offer."
    },
    {
        "couponCode": "FRPRKCFA",
        "couponTitle": "Elie Tahari Promo Code: 40% Off Your Order",
        "couponDescription": "Shop and take 40% off your purchase using a coupon code on your cart."
    },
    {
        "couponCode": "FR2BXMFA",
        "couponTitle": "Elie Tahari Coupon: 40% Off Your Order",
        "couponDescription": "Take 40% off dresses and accessories with this Elie Tahari code."
    },
    {
        "couponCode": "FR57K9FA",
        "couponTitle": "Elie Tahari Promo Code: Extra 30% Off Your Order",
        "couponDescription": "Shop and take an extra 30% off your purchase using a coupon code on your cart."
    },
    {
        "couponCode": "WEHFHQ55EL",
        "couponTitle": "Take 15% Off Your Purchase ",
        "couponDescription": "Enjoy shopping and get a 15% discount on your purchase when you enter this coupon code at checkout."
    },
    {
        "couponCode": "FREESHIP",
        "couponTitle": "Get Free Shipping Coupon Code",
        "couponDescription": "Order $350+ on your cart and receive Free Shipping when you shop at Elie Tahari using the coupon code at checkout."
    },
    {
        "couponCode": "CS30",
        "couponTitle": "Elie Tahari Coupon: Extra 30% Off Your Order",
        "couponDescription": "Get ready to revamp your wardrobe with Elie Tahari's Cyber Monday Sale. With an extra 30% off sitewide, you can snatch up the best deals on their latest fashion-forward pieces. Don't miss out on this opportunity to grab your favorite designs at unbeatable prices."
    },
    {
        "couponCode": "WER8353NEL",
        "couponTitle": "Elie Tahari Discount Code: Up to 20% Off Your Purchase",
        "couponDescription": "Visit Elie Tahari and get up to 20% off orders with this coupon code on your cart at checkout."
    },
    {
        "couponCode": "WET39758EL",
        "couponTitle": "Elie Tahari Coupon: 10% Off Your Purchase",
        "couponDescription": "Get 10% off your qualifying order using this discount code during checkout."
    }
]